{
  "slug" : "onions",
  "source" : "Almanac.com",
  "url" : "https://www.almanac.com/plant/onions",
  "commonName" : "How to Grow Onions: Plant, Grow & Harvest Big Bulbs",
  "description" : null,
  "companionSection" : null,
  "plantingGuide" : "### Planting\nOnions need to grow in full sun and in a spot where they won’t be shaded by other vegetables. The more energy they can get from sunlight, the larger their bulbs can grow. Soil must be well-draining and loose—sandy-loam to silt-loam, not heavy clay or compact. Mix aged manure or compost into the soil in the fall or early spring to improve texture. Soil pH should be between 6.9 and 6.8. Have your soil tested. Onions don’t grow in high-acid soils. When to Plant Onions Plant onion sets (dormant bulbs) that can be planted directly into the ground in early spring, as soon as the ground can be worked and the danger of hard freezes has passed. This is typically around 2 to 4 weeks before your last expected spring frost date. Start onion seeds indoors: 8 to 10 weeks before your area’s last spring frost date, which typically means planting them in late winter. Some gardeners will start even earlier to grow seeds to roughly the same bulb size. Check out our tips for growing onions from seed. Transplant seedlings or plant starters outside in early spring when the soil is workable, about 2 to 4 weeks before the last spring frost. Onions require soil at least 50°F to germinate, so they should be started indoors about 6 weeks before transplanting to the garden and no longer likely to dip below 28°F (-2°C). This means snow has melted, the days are warmer, and nights are still near freezing. For us in the northern zones, we’re talking April or early May. A fall-planted crop of onions needs at least 4 to 6 weeks of warm temperatures to become established in the ground. They will remain dormant during the cool season; as the temperatures and soil warm again in early spring, the onions return to life. Photo credit: YuriyS/GettyImages How to Plant Onions Indoors Whether you’re planting seeds or sets, get a shallow tray and fill it with compost to the top. Modular trays with a small section for each bulb are ideal. Plant seeds 1/4 to 1/2 inch deep, or plant the onion bulbs so that the pointy end is just peeking over the top of the soil. Lightly water the tray and let it drain through. Set onions in a warm place, such as a well-lit windowsill. Thin to 3 to 4 inches. How to Plant Onions Outdoors Onion plants are heavy feeders and require constant nourishment to produce big bulbs. At planting time, add nitrogen fertilizer. Many organic gardeners will add an inch of compost to the bottom of each row before planting. Or, dig a trench in the soil about 2 inches deep and 3 inches wide, and then fill the trench back in with about an inch of compost. If planting onion sets outdoors, bury them 2 to 6 inches apart, gently pressing them 1 to 2 inches deep into loose soil. (Use the closer spacing if you want to pull immature onions as scallions.) Don’t bury them more than 2 inches under the soil. Onions mustn’t be planted too deep, as this can affect bulb development. If you are direct seeding outdoors, sow seeds 1/4 to 1/2 inch deep once the soil is workable. Once onions begin to grow, thin them to 3 to 4 inches apart. Plants thinned from the row to create room can be used as green onions. Space the seedlings in rows 12 to 18 inches apart. If you are transplanting from indoors, don’t forget to harden off the young plants for at least a week. Mulch with straw between rows to help retain moisture and stifle weeds.\n\n### When to Plant Onions\n- Plant onion sets (dormant bulbs) that can be planted directly into the ground in early spring, as soon as the ground can be worked and the danger of hard freezes has passed. This is typically around 2 to 4 weeks before your last expected spring frost date.\n- Start onion seeds indoors: 8 to 10 weeks before your area’s last spring frost date, which typically means planting them in late winter. Some gardeners will start even earlier to grow seeds to roughly the same bulb size. Check out our tips for growing onions from seed.\n- Transplant seedlings or plant starters outside in early spring when the soil is workable, about 2 to 4 weeks before the last spring frost. Onions require soil at least 50°F to germinate, so they should be started indoors about 6 weeks before transplanting to the garden and no longer likely to dip below 28°F (-2°C). This means snow has melted, the days are warmer, and nights are still near freezing. For us in the northern zones, we’re talking April or early May.\n- A fall-planted crop of onions needs at least 4 to 6 weeks of warm temperatures to become established in the ground. They will remain dormant during the cool season; as the temperatures and soil warm again in early spring, the onions return to life.\n\n### How to Plant Onions Indoors\nWhether you’re planting seeds or sets, get a shallow tray and fill it with compost to the top. Modular trays with a small section for each bulb are ideal.\n- Plant seeds 1/4 to 1/2 inch deep, or plant the onion bulbs so that the pointy end is just peeking over the top of the soil.\n- Lightly water the tray and let it drain through.\n- Set onions in a warm place, such as a well-lit windowsill.\n- Thin to 3 to 4 inches.\n\n### How to Plant Onions Outdoors\nOnion plants are heavy feeders and require constant nourishment to produce big bulbs. At planting time, add nitrogen fertilizer. Many organic gardeners will add an inch of compost to the bottom of each row before planting. Or, dig a trench in the soil about 2 inches deep and 3 inches wide, and then fill the trench back in with about an inch of compost.\n- If planting onion sets outdoors, bury them 2 to 6 inches apart, gently pressing them 1 to 2 inches deep into loose soil. (Use the closer spacing if you want to pull immature onions as scallions.) Don’t bury them more than 2 inches under the soil. Onions mustn’t be planted too deep, as this can affect bulb development.\n- If you are direct seeding outdoors, sow seeds 1/4 to 1/2 inch deep once the soil is workable.\n- Once onions begin to grow, thin them to 3 to 4 inches apart. Plants thinned from the row to create room can be used as green onions. Space the seedlings in rows 12 to 18 inches apart.\n- If you are transplanting from indoors, don’t forget to harden off the young plants for at least a week.\n- Mulch with straw between rows to help retain moisture and stifle weeds.\n\n### How to Grow Cucumber Plants: Easy Guide to Planting & Harvesting\n",
  "careInstructions" : "### Growing\nWe find it helpful to think of onions as a leaf crop (like lettuce or kale) rather than a root crop (like beets or carrots). Fostering healthy foliage growth ensures the plants have enough energy to form large bulbs. Ensure immature bulbs stay covered with light mulch to protect them, retain moisture, suppress weeds, and allow air circulation. Do not cover emerging onions. Fertilize every few weeks with nitrogen to get big bulbs. Stop fertilizing when the onions push the soil away, and the bulbing process has started. Do not put the soil back around the onions; the bulb needs to emerge above the soil. Generally, onion plants do not need consistent watering if light mulch is used. About 1 inch of water per square foot per week, including rainwater, is sufficient. If you want sweeter onions, water more. To deter bolting, water them often during hot spells. To deter thrips, intercrop onions with tomatoes or carrots in closely alternating rows. See our video demo to see how to plant and grow perfect onions! Growing Onions in Containers You can also grow onions in containers! Prepare a container that is at least 10 inches deep and as wide as possible (to allow for space between maturing onions). A 5-gallon bucket will support 4 to 6 onions, and a tub many more. Place the container where it will receive the maximum hours of direct sunlight per day. (It will be heavy to move once filled and planted.) Provide a well-draining potting mix that is rich in organic matter; add compost or well-rotted manure. Mix in a complete fertilizer, per the package guidance on container size, or fertilize with diluted fish emulsion or compost tea.\n\n### Growing Onions in Containers\nYou can also grow onions in containers! Prepare a container that is at least 10 inches deep and as wide as possible (to allow for space between maturing onions). A 5-gallon bucket will support 4 to 6 onions, and a tub many more. Place the container where it will receive the maximum hours of direct sunlight per day. (It will be heavy to move once filled and planted.)\nProvide a well-draining potting mix that is rich in organic matter; add compost or well-rotted manure. Mix in a complete fertilizer, per the package guidance on container size, or fertilize with diluted fish emulsion or compost tea.",
  "harvestInfo" : "### Harvesting\nPull any onions that send up flower stalks. This means that the bulbs have stopped growing. These onions will not store well, but can be used in recipes within a few days. Spring-planted onions tend to be ready for harvesting by mid-summer. When onions start to mature, the tops (foliage) become yellow and begin to fall over. At that point, bend the tops down or even stomp on the foliage to speed up the final ripening process. Loosen the soil around the bulbs to encourage drying. Harvest by late summer in dry weather. (Wet-harvested onions do not cure well and might rot in storage.) When the tops are brown, pull the onions. Handle them carefully, as the slightest bruise (now and in storage) will encourage rot. Cut the roots and trim the tops back to 1 or 2 inches (but leave the tops on if you are planning to braid the onions together). Onion’s skin very thin, Mild winter coming in; Onion’s skin thick and tough, Coming winter cold and rough. Photo by Rootstocks/Getty Images How to Store Onions Set onions on dry ground for a few days to cure, weather permitting, or in a protected place such as a garage or barn. Once cured, hang onions in a mesh bag or nylon stocking; spread up to two layers deep in a box; or braid and hang them in a cool, dry, well-ventilated area. The ideal temperature range for storage is 40 to 60°F (4 to 15°C). Do not store in a refrigerator, as conditions will be too damp. Check periodically for sprouting or rotting onions and remove them. Don’t store onions with apples or pears, as the ethylene gas produced by the fruits will interrupt the onions’ dormancy. Onions may also spoil the flavor of these fruits (as well as potatoes). A pungent onion will store longer than a sweet onion. Sweet onions have a high water content and do not keep well. Eat the sweet varieties first and save the more pungent onions for later. To avoid bruising, store them so that they do not touch each other—for example, in clean old pantyhose. Slip in the onions one at a time, tying a knot between each one. Hang them in a cool, dry place. You can also braid your onions for extended storage. Learn to braid onions! Check out this video to learn how to harvest and store onions.\n\n### How to Grow Cucumber Plants: Easy Guide to Planting & Harvesting\n",
  "pestsAndDiseases" : "### Pests/Diseases\nThrips: To control thrips—tiny insects about as fat as a sewing needle—take a dark piece of paper into the garden and knock the onion tops against it; if thrips are present, you will spot their tan-colored bodies on the paper. A couple of treatments with insecticidal soap kills them. Follow the package directions. Spray the plants twice, 3 days apart, and the thrips should disappear. To prevent future infestations, consider using row covers. Onion Maggots: Cover your emerging onion crop with fine mesh netting or row covers. Seal it by mounding the soil around the edges. The onion maggot fly likes to lay its eggs at the base of plants, so the netting should prevent that. You should also keep mulch away because the insects like decaying organic matter, and make sure you completely harvest your onions as the season progresses. Onion maggots are usually a problem in very rainy periods, so these precautions may be unnecessary if you have a dry season. White Rot: This very serious disease starts with infected plant material. Avoid transplants grown in soil-based compost. Stick to starting from onion seeds, onion sets, and bulbs bought from inspected producers. With white rot, the foliage will yellow and wilt; below ground, white, fluffy fungal growth appears on the base of the bulb. Unfortunately, once rot sets in, there is no solution. Dig up the crop and dispose of it in the trash (do not compost). Avoid growing onions in the same location in future seasons, as the dirt will remain infected for many years.",
  "rawHtml" : "<!DOCTYPE html>\n<html lang=\"en\" dir=\"ltr\" prefix=\"og: https://ogp.me/ns#\" class=\"h-full bg-background\">\n  <head>\n    <meta charset=\"UTF-8\" />\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n    <meta name=\"p:domain_verify\" content=\"f46e5dfff350743298ae1e5af21e8dd1\"/>\n    <meta name=\"msvalidate.01\" content=\"3B427AB94F44374B431B678687BA15C2\" />\n\n    <meta name=\"apple-mobile-web-app-title\" content=\"Almanac\" />\n    <meta name=\"theme-color\" content=\"#455775\" />\n    <meta name=\"msapplication-navbutton-color\" content=\"#455775\" />\n    <meta name=\"apple-mobile-web-app-status-bar-style\" content=\"#455775\" />\n\n    <title>Growing Onions: Planting, Growing, and Harvesting Onions | The Old Farmer&#039;s Almanac</title>\n    <meta charset=\"utf-8\" />\n<meta name=\"description\" content=\"Want to grow flavorful, long-storing onions? Learn when and how to plant onions, whether from seed or sets. Discover top tips for growing, harvesting, and curing onions like a pro.\" />\n<link rel=\"canonical\" href=\"https://www.almanac.com/plant/onions\" />\n<meta name=\"robots\" content=\"index, follow\" />\n<link rel=\"icon\" href=\"/themes/almanaco/images/favicon.ico\" />\n<link rel=\"mask-icon\" href=\"/themes/almanaco/images/safari-pinned-tab.svg\" />\n<link rel=\"icon\" sizes=\"16x16\" href=\"/themes/almanaco/images/favicon-16x16.png\" />\n<link rel=\"icon\" sizes=\"32x32\" href=\"/themes/almanaco/images/favicon-32x32.png\" />\n<link rel=\"icon\" sizes=\"192x192\" href=\"/themes/almanaco/images/android-chrome-192x192.png\" />\n<link rel=\"apple-touch-icon\" href=\"/themes/almanaco/images/apple-touch-icon-60x60.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"76x76\" href=\"/themes/almanaco/images/apple-touch-icon-76x76.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"120x120\" href=\"/themes/almanaco/images/apple-touch-icon-120x120.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"152x152\" href=\"/themes/almanaco/images/apple-touch-icon-152x152.png\" />\n<meta property=\"og:site_name\" content=\"Almanac.com\" />\n<meta property=\"og:type\" content=\"article\" />\n<meta property=\"og:url\" content=\"https://www.almanac.com/plant/onions\" />\n<meta property=\"og:title\" content=\"How to Grow Onions: Plant, Grow &amp; Harvest Big Bulbs\" />\n<meta property=\"og:description\" content=\"Want to grow flavorful, long-storing onions? Learn when and how to plant onions, whether from seed or sets. Discover top tips for growing, harvesting, and curing onions like a pro.\" />\n<meta property=\"og:image\" content=\"https://www.almanac.com/sites/default/files/styles/large/public/image_nodes/shutterstock_2203736779.jpg?itok=Vq-psAk3\" />\n<meta property=\"og:image:type\" content=\"image/jpeg\" />\n<meta property=\"og:image:width\" content=\"1205\" />\n<meta property=\"og:image:height\" content=\"800\" />\n<meta property=\"og:image:alt\" content=\"The Old Farmer&#039;s Almanac\" />\n<meta property=\"fb:admins\" content=\"100002198720176,500927460,687947151,1068201072\" />\n<meta property=\"fb:app_id\" content=\"180003315384377\" />\n<meta name=\"twitter:card\" content=\"summary_large_image\" />\n<meta name=\"twitter:title\" content=\"How to Grow Onions: Plant, Grow &amp; Harvest Big Bulbs\" />\n<meta name=\"twitter:site\" content=\"@almanac\" />\n<meta name=\"Generator\" content=\"Drupal 11 (https://www.drupal.org)\" />\n<meta name=\"MobileOptimized\" content=\"width\" />\n<meta name=\"HandheldFriendly\" content=\"true\" />\n<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n<script>var ct_check_js_val = '8898c94f21d3ba0d17f2a06ffca1aa79';var drupal_ac_antibot_cookie_value = 'ca23a11e05e559b3cac9756b0aad182179cd21c898c5ed451f98170264753af2';var ct_use_cookies = 1;var ct_use_alt_cookies = 0;var ct_capture_buffer = 0;</script>\n<script type=\"application/ld+json\">{\n    \"@context\": \"https://schema.org\",\n    \"@graph\": [\n        {\n            \"@type\": \"Article\",\n            \"@id\": \"https://www.almanac.com/plant/onions\",\n            \"name\": \"How to Grow Onions: Plant, Grow \\u0026 Harvest Big Bulbs\",\n            \"headline\": \"How to Grow Onions: Plant, Grow \\u0026 Harvest Big Bulbs\",\n            \"description\": \"Want to grow flavorful, long-storing onions? Learn when and how to plant onions, whether from seed or sets. Discover top tips for growing, harvesting, and curing onions like a pro.\",\n            \"datePublished\": \"2025-05-14T00:00:00-0400\",\n            \"dateModified\": \"2025-06-26T11:36:58-0400\",\n            \"isAccessibleForFree\": \"True\",\n            \"author\": {\n                \"@type\": \"Person\",\n                \"@id\": \"https://www.almanac.com/user/170691\",\n                \"name\": \"Catherine Boeckmann\",\n                \"url\": \"https://www.almanac.com/user/170691\"\n            },\n            \"publisher\": {\n                \"@type\": \"NewsMediaOrganization\",\n                \"@id\": \"https://www.almanac.com\",\n                \"name\": \"The Old Farmer\\u0027s Almanac\",\n                \"url\": \"https://www.almanac.com\",\n                \"logo\": {\n                    \"@type\": \"ImageObject\",\n                    \"representativeOfPage\": \"True\",\n                    \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\",\n                    \"width\": \"308\",\n                    \"height\": \"108\"\n                }\n            }\n        },\n        {\n            \"@type\": \"NewsMediaOrganization\",\n            \"additionalType\": \"Organization\",\n            \"@id\": \"https://www.almanac.com/\",\n            \"description\": \"The Old Farmer’s Almanac is your trusted source for long range weather forecasts, moon phases, full moon dates and times, gardening tips, sunrise and sunset times, Best Days, tide charts, home remedies, folklore, and more.\",\n            \"sameAs\": \"https://en.wikipedia.org/wiki/Old_Farmer%27s_Almanac\",\n            \"name\": \"The Old Farmer\\u0027s Almanac\",\n            \"url\": \"https://www.almanac.com/\",\n            \"telephone\": \"1-800-ALMANAC\",\n            \"contactPoint\": {\n                \"@type\": \"ContactPoint\",\n                \"telephone\": \"+1-800-256-2622\",\n                \"email\": \"support@almanac.com\",\n                \"url\": \"https://www.almanac.com/\",\n                \"contactType\": \"customer service\",\n                \"contactOption\": \"TollFree\",\n                \"productSupported\": \"The Old Farmer\\u0027s Almanac\"\n            },\n            \"logo\": {\n                \"@type\": \"ImageObject\",\n                \"representativeOfPage\": \"True\",\n                \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\"\n            }\n        }\n    ]\n}</script>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n    \n\n        \n\n    <link rel=\"preconnect\" href=\"https://fonts.googleapis.com\" crossorigin />\n  <link rel=\"preconnect\" href=\"https://fonts.gstatic.com\" crossorigin />\n  <link rel=\"preload\" as=\"style\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n\n    <link rel=\"modulepreload\" href=\"/themes/almanac/dist/js/scripts.js\">\n\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" media=\"print\" onload=\"this.media='all'\" />\n\n    <noscript>\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n  </noscript>\n\n        <style>\n      body {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n        margin: 0;\n        background-color: #ffffff;\n      }\n      h1, h2, h3, h4, h5 {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n      }\n      a {\n        color: #595974;\n        text-decoration: none;\n      }\n      a:hover {\n        color: #ad2a24;\n      }\n    </style>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n  <script>window.freestar = { config: { enabled_slots: [] } };</script>\n\n    \n\n                                                                                                                  \n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  window.raptivetarget = {\n    tags: [],\n    category: \"\",\n    postType: \"plant\",\n    postId: 90272,\n    special: true\n  };\n\n  if (window.console && window.console.log) {\n    console.log('Raptive targeting configured:', window.raptivetarget);\n  }\n</script>\n\n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  (function(w, d) {\n    // Debug: Log that we're initializing AdThrive in head\n    if (w.console && w.console.log) {\n      w.console.log('Raptive: Initializing AdThrive script in head for path:', w.location.pathname);\n    }\n\n    w.adthrive = w.adthrive || {};\n    w.adthrive.cmd = w.adthrive.cmd || [];\n    w.adthrive.plugin = 'adthrive-ads-manual';\n    w.adthrive.host = 'ads.adthrive.com';\n\n    var s = d.createElement('script');\n    s.async = true;\n    s.setAttribute('referrerpolicy', 'no-referrer-when-downgrade');\n    s.src = 'https://' + w.adthrive.host + '/sites/6810e43f9a254b456fd9027c/ads.min.js?referrer=' + w.encodeURIComponent(w.location.href) + '&cb=' + (Math.floor(Math.random() * 100) + 1);\n\n    // Debug: Log script loading\n    s.onload = function() {\n      if (w.console && w.console.log) {\n        w.console.log('Raptive: AdThrive script loaded successfully');\n      }\n    };\n    s.onerror = function() {\n      if (w.console && w.console.error) {\n        w.console.error('Raptive: Failed to load AdThrive script');\n      }\n    };\n\n    var n = d.getElementsByTagName('script')[0];\n    n.parentNode.insertBefore(s, n);\n  })(window, document);\n</script>\n\n  \n</head>\n<body class=\"page-not-front page-type-content content-type-plant\">\n  <div class=\"region region--page-top\">\n    \n  </div>\n\n    <div class=\"dialog-off-canvas-main-canvas\" data-off-canvas-main-canvas>\n    <header id=\"page--header\" class=\"section--fullwidth\">\n  \n  \n\n    <section class=\"region--global-header flex flex-col sm:flex-row justify-between border-t-brick-red border-t-4 mb-8 text-sm px-4 shadow-sm\">\n  <div class=\"social-menu flex justify-center sm:justify-start\">\n\n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n<div class=\"global-menu flex justify-center sm:justify-end\">\n<a\n  href=\"/signup\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Get Almanac&#039;s Daily Updates\n</a>\n<a\n  href=\"/weather/longrange\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Extended Forecasts\n</a>\n<a\n  href=\"/wheretobuy\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Where to Buy\n</a>\n<a\n  href=\"/contact\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Contact Us\n</a>\n\n</div>\n\n</section>\n\n\n    \n\n<nav aria-label=\"Global\" class=\"nav section--container mb-4\">\n  \n    <div class=\"nav--logo\">\n    <a href=\"/\">\n      <span class=\"sr-only\">Almanac</span>\n      <img src=\"/themes/almanac/logo.svg\" alt=\"Almanac Logo\" width=\"309\" height=\"74\" class=\"no-bg\">\n    </a>\n    <a class=\"calendar no-underline\" href=\"/calendar/today\">\n      Thursday, October 30, 2025\n    </a>\n  </div>\n\n    <div class=\"nav--menu\">\n    <div class=\"flex flex-wrap md:justify-start md:flex-nowrap z-50 w-full transition-all duration-300\" data-nav-container>\n  <nav class=\"flex relative max-w-[85rem] w-full mx-auto md:flex md:items-center md:justify-between md:gap-3 py-2 px-4 sm:px-6 lg:px-8 transition-all duration-300\" data-nav>\n\n        <div class=\"nav-logo transition-all duration-300 flex flex-shrink-0\" data-nav-logo>\n      <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n        <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n      </a>\n    </div>\n\n        <div class=\"nav-breadcrumb transition-all duration-300 flex-1 flex justify-center min-w-0 invisible lg:visible\" data-nav-breadcrumb>\n      <nav class=\"breadcrumb\" role=\"navigation\" aria-label=\"Breadcrumb\">\n        <ol class=\"flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse min-w-28\">\n                                                                               <li class=\"inline-flex items-center\">\n                                      <a href=\"/gardening\" class=\"no-underline uppercase font-sans text-xs text-gray-600 hover:text-brick-red\">Gardening</a>\n                                  </li>\n                                                         <li class=\"inline-flex items-center\">\n                                      <span class=\"uppercase font-sans text-xs text-gray-800\">Growing Guides</span>\n                                  </li>\n                                            </ol>\n      </nav>\n    </div>\n\n        <div class=\"flex items-center gap-x-1 flex-shrink-0\">\n            <button type=\"button\" class=\"menu-toggle md:hidden relative size-9 flex justify-center items-center font-medium text-[12px] border border-gray-200 text-gray-800 hover:bg-gray-100 focus:outline-none focus:bg-gray-100 disabled:opacity-50 disabled:pointer-events-none transition-all duration-300\" data-nav-toggle>\n        <svg class=\"menu-open-icon size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <line x1=\"3\" x2=\"21\" y1=\"6\" y2=\"6\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"12\" y2=\"12\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"18\" y2=\"18\"/>\n        </svg>\n        <svg class=\"menu-close-icon hidden size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <path d=\"M18 6 6 18\"/>\n          <path d=\"m6 6 12 12\"/>\n        </svg>\n        <span class=\"sr-only\">Toggle navigation</span>\n      </button>\n      \n            <div class=\"hidden md:flex items-center gap-x-1\">\n                                          <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Gardening\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/gardening\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        All Gardening \n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/planting-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Planting Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/frostdates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Frost Dates\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/growing-guides\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Growing Guides\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/pests-and-diseases\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Pests and Problems\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Calculators and Tools\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://gardenplanner.almanac.com/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Planner\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Weather\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Weather Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/fall-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Forecast 2025\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Thanksgiving Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Winter Forecast 2025-2026\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/longrange\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        60-Day Long-Range Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        5-Day Forecast\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Moon &amp; Sun\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/astronomy\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Astronomy Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/full-moon-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Harvest Moon!\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moon Phase Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/full\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Next Full Moon\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/sun-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Sunrise and Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moonrise &amp; Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        More Astronomy Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/meteor-shower-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Meteor Showers\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/first-day-seasons\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Seasons\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Calendar\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        2025 Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Holidays and Events\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/calendar/tools\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Calendar Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/bestdays/timetable\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Best Days Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/best-fishing-days\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fishing Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/monthly-horoscope-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Horoscope\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Mercury Retrograde Dates\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Food\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/cooking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Find A Recipe\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        When to Harvest\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/cooking/preserving-food\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Canning and Pickling\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Grilling Recipes\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Baking\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Store\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"https://store.almanac.com/garden/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Garden\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Weather\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Moon &amp; Sun\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Calendars\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Food\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                              \n                <div class=\"menu-item relative mt-1\" data-nav-search>\n          <form class=\"menu-item-form\" action=\"/search/site\" method=\"get\">\n            <input\n              name=\"search_api_fulltext\"\n              type=\"text\"\n              class=\"h-10 px-5 pr-10 w-12 md:w-12 transition-all duration-300\"\n              placeholder=\"Search...\"\n            />\n            <button type=\"submit\" class=\"absolute right-0 top-0 fill-black transition-all duration-300\">\n              <svg class=\"h-5 w-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n              </svg>\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n\n        <div id=\"menu-mobile\" class=\"mobile-menu\" data-nav-menu>\n      <div class=\"mobile-menu-content\">\n        <div class=\"mobile-menu-header\">\n          <div class=\"mobile-menu-logo\">\n            <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n              <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n            </a>\n          </div>\n          <button type=\"button\" class=\"mobile-menu-close\" aria-label=\"Close menu\">\n            <svg class=\"size-6\" xmlns=\"http://www.w3.org/2000/svg\" fill=\"none\" viewBox=\"0 0 24 24\" stroke=\"currentColor\">\n              <path stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" d=\"M6 18L18 6M6 6l12 12\" />\n            </svg>\n          </button>\n        </div>\n\n        <nav class=\"mobile-menu-nav\">\n                                                  <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Gardening\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/gardening\" class=\"mobile-menu-link\">\n                      All Gardening \n                    </a>\n                                      <a href=\"/gardening/planting-calendar\" class=\"mobile-menu-link\">\n                      Planting Calendar\n                    </a>\n                                      <a href=\"/gardening/frostdates\" class=\"mobile-menu-link\">\n                      Fall Frost Dates\n                    </a>\n                                      <a href=\"/gardening/growing-guides\" class=\"mobile-menu-link\">\n                      Growing Guides\n                    </a>\n                                      <a href=\"/gardening/pests-and-diseases\" class=\"mobile-menu-link\">\n                      Pests and Problems\n                    </a>\n                                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"mobile-menu-link\">\n                      Garden Calculators and Tools\n                    </a>\n                                      <a href=\"https://gardenplanner.almanac.com/\" class=\"mobile-menu-link\">\n                      Garden Planner\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Weather\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/weather\" class=\"mobile-menu-link\">\n                      Weather Overview\n                    </a>\n                                      <a href=\"/fall-weather-forecast\" class=\"mobile-menu-link\">\n                      Fall Forecast 2025\n                    </a>\n                                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"mobile-menu-link\">\n                      Thanksgiving Forecast\n                    </a>\n                                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"mobile-menu-link\">\n                      Winter Forecast 2025-2026\n                    </a>\n                                      <a href=\"/weather/longrange\" class=\"mobile-menu-link\">\n                      60-Day Long-Range Forecast\n                    </a>\n                                      <a href=\"/weather/forecast\" class=\"mobile-menu-link\">\n                      5-Day Forecast\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Moon &amp; Sun\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/astronomy\" class=\"mobile-menu-link\">\n                      Astronomy Overview\n                    </a>\n                                      <a href=\"/content/full-moon-october\" class=\"mobile-menu-link\">\n                      OCT Harvest Moon!\n                    </a>\n                                      <a href=\"/astronomy/moon/calendar\" class=\"mobile-menu-link\">\n                      Moon Phase Calendar\n                    </a>\n                                      <a href=\"/astronomy/moon/full\" class=\"mobile-menu-link\">\n                      Next Full Moon\n                    </a>\n                                      <a href=\"/astronomy/sun-rise-and-set\" class=\"mobile-menu-link\">\n                      Sunrise and Set Times\n                    </a>\n                                      <a href=\"/astronomy/moon-rise-and-set\" class=\"mobile-menu-link\">\n                      Moonrise &amp; Set Times\n                    </a>\n                                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"mobile-menu-link\">\n                      More Astronomy Calculators\n                    </a>\n                                      <a href=\"/content/meteor-shower-calendar\" class=\"mobile-menu-link\">\n                      Meteor Showers\n                    </a>\n                                      <a href=\"/content/first-day-seasons\" class=\"mobile-menu-link\">\n                      Seasons\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Calendar\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/calendar\" class=\"mobile-menu-link\">\n                      2025 Calendar\n                    </a>\n                                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"mobile-menu-link\">\n                      Holidays and Events\n                    </a>\n                                      <a href=\"/topics/calendar/tools\" class=\"mobile-menu-link\">\n                      Calendar Calculators\n                    </a>\n                                      <a href=\"/bestdays/timetable\" class=\"mobile-menu-link\">\n                      Best Days Calendar\n                    </a>\n                                      <a href=\"/best-fishing-days\" class=\"mobile-menu-link\">\n                      Fishing Calendar\n                    </a>\n                                      <a href=\"/monthly-horoscope-october\" class=\"mobile-menu-link\">\n                      OCT Horoscope\n                    </a>\n                                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"mobile-menu-link\">\n                      Mercury Retrograde Dates\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Food\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/cooking\" class=\"mobile-menu-link\">\n                      Find A Recipe\n                    </a>\n                                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"mobile-menu-link\">\n                      When to Harvest\n                    </a>\n                                      <a href=\"/cooking/preserving-food\" class=\"mobile-menu-link\">\n                      Canning and Pickling\n                    </a>\n                                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"mobile-menu-link\">\n                      Grilling Recipes\n                    </a>\n                                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"mobile-menu-link\">\n                      Baking\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Store\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"https://store.almanac.com/garden/\" class=\"mobile-menu-link\">\n                      Shop Garden\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"mobile-menu-link\">\n                      Shop Weather\n                    </a>\n                                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"mobile-menu-link\">\n                      Shop Moon &amp; Sun\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"mobile-menu-link\">\n                      Shop Calendars\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"mobile-menu-link\">\n                      Shop Food\n                    </a>\n                                  </div>\n              </div>\n                      \n                    <div class=\"mobile-menu-search\">\n            <form class=\"search-form\" action=\"/search/site\" method=\"get\">\n              <input\n                name=\"search_api_fulltext\"\n                type=\"text\"\n                class=\"search-input\"\n                placeholder=\"Search...\"\n              />\n              <button type=\"submit\" class=\"search-button\">\n                <svg class=\"size-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                  <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n                </svg>\n              </button>\n            </form>\n          </div>\n        </nav>\n      </div>\n    </div>\n      </nav>\n</div>\n<!-- Nav spacer to prevent layout shift when sticky nav appears -->\n<div class=\"nav-spacer\" aria-hidden=\"true\" style=\"height:0;\"></div>\n\n  </div>\n\n</nav>\n\n\n  </header>\n\n<main id=\"content\" class=\"section--container\">\n    <div>\n    \n\n<div id=\"block-almanac-breadcrumbs\" class=\"block block-system block-system-breadcrumb-block block--system-breadcrumb-block flex flex-col w-full\">\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n          <nav role=\"navigation\" aria-labelledby=\"system-breadcrumb\">\n    <h2 id=\"system-breadcrumb\" class=\"visually-hidden\">Breadcrumb</h2>\n    <ol>\n          <li>\n                  <a href=\"/\">Home</a>\n              </li>\n          <li>\n                  <a href=\"/gardening\">Gardening</a>\n              </li>\n          <li>\n                  <a href=\"/gardening/growing-guides\">Growing Guides</a>\n              </li>\n        </ol>\n  </nav>\n\n      </div>\n      </div>\n\n  </div>\n\n  \n\n  <section class=\"layout layout--onecol\">\n    \n      <div>\n    \n\n<div id=\"block-almanac-page-title\" class=\"block block-core block-page-title-block block--page-title-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n<h1 class=\"page-title\">      <span class=\"field field--name-title field--type-string field--label-hidden\">How to Grow Onions: Plant, Grow &amp; Harvest Big Bulbs</span>\n  </h1>\n\n      </div>\n      </div>\n\n\n<div id=\"block-almanac-content\" class=\"block block-system block-system-main-block block--system-main-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n\n<article data-history-node-id=\"90272\" class=\"node node--type-plant node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: true\n    Is front: false\n    View mode: full\n    Node type: plant\n    Node ID: 90272\n    Current path: /plant/onions\n    -->\n\n                  \n                    \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n      <div class=\"layout layout--twocol-section layout--twocol-section--75-25 plant-info\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-imageprimary block--field-blocknodeplantfield-imageprimary flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-imageprimary field--type-entity-reference field--label-hidden field__item\">\n\n\n\n<article data-history-node-id=\"121302\" class=\"node node--type-image node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: full\n    Node type: image\n    Node ID: 121302\n    Current path: /plant/onions\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/or/public/image_nodes/shutterstock_2203736779.jpg?itok=NDoeIRX7\" width=\"1186\" height=\"667\" alt=\"Many ripe onion bulbs as background, closeup. yellow onions\" class=\"image-style-or\" />\n\n\n</div>\n          </div>\n  \n  <div class=\"field field--name-field-credit field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Photo Credit</div>\n              <div class=\"field__item\">New Africa/Shutterstock</div>\n          </div>\n\n  </div>\n\n  </article>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"botanical-name block block-layout-builder block-field-blocknodeplantfield-botanicalname block--field-blocknodeplantfield-botanicalname flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-botanicalname field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Botanical Name</div>\n              <div class=\"field__item\">Allium cepa</div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-plant-type-term block--field-blocknodeplantfield-plant-type-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-plant-type-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Plant Type</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/type/vegetables\" hreflang=\"en\">Vegetables</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-sun-exposure-term block--field-blocknodeplantfield-sun-exposure-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-sun-exposure-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Sun Exposure</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/sun/full-sun\" hreflang=\"en\">Full Sun</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-soil-ph-term block--field-blocknodeplantfield-soil-ph-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-soil-ph-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Soil pH</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/ph/neutral\" hreflang=\"en\">Neutral</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-subhead block--field-blocknodeplantfield-subhead flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-subhead field--type-string field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Subhead</div>\n              <div class=\"field__item\"><h2>Learn how to grow onions from seed or sets with our complete guide</h2>\n</div>\n          </div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33\">\n\n          <div  class=\"layout__region layout__region--first\">\n        <div class=\"author-line-block\">\n        <div class=\"author-line\">\n      <span class=\"author-label\">Written By:</span>\n      <span class=\"author-name\"><a href=\"/author/catherine-boeckmann\" hreflang=\"en\">Catherine Boeckmann</a></span>\n                                <span class=\"author-title\">Executive Digital Editor and Master Gardener</span>\n                  </div>\n  \n    </div>\n\n\n<div class=\"date_line block block-layout-builder block-field-blocknodeplantchanged block--field-blocknodeplantchanged flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-changed field--type-changed field--label-hidden field__item\"><time datetime=\"2025-06-26T11:36:58-04:00\" class=\"datetime\">June 26, 2025</time>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-almanac-share block-almanac-share-block block--almanac-share-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n<div class=\"mt-8 pt-6\">\n  \n    <div class=\"share-component\"\n       data-share-title=\"How to Grow Onions: Plant, Grow &amp; Harvest Big Bulbs\"\n       data-share-text=\"Check out this great content from The Old Farmer&#039;s Almanac!\"\n       data-share-url=\"https://www.almanac.com/plant/onions\"\n       data-share-hashtags=\"almanac\"\n       data-share-via=\"oldfarmersalmanac\"\n       data-print-service=\"printfriendly\">\n\n    <div class=\"share-component--buttons\">\n            <div class=\"share-toggle-container\">\n                <button type=\"button\" class=\"share-toggle\" aria-label=\"Share this content\">\n          <svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 24 24\" fill=\"currentColor\">\n            <path d=\"M18 16.08c-.76 0-1.44.3-1.96.77L8.91 12.7c.05-.23.09-.46.09-.7s-.04-.47-.09-.7l7.05-4.11c.54.5 1.25.81 2.04.81 1.66 0 3-1.34 3-3s-1.34-3-3-3-3 1.34-3 3c0 .24.04.47.09.7L8.04 9.81C7.5 9.31 6.79 9 6 9c-1.66 0-3 1.34-3 3s1.34 3 3 3c.79 0 1.5-.31 2.04-.81l7.12 4.16c-.05.21-.08.43-.08.65 0 1.61 1.31 2.92 2.92 2.92s2.92-1.31 2.92-2.92-1.31-2.92-2.92-2.92z\"/>\n          </svg>\n          <span>Share</span>\n        </button>\n\n                <div class=\"share-social-buttons\">\n                  </div>\n      </div>\n    </div>\n  </div>\n</div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 content-area\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"newsletter-incontent block block-listrak block-listraksubscribe-block block--listraksubscribe-block flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--listraksubscribe-block font-normal mt-0\">\n      Sign up for daily gardening advice and tips\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n<form class=\"listrak-form-subscribe\" data-drupal-selector=\"listrak-form-subscribe\" action=\"/plant/onions\" method=\"post\" id=\"listrak-form-subscribe\" accept-charset=\"UTF-8\">\n  <div class=\"js-form-item form-item js-form-type-email form-item-email js-form-item-email form-no-label\">\n      <label for=\"edit-email\" class=\"visually-hidden js-form-required form-required\">Email Address</label>\n          <input placeholder=\"Enter your email address\" data-drupal-selector=\"edit-email\" type=\"email\" id=\"edit-email\" name=\"email\" value=\"\" size=\"60\" maxlength=\"254\" class=\"form-email required\" required=\"required\" />\n\n        </div>\n  <input data-drupal-selector=\"edit-submit\" type=\"submit\" id=\"edit-submit\" name=\"op\" value=\"Sign Up\" class=\"button button--primary js-form-submit form-submit\" />\n  <input autocomplete=\"off\" data-drupal-selector=\"form-uq316xd2j-7pkavlnioaajjgv5ce8r5f-gzwbrfanog\" type=\"hidden\" name=\"form_build_id\" value=\"form-uq316XD2j-7pKAvlNIoaajJgV5Ce8r5F_gZWbRFaNOg\" />\n  <input data-drupal-selector=\"edit-listrak-form-subscribe\" type=\"hidden\" name=\"form_id\" value=\"listrak_form_subscribe\" />\n\n</form>\n\n\n\n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-2 block--views-blockpost-roll-promotion-block-2 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-body block--field-blocknodeplantfield-body flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-body field--type-text-long field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                  \n        <p>Want to know what really brings tears of joy? A bumper crop of homegrown onions! Whether you prefer sweet, sharp, red, or yellow, onions are one of the easiest (and most rewarding) veggies to grow. They don’t take up much space, they’re pest-resistant, and they store for months. From planting seeds or sets to harvesting big, beautiful bulbs, we’ve got the juicy details to help you master the art of onion growing. Let’s get growing—it’s about to get <em>aromatic</em> in&nbsp;here!</p><h2>Should I Grow Onions from Seeds or&nbsp;Sets?</h2><p>You can grow onions from seed or small bulbs called “sets.” If seeding, start indoors and then transplant&nbsp;outdoors.</p><p>We recommend onion sets for beginners. They are far easier to grow, give you a jump-start on the season, and have a higher success rate than direct-sown seeds or&nbsp;transplants.&nbsp;</p><ul><li><strong>Onion sets </strong>look like small bulbs sold at gardening stores; in just 14 weeks, they mature into full-size bulbs.&nbsp;Choose onion sets with bulbs that are 3/4 inch in diameter; larger ones tend to produce stiff necks and go to seed.<br>&nbsp;</li><li><strong>Onions grown from seed: </strong>are the most economical, though more work. If growing from seed, it&#8217;s recommended to start indoors, especially for cooler climates. Seeding outside results in slow and patchy germination. Another benefit of growing from seed is that you can choose more interesting and different varieties versus ordering onion&nbsp;sets.&nbsp;</li></ul><p><a class=\"text-button\" href=\"https://amzn.to/4jqpWl5\" target=\"_blank\" rel=\"nofollow\">Buy Seeds&nbsp;Now</a></p>\n      </div>\n      \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-2 block--views-blockmore-like-this-block-2 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-2 font-normal mt-0\">\n      Read Next\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-f73f3ad8af3b4b0f396937352cb6909ac1cf23412bda698ae45554999604d3eb\">\n  \n  \n  \n\n  \n  \n  \n\n  <div class=\"item-list\">\n  \n  <ul>\n\n          <li><div class=\"views-field views-field-title\"><a href=\"/best-vegetables-cool-weather\" hreflang=\"und\">Early Spring Vegetables to Plant</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/vegetable-gardening-for-beginners\" hreflang=\"und\">Vegetable Gardening for Beginners: The Complete Guide</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/choosing-plant-seeds\" hreflang=\"und\">10 Tips for Selecting Plant Seeds</a></div></li>\n    \n  </ul>\n\n</div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-planting block--field-blocknodeplantfield-planting flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-planting field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Planting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                  \n        <p>Onions need to grow in full sun and in a spot where they won’t be shaded by other vegetables. The more energy they can get from sunlight, the larger their bulbs can grow. Soil must be well-draining and loose—sandy-loam to silt-loam, not heavy clay or compact. Mix <a href=\"https://www.almanac.com/what-best-manure-compost-gardens\">aged manure</a> or compost into the soil in the fall or early spring to improve texture. Soil pH should be between 6.9 and 6.8. Have your soil tested. Onions don’t grow in high-acid&nbsp;soils.&nbsp;</p><h3>When to Plant&nbsp;Onions</h3><ul><li><strong>Plant onion sets (</strong>dormant bulbs) that can be planted directly into the ground in early spring, as soon as the ground can be worked and the danger of hard freezes has passed. This is typically around <strong>2 to 4 weeks</strong> before your last expected <a href=\"https://www.almanac.com/gardening/frostdates\">spring frost date</a>.<br>&nbsp;</li><li><strong>Start onion seeds indoors: 8 to 10 weeks</strong> before your area’s last spring frost date, which typically means planting them in late winter. Some gardeners will start even earlier to grow seeds to roughly the same bulb size. Check out our tips for <a href=\"https://www.almanac.com/growing-onions\">growing onions from seed</a>.<br>&nbsp;</li><li><strong>Transplant seedlings or plant starters </strong>outside in early spring when the soil is workable, about <strong>2 to 4 weeks</strong> before the last spring frost. Onions require soil at least 50°F to germinate, so they should be started indoors about 6 weeks before transplanting to the garden and no longer likely to dip below 28°F (-2°C). This means snow has melted, the days are warmer, and nights are still near freezing. For us in the northern zones, we’re talking April or early May.<br>&nbsp;</li><li><strong>A fall-planted crop of onions</strong> needs at least 4 to 6 weeks of warm temperatures to become established in the ground. They will remain dormant during the cool season; as the temperatures and soil warm again in early spring, the onions return to&nbsp;life.</li></ul><figure role=\"group\">\n<img alt=\"onions growing in the ground\" data-entity-type=\"file\" data-entity-uuid=\"47c959a8-2d93-4692-a7f3-e3d8584ca87f\" height=\"1328\" src=\"/sites/default/files/images/onions%20YuriyS%20GettyImages.jpg\" width=\"2000\" loading=\"lazy\">\n<figcaption><em>Photo credit: YuriyS/GettyImages</em></figcaption>\n</figure>\n<h3>How to Plant Onions&nbsp;Indoors</h3><p>Whether you’re planting seeds or sets, get a shallow tray and fill it with compost to the top. <a href=\"https://amzn.to/4aXauJD\" target=\"_blank\">Modular trays</a> with a small section for each bulb are&nbsp;ideal.&nbsp;</p><ol><li>Plant seeds 1/4 to 1/2 inch deep, or plant the onion bulbs so that the pointy end is just peeking over the top of the&nbsp;soil.</li><li>Lightly water the tray and let it drain&nbsp;through.</li><li>Set onions in a warm place, such as a well-lit&nbsp;windowsill.</li><li>Thin to 3 to 4&nbsp;inches.&nbsp;</li></ol><h3>How to Plant Onions&nbsp;Outdoors</h3><p>Onion plants are heavy feeders and require constant nourishment to produce big bulbs.&nbsp;At planting time, add nitrogen <a href=\"https://www.almanac.com/how-fertilize-your-vegetable-garden\">fertilizer</a>. Many organic gardeners will add an inch of compost to the bottom of each row before planting.&nbsp;Or,&nbsp;dig a trench in the soil about 2 inches deep and 3 inches wide, and then fill the trench back in with about an inch of&nbsp;compost.</p><ul><li><strong>If planting onion sets </strong>outdoors, bury them 2 to 6 inches apart, gently pressing them 1 to 2 inches&nbsp;deep into loose soil. (Use the closer spacing if you want to pull immature onions as scallions.) Don’t bury them more than 2&nbsp;inches under the soil. Onions mustn’t be planted too deep, as this can affect bulb development.<br>&nbsp;</li><li><strong>If you are direct seeding </strong>outdoors, sow seeds 1/4 to 1/2 inch deep once the soil is workable.<br>&nbsp;</li><li>Once onions begin to grow, thin them to 3 to 4 inches apart. Plants thinned from the row to create room can be used as green onions. Space the seedlings in rows 12 to 18 inches apart.<br>&nbsp;</li><li>If you are transplanting from indoors, don’t forget to<strong> </strong><a href=\"https://www.almanac.com/how-harden-seedlings\">harden off</a> the young plants for at least a week.<br>&nbsp;</li><li>Mulch with straw between rows to help retain moisture and stifle&nbsp;weeds.</li></ul><p><img src=\"/sites/default/files/users/Almanac%20Staff/growveg_onions.jpeg\" alt=\"Spacing for Onions\" width=\"720\" height=\"238\" loading=\"lazy\"></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-care block--field-blocknodeplantfield-care flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-care field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Growing</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                  \n        <p>We find it helpful to think of onions as a leaf crop (like lettuce or kale) rather than a root crop (like beets or carrots). Fostering healthy foliage growth ensures the plants have enough energy to form large&nbsp;bulbs.</p><ul><li>Ensure immature bulbs stay covered with light <a href=\"https://www.almanac.com/types-mulch-advantages-and-disadvantages-mulching\">mulch</a> to protect them, retain moisture, suppress weeds, and allow air&nbsp;circulation.</li><li>Do not cover emerging&nbsp;onions.</li><li>Fertilize every few weeks with nitrogen to get big bulbs. Stop fertilizing when the onions push the soil away, and the bulbing process has started. Do not put the soil back around the onions; the bulb needs to emerge above the&nbsp;soil.</li><li>Generally, onion plants&nbsp;do not need consistent watering if light mulch is used.&nbsp;About 1 inch of water per square foot per week, including rainwater, is sufficient. If you want sweeter onions, water more. To deter bolting, <a href=\"https://www.almanac.com/watering-wisely-drought-or-hot-weather\">water them often during hot spells</a>.</li><li>To deter thrips, intercrop onions with tomatoes or carrots in closely alternating&nbsp;rows.</li></ul><p><strong>See our video demo to see how to plant and grow perfect&nbsp;onions!&nbsp;</strong></p><div class=\"youtube-container\"><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"405\" src=\"https://www.youtube.com/embed/Xr_QTp2J9Ek\" title=\"YouTube video player\" width=\"720\"></iframe></div><div class=\"youtube-container\">&nbsp;</div><h3>Growing Onions in&nbsp;Containers</h3><p>You can also grow onions in containers! Prepare a container that is at least 10 inches deep and as wide as possible (to allow for space between maturing onions). A 5-gallon bucket will support 4 to 6 onions, and a tub many more. Place the container where it will receive the maximum hours of direct sunlight per day. (It will be heavy to move once filled and&nbsp;planted.)&nbsp;</p><p>Provide a well-draining potting mix that is rich in organic matter; add compost or well-rotted manure. Mix in a complete fertilizer, per the package guidance on container size, or fertilize with <a href=\"https://extension.illinois.edu/news-releases/scale-your-gardens-health-fish-emulsion-fertilizer\" target=\"_blank\">diluted fish emulsion</a> or <a href=\"https://www.almanac.com/how-make-compost-tea\">compost&nbsp;tea.</a></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"plain-text block block-layout-builder block-field-blocknodeplantfield__recommended block--field-blocknodeplantfield__recommended flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field__recommended field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Types</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            \n        <p><span style=\"-webkit-text-stroke-width:0px;background-color:rgb(255, 255, 255);color:rgb(57, 67, 81);display:inline !important;float:none;font-family:&quot;DM Sans&quot;, sans-serif;font-size:17.6px;font-style:normal;font-variant-caps:normal;font-variant-ligatures:normal;font-weight:400;letter-spacing:normal;orphans:2;text-align:start;text-decoration-color:initial;text-decoration-style:initial;text-decoration-thickness:initial;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;\">Onion varieties are categorized based on whether they’re “long-day,” “short-day,” or “day-neutral” varieties. This is because they are </span><a href=\"https://lancaster.unl.edu/onions\" target=\"_blank\">“photoperiodic,</a>” meaning that they grow in response to day length—the number of daylight hours needed to trigger bulb&nbsp;formation.&nbsp;</p><p><strong>Short-day onions</strong> grow best in the southern United States, between 25° and 35° north latitude. Start bulbs when day length reaches 10 to 12 hours. The earlier short-day onions are planted, the larger they get. In the South, onions can be planted in the fall and overwintered. Since they continue to grow throughout the winter, they will be ready for harvest in the spring.&nbsp;&nbsp;</p><p><strong>Intermediate, or day-neutral, onions</strong> are best suited to the middle tier of <span class=\"caps\">U.S.</span> states, approximately between the 32° and 42° latitudes. Start bulbs when day length reaches 12 to 14&nbsp;hours.&nbsp;</p><p><strong>Long-day onions</strong> grow best in the northern states, between latitudes 37° and 47°. Start bulbs when day length reaches 14 to 16&nbsp;hours.&nbsp;</p><p>Do not try to fool Mother Nature: Short-day onions planted in a long-day zone will result in small bulbs—not an early&nbsp;harvest.&nbsp;</p><p><em><strong>Long-day&nbsp;varieties:</strong></em></p><ul><li><strong>‘Yellow Sweet Spanish&#8217;</strong>: large, round&nbsp;shape;&nbsp;yellow-white.</li><li><strong>‘First Edition&#8217;</strong>: high-yielding, stores well, flavorful,&nbsp;creamy-yellow</li><li><strong>‘Red Wethersfield&#8217;</strong>: flat bulbs that store well, white flesh,&nbsp;red-skinned</li><li><strong>‘Aisa Craig&#8217;</strong>, <strong>‘Walla Walla&#8217;</strong>: huge&nbsp;bulbs</li><li><strong>‘Buffalo&#8217;</strong>, <strong>‘Norstar&#8217;</strong>: produce early but keep only until late&nbsp;December</li><li><strong>‘Copra&#8217;</strong>, <strong>‘Southport Red Globe&#8217;</strong>, <strong>‘Sweet Sandwich&#8217;</strong>, <strong>‘Yellow Globe&#8217;</strong>: keep&nbsp;well</li><li><strong>‘Red Florence&#8217;</strong>: heirloom; 4- to 6-inch-long, dark purple-red, torpedo shape; mild,&nbsp;sweet</li><li><strong>‘Ailsa Craig’:</strong> heirloom; named for a Scottish island; large, up to 8 inches in diameter; average 2 pounds; pale yellow skin, globe shape; mild,&nbsp;sweet</li><li><strong>‘Gold Coin’:</strong> cipollini; 1-1/2- to 3-inch yellow flattened bulb; pungent flavor sweetens when&nbsp;cooked</li></ul><p><em><strong>Short-day&nbsp;varieties:</strong></em></p><ul><li><strong>‘Stuttgarter’</strong>: sold in sets, early maturity with a slightly flat shape,&nbsp;yellow</li><li><strong>‘White Bermuda&#8217;</strong>: extremely mild, with thick, flat bulbs;&nbsp;white</li><li><strong>‘Red Burgundy&#8217;</strong>: good table onion with mild, sweet white inside; short-term&nbsp;keeper</li><li><strong>‘Crystal Wax White Bermuda&#8217;</strong>: a great onion for pickling when harvested at pearl&nbsp;size</li><li><strong>‘Hybrid Yellow Granex&#8217;</strong>: sweet, Vidalia&nbsp;type</li><li><strong>‘Red Creole’:</strong> heirloom; 3- to 4-inch, dark red globe shape;&nbsp;pungent</li><li><strong>‘Southern Belle&#8217;</strong>: ruby color&nbsp;throughout</li><li><strong>‘Texas 1015-Y Supersweet&#8217;</strong>: stores&nbsp;well</li><li>‘<strong>Yellow Granex’:</strong> Vidalia type; 3- to 4-inch, yellow, flattened globe shape; crisp; said to be the sweetest of the super&nbsp;sweet</li></ul><p><em><strong>Day-neutral or intermediate&nbsp;&nbsp;varieties:</strong></em></p><ul><li><strong>‘Candy&#8217;</strong>: golden,&nbsp;thick-flesh,&nbsp;jumbo bulbs; stores&nbsp;well</li><li><strong>‘Red Stockton&#8217;</strong>: large, red-ringed, white-flesh&nbsp;bulbs</li><li><strong>‘Super Star&#8217;</strong>: large, sweet, white&nbsp;bulbs</li><li><strong>‘Purplette’:</strong> mini onion, at 1-1/2 inches; glossy, burgundy red when raw; pastel pink when cooked or pickled; mild,&nbsp;sweet</li><li><strong>‘Southport Yellow Globe’:</strong> early; 2-1/2- to 3-1/2-inch thick-skin yellow globe; mild,&nbsp;sweet</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-harvest block--field-blocknodeplantfield-harvest flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-harvest field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Harvesting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <p>Pull any onions that send up flower stalks. This means that the bulbs have stopped growing. These onions will not store well, but can be used in recipes within a&nbsp;few&nbsp;days.</p><ul><li>Spring-planted onions tend to be<a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\"> ready for harvesting</a> by&nbsp;mid-summer.</li><li>When onions start to mature, the tops (foliage) become yellow and begin to fall over. At that point, bend the tops down or even stomp on the foliage to speed up the final ripening&nbsp;process.</li><li>Loosen the soil around the bulbs to encourage&nbsp;drying.</li><li>Harvest by late summer in dry weather. (Wet-harvested onions do not cure well and might rot in&nbsp;storage.)</li><li>When the tops are brown, pull the onions. Handle them carefully, as the slightest bruise (now and in storage) will&nbsp;encourage&nbsp;rot.</li><li>Cut the roots and trim the tops back to 1 or 2 inches (but leave the tops on if you are planning to braid the onions&nbsp;together).</li></ul><p class=\"text-align-center\"><em>Onion’s skin very thin,</em><br><em>Mild winter coming in;</em><br><em>Onion’s skin thick and tough,</em><br><em>Coming winter cold and&nbsp;rough.</em></p><figure role=\"group\">\n<img alt=\"Harvested onions still covered in dirt in the garden . Photo by Rootstocks/Getty Images\" height=\"481\" src=\"/sites/default/files/users/The%20Editors/onion_harvest_rootstocks_gi_crop_full_width.jpg\" width=\"720\" loading=\"lazy\">\n<figcaption><em>Photo by Rootstocks/Getty Images</em></figcaption>\n</figure>\n<h3>How to Store&nbsp;Onions</h3><ul><li>Set onions on dry ground for a few days to cure, weather permitting, or in a protected place such as a garage or&nbsp;barn.</li><li>Once cured, hang onions in a mesh bag or nylon stocking; spread up to two layers deep in a box; or braid and hang them in a cool, dry, well-ventilated area. The ideal temperature range for storage is 40 to 60°F (4 to 15°C). Do not store in a refrigerator, as conditions will be too&nbsp;damp.</li><li>Check periodically for sprouting or rotting onions and remove&nbsp;them.</li><li>Don’t store onions with apples&nbsp;or pears, as the ethylene gas produced by the fruits will interrupt the onions’ dormancy. Onions may also spoil the flavor of these&nbsp;fruits (as well&nbsp;as&nbsp;potatoes).</li><li>A pungent onion will store longer than a sweet onion. Sweet onions have a high water content and do not keep well. Eat the sweet varieties first and save the more pungent onions for&nbsp;later.</li><li>To avoid bruising, store them so that they do not touch each other—for example, in clean old pantyhose. Slip in the onions one at a time, tying a knot between each one. Hang them in a cool, dry&nbsp;place.</li><li>You can also braid your onions for extended storage. <a href=\"https://www.almanac.com/how-braid-onions\">Learn to braid&nbsp;onions!</a></li></ul><p><strong>Check out this video to learn how to harvest and store&nbsp;onions.</strong></p><div class=\"youtube-container\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen frameborder=\"0\" height=\"405\" src=\"https://www.youtube.com/embed/py2kPbSsgmA\" width=\"720\"></iframe></div></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n<div class=\"recommender-title block block-block-content block-block-contente8acfdbd-8aa8-4a11-9e44-f56cad64ee7a gardening-recommendations print-no\">\n  \n      <h2 class=\"block__title category-heading\">Gardening Products</h2>\n    \n\n  <div class=\"block__content\">\n    <div class=\"gardening-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"49397b29-784d-45ad-ba5f-2ca9659c9feb\">\n    <script type=\"text/html\">\n       var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\" style=\"width: 32%\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div></p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-pests block--field-blocknodeplantfield-pests flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-pests field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Pests/Diseases</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <ul><li><a href=\"https://www.almanac.com/pest/thrips\"><strong>Thrips</strong></a>: To control thrips—tiny insects about as fat as a sewing needle—take a dark piece of paper into the garden and knock the onion tops against it; if thrips are present, you will spot their tan-colored bodies on the paper. A couple of treatments with insecticidal soap kills them. Follow the package directions. Spray the plants twice, 3 days apart, and the thrips should disappear. To prevent future infestations, consider using <a href=\"https://www.almanac.com/reasons-use-row-covers\">row covers</a>.</li><li><strong>Onion Maggots</strong>: Cover your emerging onion crop with fine mesh netting or row covers. Seal it by mounding the soil around the edges. The onion maggot fly likes to lay its eggs at the base of plants, so the netting should prevent that. You should also keep mulch away because the insects like decaying organic matter, and make sure you completely harvest your onions as the season progresses. Onion maggots are usually a problem in very rainy periods, so these precautions may be unnecessary if you have a dry&nbsp;season.</li><li><strong>White Rot:&nbsp;</strong>This very serious disease starts with infected plant material. Avoid transplants grown in soil-based compost. Stick to starting from&nbsp;onion seeds, onion sets, and bulbs bought from inspected producers. With white rot, the foliage will yellow and wilt; below ground, white, fluffy fungal growth appears on the base of the bulb. Unfortunately, once rot sets in, there is no solution.&nbsp;Dig up the crop and dispose of it in the trash (do not compost).&nbsp;Avoid growing onions in the same&nbsp;location in future&nbsp;seasons, as the dirt will remain infected for many&nbsp;years.</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-wit-and-wisdom block--field-blocknodeplantfield-wit-and-wisdom flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-wit-and-wisdom field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Wit and Wisdom</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <p>In terms of location, practice crop rotation with onions. Don&#8217;t plant them in the same location year after year, as this can encourage the spread of diseases that affect the crop. <a href=\"https://www.almanac.com/video/how-rotate-your-vegetable-crops\">Learn more about crop rotation</a>.</p><h3>Can You Plant a Sprouted&nbsp;Onion?&nbsp;</h3><p>Yes, you can plant a sprouted onion, though you won&#8217;t get more onions from it. You will get lots of tasty green sprouts, however! Here&#8217;s how to do&nbsp;it:</p><ol><li>Fill a pot with potting soil and make a hole in the middle about the onion&#8217;s depth and&nbsp;width.</li><li>Place the onion in the hole and cover with&nbsp;soil.</li><li>Water and put the pot in a sunny&nbsp;spot.</li><li>Harvest the green sprouts as needed for&nbsp;cooking.</li></ol><p>If you get a sprout with a flower, wait until the flower goes to seed. Save the seeds for planting in the&nbsp;spring.</p><h3>Fun Onion Facts and&nbsp;Folklore</h3><ul><li>Onions were worshiped in ancient Egypt, where their concentric circles were seen as symbols of eternal&nbsp;life.</li><li>In the Middle Ages, onion juice was believed to cure baldness, snakebite, and&nbsp;headaches.</li><li>A generation or two ago, children were treated with a poultice of mashed onions applied as a paste to cover a&nbsp;wound.</li><li>A whole onion eaten at bedtime was prescribed to break a cold by morning, and sliced onions were placed on the soles of the feet to draw out&nbsp;fever.</li><li>Early settlers made cough syrup by steeping raw onion slices in honey&nbsp;overnight.</li><li>A raw onion rubbed on a bee sting or insect bite will relieve the pain and&nbsp;itching.</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-recipes block--field-blocknodeplantfield-recipes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-recipes field--type-entity-reference field--label-above\">\n    <div class=\"field__label\">Recipes</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/recipe/vermont-farm-sandwich\" hreflang=\"und\">Vermont Farm Sandwich</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/egg-cheese-and-caramelized-onion-tortillas\" hreflang=\"und\">Egg, Cheese, and Caramelized Onion Tortillas</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/grilled-french-onion\" hreflang=\"und\">Grilled French Onion</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/fresh-onion-dip\" hreflang=\"und\">Fresh Onion Dip</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/potato-pizza-sweet-onions-and-rosemary\" hreflang=\"und\">Potato Pizza With Sweet Onions and Rosemary</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/slow-cooker-french-onion-soup\" hreflang=\"und\">Slow Cooker French Onion Soup</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-cooking-notes block--field-blocknodeplantfield-cooking-notes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-cooking-notes field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Cooking Notes</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                      \n        <p>To make onions taste milder, soak them in milk or pour boiling water over the slices and let them stand for 20 minutes. Rinse with cold&nbsp;water.</p><p>Chopping onions can sometimes look daunting: There&#8217;s the skin and the layers&#8230; Where to begin? Check out our tips for <a href=\"https://www.almanac.com/content/how-chop-onion-four-easy-steps\">chopping onions in four easy steps</a>. Onion skins actually have several health benefits, too, so don&#8217;t throw them&nbsp;out!</p><p><a href=\"https://www.almanac.com/blog/everything-almanac-blog/cooking-fresh-know-your-onions\">Check out more tips on using onions in the kitchen and cooking them&nbsp;correctly.</a></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-topics block--field-blocknodeplantfield-topics flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n      <div class=\"field field--name-field-topics field--type-entity-reference field--label-hidden field__items\">\n              <div class=\"field__item\"><a href=\"/topics/gardening/edible-gardening/vegetables\" hreflang=\"en\">Vegetables</a></div>\n          </div>\n  \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block--author-bio block-views block-views-blockauthor-bio-block-1 block--views-blockauthor-bio-block-1 flex flex-col\">\n  \n      <div class=\"block__title block-title block-title--views-blockauthor-bio-block-1 w-full\">\n      About The Author\n    </div>\n    \n\n            <div class=\"block__content author-bio-content\">\n                <div class=\"author-bio-main\">\n                                                              \n                                            <div class=\"author-picture-wrapper\">\n                  <img src=\"/sites/default/files/pictures/2024-10/IMG_0365.jpeg\" alt=\"Catherine Boeckmann\" class=\"author-picture\">\n                </div>\n              \n                            <div class=\"author-info-section\">\n                                \n                    <h2 class=\"author-name\">Catherine Boeckmann</h2>\n\n                \n                                                  <h3 class=\"author-job-title\">Executive Digital Editor and Master Gardener</h3>\n                \n                                                                                                            <div class=\"author-bio\">Catherine Boeckmann is the Executive Digital Editor of Almanac.com, the website companion of The Old Farmer&#039;s Almanac. She covers gardening, plants, pest control, soil composition, seasonal and moon c...</div>\n                                  \n                                                  <div class=\"author-link-wrapper\">\n                    <a href=\"/author/catherine-boeckmann\" class=\"author-link\">\n                      Read More from Catherine Boeckmann\n                    </a>\n                  </div>\n                \n                                \n                                              </div>\n                              </div>\n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-guides block-guides-toc-block block--guides-toc-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-1 block--views-blockmore-like-this-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-1 font-normal mt-0\">\n      More Like This\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-a968a26c845c438cb72d7f416826973225e5da00ff20fc291bd5fbf03458485a\">\n  \n  \n  \n\n  \n  \n  \n\n  \n\n\n<!-- Check if there are multiple rows -->\n  <!-- Multiple rows - wrap each in grid tile -->\n  <div class=\"grid gap-6 auto-rows-auto grid-cols-1 md:grid-cols-3 mb-2\">\n                                        <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/best-vegetables-cool-weather\">\n\n\n\n<article data-history-node-id=\"123546\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 123546\n    Current path: /plant/onions\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/spinach_by_deyan_georgiev_ss.jpg?itok=xIhxN95r\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/best-vegetables-cool-weather\" hreflang=\"und\">Early Spring Vegetables to Plant</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/vegetable-gardening-for-beginners\">\n\n\n\n<article data-history-node-id=\"128732\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 128732\n    Current path: /plant/onions\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/girl-tomatoes-shutterstock_440076301_0.jpg?itok=jnGtC43p\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/vegetable-gardening-for-beginners\" hreflang=\"und\">Vegetable Gardening for Beginners: The Complete Guide</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/choosing-plant-seeds\">\n\n\n\n<article data-history-node-id=\"310897\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 310897\n    Current path: /plant/onions\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/seeds-soil-Tatevosian-Yana-SS.jpeg?itok=gGvYw6QE\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/choosing-plant-seeds\" hreflang=\"und\">10 Tips for Selecting Plant Seeds</a></h3></div>\n            </div>\n                                                                <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/cucumbers\">\n\n\n\n<article data-history-node-id=\"121301\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 121301\n    Current path: /plant/onions\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/growing%20cucumbers.jpg?itok=fdpqqlFB\" width=\"650\" height=\"366\" alt=\"cucumbers growing on the vine\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/cucumbers\" hreflang=\"und\">How to Grow Cucumber Plants: Easy Guide to Planting &amp; Harvesting</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/content/starting-seeds-indoors\">\n\n\n\n<article data-history-node-id=\"324301\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 324301\n    Current path: /plant/onions\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/starting-seeds-featured-2400px2.jpeg?itok=2tsyOooV\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/content/starting-seeds-indoors\" hreflang=\"und\">Starting Seeds Indoors: How and When to Start Seeds </a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/ordering-garden-seeds\">\n\n\n\n<article data-history-node-id=\"128038\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 128038\n    Current path: /plant/onions\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/seeds-1302793_1920.jpg?itok=HwXMxTNE\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/ordering-garden-seeds\" hreflang=\"und\">Ordering Garden Seeds (and Getting a Jump on Spring!)</a></h3></div>\n            </div>\n                              </div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-1 block--views-blockpost-roll-promotion-block-1 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 more-like-this print-no\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"views-element-container block block-views block-views-blockcomment-form-block-1 block--views-blockcomment-form-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockcomment-form-block-1 font-normal mt-0\">\n      Comments\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-538a51c3d02e904fc623bc384e25d057b239369ea71b9befb25e48fdfbe48853\">\n  \n  \n  \n\n  \n  \n  \n\n      <div class=\"views-row\"><div class=\"views-field views-field-nid\"><span class=\"field-content\"><a href=\"/comment/reply/node/90272/comment_node_plant\">Add a Comment</a></span></div></div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n\n<div class=\"views-element-container comment-ajax-wrapper\">\n  \n    \n      <div><div class=\"js-view-dom-id-c5a2a1de2c57d3000689c7421946b4fa566b6a01d34cf89ad61ec61f9f77b1a5\">\n  \n  \n  \n\n  \n  \n  \n\n  <div data-drupal-views-infinite-scroll-content-wrapper class=\"views-infinite-scroll-content-wrapper clearfix\">    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"138594\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Cathy&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sun, 08/24/2025 - 18:58</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"138594\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      A lot of my onions have thin necks at the top of the bulb, and the stalks have fallen over, but the big green stalks are still full....should I leave them in the ground until the stalks start drying?  \r\nThank you!\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-138594\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"137919\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Alex&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 06/12/2025 - 10:21</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"137919\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Can you provide guidance on allium leafminers?  I can tell from earlier in the season that my onions are under attack.  Is there anyway to save the onions when time comes for harvest?  Can they still be cured, or do they have to be frozen?  Any guidance you can give would be helpful.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-137919\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"135345\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Cathy&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 08/15/2024 - 11:29</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"135345\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      This has not been as wet a summer as last, but my onions make me think it is too wet.   Many of them have the tops flopping over, and it is only August, but the stems not drying or thinning, and some have mushy layers in the bulb or the stem.  A few have had the entire bulb turn to mush.  I am picking some but was hoping some could dry out more still in the soil.   Should I just harvest them and dry them out before storing them in my cool dark basement?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-135345\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"135392\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Mon, 08/19/2024 - 10:08</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"135392\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Hi Cathy,</p><p>Sorry to hear about the issues with your onions. First off, you should pull and discard any of the onions that are showing signs of rot or mushy layers. Make sure to throw them away and never put them in your compost. There are a few reasons why some of your onions could be turning to mush. One could be too much water this late in the growing season. If you did not amend your soil prior to planting, your soil may be too compact and leading to drainage issues as the growing season went along.</p><p>There are also a number of diseases that can affect onions during the growing season. If you planted onions in the same location last year, disease may have been able to overwinter in that area and is now affecting this year's crop. It would be best to practice crop rotation next year and plant your onions in a different garden bed.</p><p>If your soil is in good growing condition and not oversaturated disease should be suspected. If your onions seem mature at this point (or close to it) it would be best to harvest them a little early to avoid any possible diseases from spreading to onions that are salvageable. Follow the instructions above for harvesting and drying before storage.</p><p>Hope this helps!</p>\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-135392\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"134242\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Sandy&lt;/span&gt;</span>\n        <span class=\"comment-time\">Tue, 05/21/2024 - 14:57</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"134242\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Last year we used onion sets, cannot remember the name of them. But the box suggested you cut off the green tops after they reached a certain length. After i got the hang of it, it was awesome. I died them and used them for months. It appears that is not something you recommend? Do you know which onions you are able to trim the tops?\r\nThank you very much for all of your help\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-134242\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"138131\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Irene Runolfson&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 07/03/2025 - 12:29</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"138131\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Can you trim Spanish Onions during the growing season?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-138131\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"130127\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Kimberly&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 06/22/2023 - 01:37</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"130127\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      In your article about growing onions you mention planting sprouted onions only for their greens but I have had lots of success growing multiple onions from one sprouted onion. You just have to carefully peel away the layers and separate each little sprout (I usually get 3-5 per onion) then plant them. Tip: I like to let the individual sprouts sit in a shallow dish of water for a day or two to boost the root growth before I sow them. I have about a dozen onions in my garden currently that came from only 3 onions. I hope this helps your readers to take advantage of a veggie that might otherwise end up in the trash! \n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-130127\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"130128\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Thu, 06/22/2023 - 08:36</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"130128\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Great tip! Thanks for sharing your personal recommendations, Kimberly!</p>\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-130128\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"129135\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;John Holderfield&lt;/span&gt;</span>\n        <span class=\"comment-time\">Wed, 04/19/2023 - 22:47</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"129135\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Can you cut the green stems above ground and allow the bulb to continue to grow?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-129135\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"129364\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Mon, 05/08/2023 - 11:51</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"129364\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90272\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>The bulb gets its food from the leaves, so one needs to wait until the leaves brown (and are no longer providing food) before harvesting the bulb, or the bulb won't reach its full size.&nbsp;</p><p>If a flowering stalk appears, however, you can cut off that green stem. Unfortunately though, if an onion bolts (forms flowers) the first year, it will no longer focus on bulb growth, even if one removes the flowering stem. It is best to immediately harvest an onion that has bolted, as the longer it sits in the soil, the more chance its flavor and texture may change and rot may occur. However, you can leave the bulb in the soil for a few days, if needed, before harvesting.</p><p>Hope this helps!</p>\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-129364\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n</div>\n\n    \n<div class=\"comment-pager-wrapper\">\n  <ul class=\"comment-pagination js-pager__items\" data-drupal-views-infinite-scroll-pager>\n        \n              <li class=\"pager__item\">\n        <span class=\"pager-previous disabled button\">« Previous</span>\n      </li>\n    \n        \n              <li class=\"pager__item\">\n                  <span class=\"current-page button\">1</span>\n              </li>\n          <li class=\"pager__item\">\n                  <a href=\"?page=1\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to page 2\">2</a>\n              </li>\n    \n              <li class=\"pager__item\">\n        <span class=\"pager-ellipsis button\">…</span>\n      </li>\n      <li class=\"pager__item\">\n        <a href=\"?page=9\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to last page\">10</a>\n      </li>\n    \n        <li class=\"pager__item\">\n      <a href=\"?page=1\" class=\"use-ajax button js-pager__item pager-next\" data-drupal-views-infinite-scroll-pager-link title=\"Go to next page\" rel=\"next\">Next »</a>\n    </li>\n  </ul>\n</div>\n\n\n  \n  \n\n  \n  \n</div>\n</div>\n\n  </div>\n\n      </div>\n    \n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"store-logo block block-block-content block-block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 block--block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div style=\"align-items:center;background-color:#005336;display:flex;flex-wrap:wrap;gap:20px;justify-content:space-evenly;margin-bottom:20px;margin-top:40px;padding:10px;width:100%;\"><div style=\"color:#fff;\">📣<strong>The Gardening Club Just Got Better!</strong> 3 Deliveries, 10% Store Discount, and more!</div><div><a class=\"text-button\" href=\"https://store.almanac.com/pages/most-popular-club\" target=\"blank\">Learn More</a></div></div><a href=\"https://store.almanac.com/\" target=\"_blank\"><img src=\"https://www.almanac.com/sites/default/files/promotion/old-farmers-almanac-store-logo-1200px.jpg\" data-entity-uuid=\"c84260b7-88a4-4419-a3ff-3e408f8c6c79\" data-entity-type=\"file\" alt=\"The Old Farmer's Almanac Store\" width=\"600\" height=\"77\" align=\"center\" class=\"align-center\" loading=\"lazy\"></a></p>\n      </div>\n      \n      </div>\n      </div>\n<div class=\"content-recommender print-no block block-block-content block-block-contentfdd6ba48-ec8e-4e76-8008-f0a9ba0e596b listrak-recommendations\">\n  \n    \n\n  <div class=\"block__content\">\n    <div class=\"listrak-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"f5f04466-f923-491d-9354-679d54e32def\">\n    <script type=\"text/html\">\n        var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div>           \n</p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n    </div>\n  </div>\n\n  </div>\n\n  </article>\n\n      </div>\n      </div>\n\n  </div>\n\n    \n  </section>\n\n  </main>\n\n<footer id=\"page-footer\">\n    <div class=\"w-full bg-sand newsletter-signup-footer\">\n    <div class=\"max-w-[85rem] mx-auto md:px-20\">\n\n      <div class=\"flex-nowrap w-full md:w-auto pt-8 text-center md:text-left\">\n        <h4 class=\"text-xl md:text-2xl font-normal font-sans leading-tight text-black mb-2\">Get Almanac's Daily Updates</h4>\n      </div>\n\n      <div class=\"flex flex-col md:flex-row items-center justify-between gap-6 pb-8\">\n                <div class=\"text-center md:text-left flex-1\">\n          <p class=\"text-base md:text-lg text-black\">\n            <span class=\"uppercase font-bold\">BONUS</span>: You'll also receive our free <em>Beginner Gardening Guide!</em>\n          </p>\n        </div>\n\n                <div class=\"flex-grow w-full md:w-auto\">\n          <form class=\"flex flex-col sm:flex-row gap-3 md:gap-4 w-full md:w-auto sm:px-4 p-0\" action=\"/\" method=\"post\">\n            <input\n              type=\"email\"\n              name=\"email\"\n              placeholder=\"Enter your email address\"\n              class=\"flex-1 px-3 py-2 md:px-4 md:py-3 text-gray-900 bg-white focus:outline-none focus:ring-2 focus:ring-brick-red placeholder-gray-500\"\n              required\n            >\n            <button\n              type=\"submit\"\n              class=\"px-4 py-2 md:px-6 md:py-3 bg-brick-red text-white font-bold hover:bg-dark-red focus:outline-none focus:ring-2 focus:ring-brick-red transition-colors whitespace-nowrap\"\n            >\n              Go\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n  </div>\n\n    <div class=\"layout layout--page max-w-[85rem] mx-auto\">\n    <div class=\"container mx-auto pb-12\">\n      \n<div class=\"region region--footer-top footer-top-region\">\n  <div class=\"section--container\">\n    <div class=\"grid grid-cols-1 md:grid-cols-3 gap-8\">\n      <nav  id=\"block-almanac-general\" class=\"block block-menu navigation menu--general\" aria-labelledby=\"block-almanac-general-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-general-menu\">Our Brands</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"https://store.almanac.com/\">The Old Farmer’s Almanac Store</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://newengland.com/\">Yankee Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.familytreemagazine.com/\">Family Tree Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhbr.com/\">NH Business Review</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhmagazine.com/\">New Hampshire Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://yankeecustommarketing.com/\">Yankee Custom Marketing</a>\n              </li>\n      </ul>\n\n  </nav>\n<nav  id=\"block-almanac-resources\" class=\"block block-menu navigation menu--resources\" aria-labelledby=\"block-almanac-resources-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-resources-menu\">Resources</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"/about-us\">About Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/contact\">Contact Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/signup\">Free Daily Newsletter</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/webcam\">Webcam</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediakit\">Advertise with Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediaroom\">Media Relations</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/retail\">Sell the Almanac</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/wheretobuy\">Where to Buy</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/terms-of-use/\">Terms of Use</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/privacy-policy\">Privacy Policy</a>\n              </li>\n      </ul>\n\n  </nav>\n<div class=\"social-menu flex\">\n  \n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n\n    </div>\n  </div>\n</div>\n\n\n      <div class=\"social-menu grid grid-cols-5 gap-8\">\n        \n      </div>\n\n      <div class=\"text-sm text-gray-600 flex justify-between mt-24 mb-12\">\n        <div>\n            © 2025 <a href=\"https://ypi.com/\" target=\"_blank\" class=\"inline\">Yankee Publishing Inc.</a>, An Employee-Owned Company.\n        </div>\n        <div>\n          1121 Main Street | P.O. Box 520 | Dublin, NH 03444\n        </div>\n      </div>\n    </div>\n  </div>\n</footer>\n\n  </div>\n\n\n  <div class=\"region region--page-bottom\">\n    \n  </div>\n\n  \n  <script type=\"application/json\" data-drupal-selector=\"drupal-settings-json\">{\"path\":{\"baseUrl\":\"\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/90272\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"eJxNj1uOwzAIRTdklyVZxCERKjYWxq28-0mbpJof4D4-DigFK2bYRReU2H0K1z3gZQtOHR6XwbKSxT5aU_Nf3IwL2ozH3ClmrW4qIQthdZQnYFuyxzYW4RyylkLVYbXRUB6XjMuML6Y32V1Im1qBWzTcuaKz1rDi7GlUZ4EPJ_WwsTgZZGzfwkmbLlrwt2aV1Cn_T1fuWV9kE7TSkQfh7oZPuHbw2XQ33ib8rvAh7PCdj6LrEDqtxHXjyk6p5-N1OSvxduPp_gHbNY0b\",\"theme\":\"almanac\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:c5a2a1de2c57d3000689c7421946b4fa566b6a01d34cf89ad61ec61f9f77b1a5\":{\"view_name\":\"comments_with_ajax_\",\"view_display_id\":\"block_1\",\"view_args\":\"90272\",\"view_path\":\"\\/node\\/90272\",\"view_base_path\":null,\"view_dom_id\":\"c5a2a1de2c57d3000689c7421946b4fa566b6a01d34cf89ad61ec61f9f77b1a5\",\"pager_element\":0}}},\"almanac\":{\"adExclusions\":{\"fullExclude\":[\"\\/retail\",\"\\/mediakit\",\"\\/club\",\"\\/winter\",\"\\/mediaroom\",\"\\/kids\",\"\\/old-farmers-almanac-promotional-images\"],\"videoOnly\":[\"\\/how-to-kill-poison-ivy\",\"\\/wheretobuy\",\"\\/feminized-seeds\",\"\\/autoflower-seeds\",\"\\/how-to-germinate-cannabis-seeds\"]}},\"user\":{\"uid\":0,\"permissionsHash\":\"a870a3cd03311fe2742a98671d86d33235d0ba55333d275d5575e9fd83f56f7e\"}}</script>\n<script src=\"/core/misc/drupalSettingsLoader.js?v=11.2.4\"></script>\n<script src=\"/themes/almanac/dist/js/scripts.js?t4yh8p\"></script>\n<script src=\"/modules/contrib/views_infinite_scroll/js/infinite-scroll.js?v=11.2.4\"></script>\n\n</body>\n</html>\n",
  "scrapedAt" : "2025-10-30T21:58:09.012543Z",
  "successful" : true,
  "errorMessage" : null
}