{
  "slug" : "plums",
  "source" : "Almanac.com",
  "url" : "https://www.almanac.com/plant/plums",
  "commonName" : "How to Grow Plums: Planting, Care, and Harvesting Tips for Juicy Fruit",
  "description" : null,
  "companionSection" : null,
  "plantingGuide" : "### Planting\nWhen to Plant Plum Trees Plant plum trees in early spring, as soon as the frost in the ground has thawed. If the soil is very waterlogged, it is best to wait until it drains. Selecting a Planting Site Plums should really only be planted in a prime location featuring all of the following characteristics. Otherwise, they may not perform well. Plant plum trees in loamy, well-draining soil. Plums do not do well when planted in clay-heavy soils or in locations where their roots will be constantly wet. Choose a planting location that receives full sun—6 to 8 hours of direct sunlight at the very least. Avoid planting in low areas where frost may settle, as the frost can damage your trees. Because they flower so early, plums are especially vulnerable to spring frosts, which can damage blooms and result in sub-par fruiting. Find a sheltered location, such as a south- or west-facing spot out of the wind if possible. This will help the plum tree set fruit. How to Plant a Plum Tree Space standard-size trees 20 to 25 feet apart and dwarf trees 10 to 15 feet apart. Set bare-root trees atop a small mound of soil in the center of the planting hole, and spread the roots down and away without unduly bending them. To prepare a container-grown tree for planting, remove the tree from its pot and get rid of any tightly circling roots by laying the root ball on its side and using shears to trim off these roots. Do your best to untangle roots without damaging roots, but if the root ball is particularly pot-bound, you can loosen it by scraping up and down the sides with a knife or hand fork. When planting grafted trees, it’s important to keep the graft union 1 to 2 inches above the soil line. This is especially true for dwarf varieties, as roots may start to grow from above the graft if the tree is planted too deep, bypassing the rootstock that keeps the tree dwarf-size. Dig a hole that’s a few inches deeper and wider than the spread of the roots. For bare-root trees, set the tree on top of a small mound of soil in the middle of the hole and spread the roots away from the trunk without excessively bending them. For container-grown trees, simply place the root ball in the middle of the hole. Fill in the hole, stopping periodically to make sure that the roots are thoroughly covered and no air pockets remain around the tree. Water the tree thoroughly at the time of planting; this helps the soil to settle around the roots. Keep the tree well watered for the first few weeks after planting. For bare-root trees, it’s often recommended to stake the tree for at least one year, until the tree is stable enough to stand on its own. See our lovely video showing how to plant a plum tree and find detailed information below.\n\n### When to Plant Plum Trees\nPlant plum trees in early spring, as soon as the frost in the ground has thawed. If the soil is very waterlogged, it is best to wait until it drains.\n\n### Selecting a Planting Site\nPlums should really only be planted in a prime location featuring all of the following characteristics. Otherwise, they may not perform well.\n- Plant plum trees in loamy, well-draining soil. Plums do not do well when planted in clay-heavy soils or in locations where their roots will be constantly wet.\n- Choose a planting location that receives full sun—6 to 8 hours of direct sunlight at the very least.\n- Avoid planting in low areas where frost may settle, as the frost can damage your trees. Because they flower so early, plums are especially vulnerable to spring frosts, which can damage blooms and result in sub-par fruiting.\n- Find a sheltered location, such as a south- or west-facing spot out of the wind if possible. This will help the plum tree set fruit.\n\n### How to Plant a Plum Tree\n- Space standard-size trees 20 to 25 feet apart and dwarf trees 10 to 15 feet apart.\n- Set bare-root trees atop a small mound of soil in the center of the planting hole, and spread the roots down and away without unduly bending them.\n- To prepare a container-grown tree for planting, remove the tree from its pot and get rid of any tightly circling roots by laying the root ball on its side and using shears to trim off these roots. Do your best to untangle roots without damaging roots, but if the root ball is particularly pot-bound, you can loosen it by scraping up and down the sides with a knife or hand fork.\n- When planting grafted trees, it’s important to keep the graft union 1 to 2 inches above the soil line. This is especially true for dwarf varieties, as roots may start to grow from above the graft if the tree is planted too deep, bypassing the rootstock that keeps the tree dwarf-size.\n- Dig a hole that’s a few inches deeper and wider than the spread of the roots. For bare-root trees, set the tree on top of a small mound of soil in the middle of the hole and spread the roots away from the trunk without excessively bending them. For container-grown trees, simply place the root ball in the middle of the hole. Fill in the hole, stopping periodically to make sure that the roots are thoroughly covered and no air pockets remain around the tree.\n- For bare-root trees, set the tree on top of a small mound of soil in the middle of the hole and spread the roots away from the trunk without excessively bending them.\n- For container-grown trees, simply place the root ball in the middle of the hole.\n- Fill in the hole, stopping periodically to make sure that the roots are thoroughly covered and no air pockets remain around the tree.\n- Water the tree thoroughly at the time of planting; this helps the soil to settle around the roots. Keep the tree well watered for the first few weeks after planting.\n- For bare-root trees, it’s often recommended to stake the tree for at least one year, until the tree is stable enough to stand on its own.\nSee our lovely video showing how to plant a plum tree and find detailed information below.\n\n### How to Grow Raspberries: A Juicy Guide to Planting, Harvesting & Pruning\n",
  "careInstructions" : "### Learn how to choose, plant, and care for plum trees with this complete growing guide\n\n\n### Growing\nHow to Care for Plum Trees Watering Be sure to water the young trees heavily every week during the first growing season to help promote growth. Then, water regularly. It’s best to water the plant deeply at the soil line, then let the soil dry out (though not completely) and water again. If rain is lacking, water your tree well into mid-October to give it plenty of moisture through the winter months. Fertilizing Do not fertilize young fruit trees until they have set a crop. Once established, fruit production requires regular fertilizing all year long. If there’s good fruit set, fertilize with one pound of calcium nitrate per tree or 1½ lb. 10-10-10. Cut back the nitrogen in fall and winter to avoid encouraging new growth in those seasons. General Care Are you having pest issues? Talk to your local cooperative extension for natural solutions that work in your area. To help control pests and diseases, remember to prune your trees to keep them open. You can also mulch around the trees in the spring to help control weeds, but be sure to remove the mulch in the late fall so that no pests use it over the winter. You can also lightly cultivate the soil around your trees in late spring to eliminate any pests in the soil. In the fall, rake away all debris and fallen trees. To prevent winter injury: Consider a tree wrap or guard around the lower trunk, especially for a young plum tree. Keep an eye on the lower bark and branches for mouse or rabbit damage; if this could be a problem, you may need to install tree guards or fence in young trees with chicken wire for the winter. How to Prune Plum Trees When to Prune Prune in early spring or mid-summer to avoid infection. The best time for pruning is usually spring for young trees and mid-summer for established ones. Do NOT prune in the fall. Winter injury and infection may occur. Thinning Fruit “Thinning” is the process of removing developing fruit from a tree in order to increase the overall quality of the produced fruit and to prevent damage to the tree. Thinning is usually done about a month after blooming ends in the spring. Leave 2-4 inches between each fruit, removing those in between. Thinning helps to prevent branches from breaking under the weight of the fruit. If branches do break, prune them back to undamaged wood, ideally cutting back to a natural fork to avoid leaving stubs. Pruning: Japanese Plum Trees If you have a Japanese variety, the best pruning method is to create an “open center” shape, where the central trunk is cut short and several large branches radiate outwards from it’s tip. In the summer of the first year, cut the vigorous shoots that form on the top of the tree by two or three buds. After about a month, check the tree. As soon as you have three wide-angled branches, spaced equally apart, cut back any other branches so that these three are the main branches. In the early summer of the second year, cut back the branches in the middle of the tree to short stubs and prune any shoots developing below the three main branches. After the third year, remove any shoots in the center of the tree to keep its shape. Japanese types require heavy pruning to help keep them in shape and to produce better fruit. It is also good to thin out the fruit on these types of trees. You should space the plums about 3 to 4 inches apart on each branch. Pruning: European Plum Trees If you have a European variety, the best pruning method is to create a central leader. This shape features a central trunk with branches that spiral out every 5 to 8 inches, making sure that no branch is directly above another. The training for such a system begins in the early summer of the first year, during which time you should remove any shoots that form within 18 inches of the ground. The end result should resemble a Christmas tree. European types do not typically require fruit thinning because they do not produce as much fruit as Japanese types. However, the fruit on these types should be spaced about 2 inches apart on each branch. For more pruning tips, check our spring pruning guide.\n\n### How to Care for Plum Trees\nWatering\n- Be sure to water the young trees heavily every week during the first growing season to help promote growth. Then, water regularly. It’s best to water the plant deeply at the soil line, then let the soil dry out (though not completely) and water again.\n- If rain is lacking, water your tree well into mid-October to give it plenty of moisture through the winter months.\nFertilizing\n- Do not fertilize young fruit trees until they have set a crop.\n- Once established, fruit production requires regular fertilizing all year long. If there’s good fruit set, fertilize with one pound of calcium nitrate per tree or 1½ lb. 10-10-10. Cut back the nitrogen in fall and winter to avoid encouraging new growth in those seasons.\nGeneral Care\n- Are you having pest issues? Talk to your local cooperative extension for natural solutions that work in your area.\n- To help control pests and diseases, remember to prune your trees to keep them open. You can also mulch around the trees in the spring to help control weeds, but be sure to remove the mulch in the late fall so that no pests use it over the winter. You can also lightly cultivate the soil around your trees in late spring to eliminate any pests in the soil.\n- In the fall, rake away all debris and fallen trees.\n- To prevent winter injury: Consider a tree wrap or guard around the lower trunk, especially for a young plum tree.\n- Keep an eye on the lower bark and branches for mouse or rabbit damage; if this could be a problem, you may need to install tree guards or fence in young trees with chicken wire for the winter.\n\n### Growing Asian Pears—Juicy-Sweet, Yet Crisp!\n",
  "harvestInfo" : "### Harvesting\nWhen to Harvest Plums Plums are ready to be harvested from late summer into fall, depending on your area. European plums have the best flavor when left to ripen on the tree. You can tell when plums are ripe by applying gentle pressure with your fingers. If the skin of the fruit feels soft, then it is ready to be picked. Plums should come off the tree easily with just a slight twist of the fruit. Japanese plums are picked slightly earlier; allow them to ripen in a cool place. Plums will not sweeten much after harvest, so be sure to pick them when they’re mature. (Try one before you pick them all!) How to Store Plums Unfortunately, the fruit does not store for long, so must be eaten or preserved. Alternatively, you can pick the fruits when they are still slightly firm and store them in a cool place to fully ripen. The best place to store plums is in the refrigerator. The best temperature for storing plums is about 31° to 32°F with relative humidity around 90–95%; if kept at this temperature, plums may last for 2 to 4 weeks.\n\n### When to Harvest Plums\n- Plums are ready to be harvested from late summer into fall, depending on your area.\n- European plums have the best flavor when left to ripen on the tree. You can tell when plums are ripe by applying gentle pressure with your fingers. If the skin of the fruit feels soft, then it is ready to be picked. Plums should come off the tree easily with just a slight twist of the fruit.\n- Japanese plums are picked slightly earlier; allow them to ripen in a cool place.\n- Plums will not sweeten much after harvest, so be sure to pick them when they’re mature. (Try one before you pick them all!)\n\n### How to Grow Raspberries: A Juicy Guide to Planting, Harvesting & Pruning\n",
  "pestsAndDiseases" : "### Pests/Diseases\nSilver leaf disease Honey fungus Bacterial canker Pocket plum Japanese beetles Plum aphids Plum moth Contact your local cooperative extension to implement a spraying program that can help manage these pests and diseases.",
  "rawHtml" : "<!DOCTYPE html>\n<html lang=\"en\" dir=\"ltr\" prefix=\"og: https://ogp.me/ns#\" class=\"h-full bg-background\">\n  <head>\n    <meta charset=\"UTF-8\" />\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n    <meta name=\"p:domain_verify\" content=\"f46e5dfff350743298ae1e5af21e8dd1\"/>\n    <meta name=\"msvalidate.01\" content=\"3B427AB94F44374B431B678687BA15C2\" />\n\n    <meta name=\"apple-mobile-web-app-title\" content=\"Almanac\" />\n    <meta name=\"theme-color\" content=\"#455775\" />\n    <meta name=\"msapplication-navbutton-color\" content=\"#455775\" />\n    <meta name=\"apple-mobile-web-app-status-bar-style\" content=\"#455775\" />\n\n    <title>Plums: Planting, Growing, and Harvesting Plum Trees</title>\n    <meta charset=\"utf-8\" />\n<meta name=\"description\" content=\"Grow your own juicy plums! Discover how to plant, care for, and harvest plum trees, plus tips on varieties, pollination, and enjoying fresh fruit.\" />\n<link rel=\"canonical\" href=\"https://www.almanac.com/plant/plums\" />\n<meta name=\"robots\" content=\"index, follow\" />\n<link rel=\"icon\" href=\"/themes/almanaco/images/favicon.ico\" />\n<link rel=\"mask-icon\" href=\"/themes/almanaco/images/safari-pinned-tab.svg\" />\n<link rel=\"icon\" sizes=\"16x16\" href=\"/themes/almanaco/images/favicon-16x16.png\" />\n<link rel=\"icon\" sizes=\"32x32\" href=\"/themes/almanaco/images/favicon-32x32.png\" />\n<link rel=\"icon\" sizes=\"192x192\" href=\"/themes/almanaco/images/android-chrome-192x192.png\" />\n<link rel=\"apple-touch-icon\" href=\"/themes/almanaco/images/apple-touch-icon-60x60.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"76x76\" href=\"/themes/almanaco/images/apple-touch-icon-76x76.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"120x120\" href=\"/themes/almanaco/images/apple-touch-icon-120x120.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"152x152\" href=\"/themes/almanaco/images/apple-touch-icon-152x152.png\" />\n<meta property=\"og:site_name\" content=\"Almanac.com\" />\n<meta property=\"og:type\" content=\"article\" />\n<meta property=\"og:url\" content=\"https://www.almanac.com/plant/plums\" />\n<meta property=\"og:title\" content=\"How to Grow Plums: Planting, Care, and Harvesting Tips for Juicy Fruit\" />\n<meta property=\"og:description\" content=\"Grow your own juicy plums! Discover how to plant, care for, and harvest plum trees, plus tips on varieties, pollination, and enjoying fresh fruit.\" />\n<meta property=\"og:image\" content=\"https://www.almanac.com/sites/default/files/styles/large/public/image_nodes/plums-branch.jpg?itok=5QTWTTQs\" />\n<meta property=\"og:image:type\" content=\"image/jpeg\" />\n<meta property=\"og:image:width\" content=\"1205\" />\n<meta property=\"og:image:height\" content=\"800\" />\n<meta property=\"og:image:alt\" content=\"The Old Farmer&#039;s Almanac\" />\n<meta property=\"fb:admins\" content=\"100002198720176,500927460,687947151,1068201072\" />\n<meta property=\"fb:app_id\" content=\"180003315384377\" />\n<meta name=\"twitter:card\" content=\"summary_large_image\" />\n<meta name=\"twitter:title\" content=\"How to Grow Plums: Planting, Care, and Harvesting Tips for Juicy Fruit\" />\n<meta name=\"twitter:site\" content=\"@almanac\" />\n<meta name=\"Generator\" content=\"Drupal 11 (https://www.drupal.org)\" />\n<meta name=\"MobileOptimized\" content=\"width\" />\n<meta name=\"HandheldFriendly\" content=\"true\" />\n<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n<script>var ct_check_js_val = '8898c94f21d3ba0d17f2a06ffca1aa79';var drupal_ac_antibot_cookie_value = 'ca23a11e05e559b3cac9756b0aad182179cd21c898c5ed451f98170264753af2';var ct_use_cookies = 1;var ct_use_alt_cookies = 0;var ct_capture_buffer = 0;</script>\n<script type=\"application/ld+json\">{\n    \"@context\": \"https://schema.org\",\n    \"@graph\": [\n        {\n            \"@type\": \"Article\",\n            \"@id\": \"https://www.almanac.com/plant/plums\",\n            \"name\": \"How to Grow Plums: Planting, Care, and Harvesting Tips for Juicy Fruit\",\n            \"headline\": \"How to Grow Plums: Planting, Care, and Harvesting Tips for Juicy Fruit\",\n            \"description\": \"Grow your own juicy plums! Discover how to plant, care for, and harvest plum trees, plus tips on varieties, pollination, and enjoying fresh fruit.\",\n            \"datePublished\": \"2025-08-13T01:00:00-0400\",\n            \"dateModified\": \"2025-08-13T16:44:12-0400\",\n            \"isAccessibleForFree\": \"True\",\n            \"author\": {\n                \"@type\": \"Person\",\n                \"@id\": \"https://www.almanac.com/user/170691\",\n                \"name\": \"Catherine Boeckmann\",\n                \"url\": \"https://www.almanac.com/user/170691\"\n            },\n            \"publisher\": {\n                \"@type\": \"NewsMediaOrganization\",\n                \"@id\": \"https://www.almanac.com\",\n                \"name\": \"The Old Farmer\\u0027s Almanac\",\n                \"url\": \"https://www.almanac.com\",\n                \"logo\": {\n                    \"@type\": \"ImageObject\",\n                    \"representativeOfPage\": \"True\",\n                    \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\",\n                    \"width\": \"308\",\n                    \"height\": \"108\"\n                }\n            }\n        },\n        {\n            \"@type\": \"NewsMediaOrganization\",\n            \"additionalType\": \"Organization\",\n            \"@id\": \"https://www.almanac.com/\",\n            \"description\": \"The Old Farmer’s Almanac is your trusted source for long range weather forecasts, moon phases, full moon dates and times, gardening tips, sunrise and sunset times, Best Days, tide charts, home remedies, folklore, and more.\",\n            \"sameAs\": \"https://en.wikipedia.org/wiki/Old_Farmer%27s_Almanac\",\n            \"name\": \"The Old Farmer\\u0027s Almanac\",\n            \"url\": \"https://www.almanac.com/\",\n            \"telephone\": \"1-800-ALMANAC\",\n            \"contactPoint\": {\n                \"@type\": \"ContactPoint\",\n                \"telephone\": \"+1-800-256-2622\",\n                \"email\": \"support@almanac.com\",\n                \"url\": \"https://www.almanac.com/\",\n                \"contactType\": \"customer service\",\n                \"contactOption\": \"TollFree\",\n                \"productSupported\": \"The Old Farmer\\u0027s Almanac\"\n            },\n            \"logo\": {\n                \"@type\": \"ImageObject\",\n                \"representativeOfPage\": \"True\",\n                \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\"\n            }\n        }\n    ]\n}</script>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n    \n\n        \n\n    <link rel=\"preconnect\" href=\"https://fonts.googleapis.com\" crossorigin />\n  <link rel=\"preconnect\" href=\"https://fonts.gstatic.com\" crossorigin />\n  <link rel=\"preload\" as=\"style\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n\n    <link rel=\"modulepreload\" href=\"/themes/almanac/dist/js/scripts.js\">\n\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" media=\"print\" onload=\"this.media='all'\" />\n\n    <noscript>\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n  </noscript>\n\n        <style>\n      body {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n        margin: 0;\n        background-color: #ffffff;\n      }\n      h1, h2, h3, h4, h5 {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n      }\n      a {\n        color: #595974;\n        text-decoration: none;\n      }\n      a:hover {\n        color: #ad2a24;\n      }\n    </style>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n  <script>window.freestar = { config: { enabled_slots: [] } };</script>\n\n    \n\n                                                                                                                  \n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  window.raptivetarget = {\n    tags: [],\n    category: \"\",\n    postType: \"plant\",\n    postId: 90165,\n    special: true\n  };\n\n  if (window.console && window.console.log) {\n    console.log('Raptive targeting configured:', window.raptivetarget);\n  }\n</script>\n\n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  (function(w, d) {\n    // Debug: Log that we're initializing AdThrive in head\n    if (w.console && w.console.log) {\n      w.console.log('Raptive: Initializing AdThrive script in head for path:', w.location.pathname);\n    }\n\n    w.adthrive = w.adthrive || {};\n    w.adthrive.cmd = w.adthrive.cmd || [];\n    w.adthrive.plugin = 'adthrive-ads-manual';\n    w.adthrive.host = 'ads.adthrive.com';\n\n    var s = d.createElement('script');\n    s.async = true;\n    s.setAttribute('referrerpolicy', 'no-referrer-when-downgrade');\n    s.src = 'https://' + w.adthrive.host + '/sites/6810e43f9a254b456fd9027c/ads.min.js?referrer=' + w.encodeURIComponent(w.location.href) + '&cb=' + (Math.floor(Math.random() * 100) + 1);\n\n    // Debug: Log script loading\n    s.onload = function() {\n      if (w.console && w.console.log) {\n        w.console.log('Raptive: AdThrive script loaded successfully');\n      }\n    };\n    s.onerror = function() {\n      if (w.console && w.console.error) {\n        w.console.error('Raptive: Failed to load AdThrive script');\n      }\n    };\n\n    var n = d.getElementsByTagName('script')[0];\n    n.parentNode.insertBefore(s, n);\n  })(window, document);\n</script>\n\n  \n</head>\n<body class=\"page-not-front page-type-content content-type-plant\">\n  <div class=\"region region--page-top\">\n    \n  </div>\n\n    <div class=\"dialog-off-canvas-main-canvas\" data-off-canvas-main-canvas>\n    <header id=\"page--header\" class=\"section--fullwidth\">\n  \n  <div id=\"region--store_banner\">\n  \n\n<div id=\"block-almanac-storesalebanner\" class=\"block block-block-content block-block-content9bb2b53c-bf24-46a9-96e3-8b872395f31e block--block-content9bb2b53c-bf24-46a9-96e3-8b872395f31e flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div class=\"text-align-center\" style=\"background-color:#ad2a24;padding-bottom:5px;padding-top:5px;width:100%;\"><div style=\"display:flex;justify-content:center;\"><a style=\"color:#fff;font-size:18px;\" href=\"https://store.almanac.com/pages/black-friday-cyber-monday?utm_campaign=OFA-Store-BlackFriday&amp;utm_content=top-banner\" target=\"_blank\">Shop Our Black Friday Sale at The Almanac Store →</a></div></div></p>\n      </div>\n      \n      </div>\n      </div>\n\n</div>\n\n\n    <section class=\"region--global-header flex flex-col sm:flex-row justify-between border-t-brick-red border-t-4 mb-8 text-sm px-4 shadow-sm\">\n  <div class=\"social-menu flex justify-center sm:justify-start\">\n\n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n<div class=\"global-menu flex justify-center sm:justify-end\">\n<a\n  href=\"/signup\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Get Almanac&#039;s Daily Updates\n</a>\n<a\n  href=\"/weather/longrange\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Extended Forecasts\n</a>\n<a\n  href=\"/wheretobuy\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Where to Buy\n</a>\n<a\n  href=\"/contact\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Contact Us\n</a>\n\n</div>\n\n</section>\n\n\n    \n\n<nav aria-label=\"Global\" class=\"nav section--container mb-4\">\n  \n    <div class=\"nav--logo\">\n    <a href=\"/\">\n      <span class=\"sr-only\">Almanac</span>\n      <img src=\"/themes/almanac/logo.svg\" alt=\"Almanac Logo\" width=\"309\" height=\"74\" class=\"no-bg\">\n    </a>\n    <a class=\"calendar no-underline\" href=\"/calendar/today\">\n      Tuesday, November 4, 2025\n    </a>\n  </div>\n\n    <div class=\"nav--menu\">\n    <div class=\"flex flex-wrap md:justify-start md:flex-nowrap z-50 w-full transition-all duration-300\" data-nav-container>\n  <nav class=\"flex relative max-w-[85rem] w-full mx-auto md:flex md:items-center md:justify-between md:gap-3 py-2 px-4 sm:px-6 lg:px-8 transition-all duration-300\" data-nav>\n\n        <div class=\"nav-logo transition-all duration-300 flex flex-shrink-0\" data-nav-logo>\n      <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n        <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n      </a>\n    </div>\n\n        <div class=\"nav-breadcrumb transition-all duration-300 flex-1 flex justify-center min-w-0 invisible lg:visible\" data-nav-breadcrumb>\n      <nav class=\"breadcrumb\" role=\"navigation\" aria-label=\"Breadcrumb\">\n        <ol class=\"flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse min-w-28\">\n                                                                               <li class=\"inline-flex items-center\">\n                                      <a href=\"/gardening\" class=\"no-underline uppercase font-sans text-xs text-gray-600 hover:text-brick-red\">Gardening</a>\n                                  </li>\n                                                         <li class=\"inline-flex items-center\">\n                                      <span class=\"uppercase font-sans text-xs text-gray-800\">Growing Guides</span>\n                                  </li>\n                                            </ol>\n      </nav>\n    </div>\n\n        <div class=\"flex items-center gap-x-1 flex-shrink-0\">\n            <button type=\"button\" class=\"menu-toggle md:hidden relative size-9 flex justify-center items-center font-medium text-[12px] border border-gray-200 text-gray-800 hover:bg-gray-100 focus:outline-none focus:bg-gray-100 disabled:opacity-50 disabled:pointer-events-none transition-all duration-300\" data-nav-toggle>\n        <svg class=\"menu-open-icon size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <line x1=\"3\" x2=\"21\" y1=\"6\" y2=\"6\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"12\" y2=\"12\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"18\" y2=\"18\"/>\n        </svg>\n        <svg class=\"menu-close-icon hidden size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <path d=\"M18 6 6 18\"/>\n          <path d=\"m6 6 12 12\"/>\n        </svg>\n        <span class=\"sr-only\">Toggle navigation</span>\n      </button>\n      \n            <div class=\"hidden md:flex items-center gap-x-1\">\n                                          <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Gardening\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/gardening\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        All Gardening \n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/planting-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Planting Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/frostdates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Frost Dates\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/growing-guides\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Growing Guides\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/pests-and-diseases\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Pests and Problems\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Calculators and Tools\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://gardenplanner.almanac.com/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Planner\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Weather\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Weather Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/fall-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Forecast 2025\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Thanksgiving Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Winter Forecast 2025-2026\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/longrange\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        60-Day Long-Range Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        5-Day Forecast\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Moon &amp; Sun\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/astronomy\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Astronomy Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/full-moon-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Harvest Moon!\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moon Phase Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/full\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Next Full Moon\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/sun-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Sunrise and Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moonrise &amp; Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        More Astronomy Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/meteor-shower-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Meteor Showers\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/first-day-seasons\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Seasons\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Calendar\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        2025 Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Holidays and Events\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/calendar/tools\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Calendar Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/bestdays/timetable\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Best Days Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/best-fishing-days\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fishing Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/monthly-horoscope-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Horoscope\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Mercury Retrograde Dates\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Food\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/cooking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Find A Recipe\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        When to Harvest\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/cooking/preserving-food\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Canning and Pickling\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Grilling Recipes\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Baking\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Store\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"https://store.almanac.com/garden/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Garden\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Weather\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Moon &amp; Sun\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Calendars\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Food\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                              \n                <div class=\"menu-item relative mt-1\" data-nav-search>\n          <form class=\"menu-item-form\" action=\"/search/site\" method=\"get\">\n            <input\n              name=\"search_api_fulltext\"\n              type=\"text\"\n              class=\"h-10 px-5 pr-10 w-12 md:w-12 transition-all duration-300\"\n              placeholder=\"Search...\"\n            />\n            <button type=\"submit\" class=\"absolute right-0 top-0 fill-black transition-all duration-300\">\n              <svg class=\"h-5 w-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n              </svg>\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n\n        <div id=\"menu-mobile\" class=\"mobile-menu\" data-nav-menu>\n      <div class=\"mobile-menu-content\">\n        <div class=\"mobile-menu-header\">\n          <div class=\"mobile-menu-logo\">\n            <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n              <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n            </a>\n          </div>\n          <button type=\"button\" class=\"mobile-menu-close\" aria-label=\"Close menu\">\n            <svg class=\"size-6\" xmlns=\"http://www.w3.org/2000/svg\" fill=\"none\" viewBox=\"0 0 24 24\" stroke=\"currentColor\">\n              <path stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" d=\"M6 18L18 6M6 6l12 12\" />\n            </svg>\n          </button>\n        </div>\n\n        <nav class=\"mobile-menu-nav\">\n                                                  <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Gardening\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/gardening\" class=\"mobile-menu-link\">\n                      All Gardening \n                    </a>\n                                      <a href=\"/gardening/planting-calendar\" class=\"mobile-menu-link\">\n                      Planting Calendar\n                    </a>\n                                      <a href=\"/gardening/frostdates\" class=\"mobile-menu-link\">\n                      Fall Frost Dates\n                    </a>\n                                      <a href=\"/gardening/growing-guides\" class=\"mobile-menu-link\">\n                      Growing Guides\n                    </a>\n                                      <a href=\"/gardening/pests-and-diseases\" class=\"mobile-menu-link\">\n                      Pests and Problems\n                    </a>\n                                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"mobile-menu-link\">\n                      Garden Calculators and Tools\n                    </a>\n                                      <a href=\"https://gardenplanner.almanac.com/\" class=\"mobile-menu-link\">\n                      Garden Planner\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Weather\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/weather\" class=\"mobile-menu-link\">\n                      Weather Overview\n                    </a>\n                                      <a href=\"/fall-weather-forecast\" class=\"mobile-menu-link\">\n                      Fall Forecast 2025\n                    </a>\n                                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"mobile-menu-link\">\n                      Thanksgiving Forecast\n                    </a>\n                                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"mobile-menu-link\">\n                      Winter Forecast 2025-2026\n                    </a>\n                                      <a href=\"/weather/longrange\" class=\"mobile-menu-link\">\n                      60-Day Long-Range Forecast\n                    </a>\n                                      <a href=\"/weather/forecast\" class=\"mobile-menu-link\">\n                      5-Day Forecast\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Moon &amp; Sun\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/astronomy\" class=\"mobile-menu-link\">\n                      Astronomy Overview\n                    </a>\n                                      <a href=\"/content/full-moon-october\" class=\"mobile-menu-link\">\n                      OCT Harvest Moon!\n                    </a>\n                                      <a href=\"/astronomy/moon/calendar\" class=\"mobile-menu-link\">\n                      Moon Phase Calendar\n                    </a>\n                                      <a href=\"/astronomy/moon/full\" class=\"mobile-menu-link\">\n                      Next Full Moon\n                    </a>\n                                      <a href=\"/astronomy/sun-rise-and-set\" class=\"mobile-menu-link\">\n                      Sunrise and Set Times\n                    </a>\n                                      <a href=\"/astronomy/moon-rise-and-set\" class=\"mobile-menu-link\">\n                      Moonrise &amp; Set Times\n                    </a>\n                                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"mobile-menu-link\">\n                      More Astronomy Calculators\n                    </a>\n                                      <a href=\"/content/meteor-shower-calendar\" class=\"mobile-menu-link\">\n                      Meteor Showers\n                    </a>\n                                      <a href=\"/content/first-day-seasons\" class=\"mobile-menu-link\">\n                      Seasons\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Calendar\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/calendar\" class=\"mobile-menu-link\">\n                      2025 Calendar\n                    </a>\n                                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"mobile-menu-link\">\n                      Holidays and Events\n                    </a>\n                                      <a href=\"/topics/calendar/tools\" class=\"mobile-menu-link\">\n                      Calendar Calculators\n                    </a>\n                                      <a href=\"/bestdays/timetable\" class=\"mobile-menu-link\">\n                      Best Days Calendar\n                    </a>\n                                      <a href=\"/best-fishing-days\" class=\"mobile-menu-link\">\n                      Fishing Calendar\n                    </a>\n                                      <a href=\"/monthly-horoscope-october\" class=\"mobile-menu-link\">\n                      OCT Horoscope\n                    </a>\n                                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"mobile-menu-link\">\n                      Mercury Retrograde Dates\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Food\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/cooking\" class=\"mobile-menu-link\">\n                      Find A Recipe\n                    </a>\n                                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"mobile-menu-link\">\n                      When to Harvest\n                    </a>\n                                      <a href=\"/cooking/preserving-food\" class=\"mobile-menu-link\">\n                      Canning and Pickling\n                    </a>\n                                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"mobile-menu-link\">\n                      Grilling Recipes\n                    </a>\n                                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"mobile-menu-link\">\n                      Baking\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Store\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"https://store.almanac.com/garden/\" class=\"mobile-menu-link\">\n                      Shop Garden\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"mobile-menu-link\">\n                      Shop Weather\n                    </a>\n                                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"mobile-menu-link\">\n                      Shop Moon &amp; Sun\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"mobile-menu-link\">\n                      Shop Calendars\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"mobile-menu-link\">\n                      Shop Food\n                    </a>\n                                  </div>\n              </div>\n                      \n                    <div class=\"mobile-menu-search\">\n            <form class=\"search-form\" action=\"/search/site\" method=\"get\">\n              <input\n                name=\"search_api_fulltext\"\n                type=\"text\"\n                class=\"search-input\"\n                placeholder=\"Search...\"\n              />\n              <button type=\"submit\" class=\"search-button\">\n                <svg class=\"size-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                  <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n                </svg>\n              </button>\n            </form>\n          </div>\n        </nav>\n      </div>\n    </div>\n      </nav>\n</div>\n<!-- Nav spacer to prevent layout shift when sticky nav appears -->\n<div class=\"nav-spacer\" aria-hidden=\"true\" style=\"height:0;\"></div>\n\n  </div>\n\n</nav>\n\n\n  </header>\n\n<main id=\"content\" class=\"section--container\">\n    <div>\n    \n\n<div id=\"block-almanac-breadcrumbs\" class=\"block block-system block-system-breadcrumb-block block--system-breadcrumb-block flex flex-col w-full\">\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n          <nav role=\"navigation\" aria-labelledby=\"system-breadcrumb\">\n    <h2 id=\"system-breadcrumb\" class=\"visually-hidden\">Breadcrumb</h2>\n    <ol>\n          <li>\n                  <a href=\"/\">Home</a>\n              </li>\n          <li>\n                  <a href=\"/gardening\">Gardening</a>\n              </li>\n          <li>\n                  <a href=\"/gardening/growing-guides\">Growing Guides</a>\n              </li>\n        </ol>\n  </nav>\n\n      </div>\n      </div>\n\n  </div>\n\n  \n\n  <section class=\"layout layout--onecol\">\n    \n      <div>\n    \n\n<div id=\"block-almanac-page-title\" class=\"block block-core block-page-title-block block--page-title-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n<h1 class=\"page-title\">      <span class=\"field field--name-title field--type-string field--label-hidden\">How to Grow Plums: Planting, Care, and Harvesting Tips for Juicy Fruit</span>\n  </h1>\n\n      </div>\n      </div>\n\n\n<div id=\"block-almanac-content\" class=\"block block-system block-system-main-block block--system-main-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n\n<article data-history-node-id=\"90165\" class=\"node node--type-plant node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: true\n    Is front: false\n    View mode: full\n    Node type: plant\n    Node ID: 90165\n    Current path: /plant/plums\n    -->\n\n                  \n                    \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n      <div class=\"layout layout--twocol-section layout--twocol-section--75-25 plant-info\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-imageprimary block--field-blocknodeplantfield-imageprimary flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-imageprimary field--type-entity-reference field--label-hidden field__item\">\n\n\n\n<article data-history-node-id=\"125344\" class=\"node node--type-image node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: full\n    Node type: image\n    Node ID: 125344\n    Current path: /plant/plums\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/or/public/image_nodes/plums-branch.jpg?itok=L-3PRR23\" width=\"1186\" height=\"667\" alt=\"\" class=\"image-style-or\" />\n\n\n</div>\n          </div>\n  \n  <div class=\"field field--name-field-credit field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Photo Credit</div>\n              <div class=\"field__item\">Pixabay</div>\n          </div>\n\n  </div>\n\n  </article>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"botanical-name block block-layout-builder block-field-blocknodeplantfield-botanicalname block--field-blocknodeplantfield-botanicalname flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-botanicalname field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Botanical Name</div>\n              <div class=\"field__item\">Prunus spp.</div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-plant-type-term block--field-blocknodeplantfield-plant-type-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-plant-type-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Plant Type</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/type/fruit\" hreflang=\"en\">Fruit</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-sun-exposure-term block--field-blocknodeplantfield-sun-exposure-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-sun-exposure-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Sun Exposure</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/sun/full-sun\" hreflang=\"en\">Full Sun</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-soil-ph-term block--field-blocknodeplantfield-soil-ph-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-soil-ph-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Soil pH</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/ph/slightly-acidic-neutral\" hreflang=\"en\">Slightly Acidic to Neutral</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-bloom-time-term block--field-blocknodeplantfield-bloom-time-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-bloom-time-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Bloom Time</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/blooms/spring\" hreflang=\"en\">Spring</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-flower-color-term block--field-blocknodeplantfield-flower-color-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-flower-color-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Flower Color</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/color/pink\" hreflang=\"en\">Pink</a></div>\n          <div class=\"field__item\"><a href=\"/plants/color/white\" hreflang=\"en\">White</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-hardiness-zone-term block--field-blocknodeplantfield-hardiness-zone-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-hardiness-zone-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Hardiness Zone</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/hardiness/3\" hreflang=\"en\">3</a></div>\n          <div class=\"field__item\"><a href=\"/plants/hardiness/4\" hreflang=\"en\">4</a></div>\n          <div class=\"field__item\"><a href=\"/plants/hardiness/5\" hreflang=\"en\">5</a></div>\n          <div class=\"field__item\"><a href=\"/plants/hardiness/6\" hreflang=\"en\">6</a></div>\n          <div class=\"field__item\"><a href=\"/plants/hardiness/7\" hreflang=\"en\">7</a></div>\n          <div class=\"field__item\"><a href=\"/plants/hardiness/8\" hreflang=\"en\">8</a></div>\n          <div class=\"field__item\"><a href=\"/plants/hardiness/9\" hreflang=\"en\">9</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-subhead block--field-blocknodeplantfield-subhead flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-subhead field--type-string field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Subhead</div>\n              <div class=\"field__item\"><h2>Learn how to choose, plant, and care for plum trees with this complete growing guide</h2>\n</div>\n          </div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33\">\n\n          <div  class=\"layout__region layout__region--first\">\n        <div class=\"author-line-block\">\n        <div class=\"author-line\">\n      <span class=\"author-label\">Written By:</span>\n      <span class=\"author-name\"><a href=\"/author/catherine-boeckmann\" hreflang=\"en\">Catherine Boeckmann</a></span>\n                                <span class=\"author-title\">Executive Digital Editor and Master Gardener</span>\n                  </div>\n  \n    </div>\n\n\n<div class=\"date_line block block-layout-builder block-field-blocknodeplantchanged block--field-blocknodeplantchanged flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-changed field--type-changed field--label-hidden field__item\"><time datetime=\"2025-08-13T16:44:12-04:00\" class=\"datetime\">August 13, 2025</time>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-almanac-share block-almanac-share-block block--almanac-share-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n<div class=\"mt-8 pt-6\">\n  \n    <div class=\"share-component\"\n       data-share-title=\"How to Grow Plums: Planting, Care, and Harvesting Tips for Juicy Fruit\"\n       data-share-text=\"Check out this great content from The Old Farmer&#039;s Almanac!\"\n       data-share-url=\"https://www.almanac.com/plant/plums\"\n       data-share-hashtags=\"almanac\"\n       data-share-via=\"oldfarmersalmanac\"\n       data-print-service=\"printfriendly\">\n\n    <div class=\"share-component--buttons\">\n            <div class=\"share-toggle-container\">\n                <button type=\"button\" class=\"share-toggle\" aria-label=\"Share this content\">\n          <svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 24 24\" fill=\"currentColor\">\n            <path d=\"M18 16.08c-.76 0-1.44.3-1.96.77L8.91 12.7c.05-.23.09-.46.09-.7s-.04-.47-.09-.7l7.05-4.11c.54.5 1.25.81 2.04.81 1.66 0 3-1.34 3-3s-1.34-3-3-3-3 1.34-3 3c0 .24.04.47.09.7L8.04 9.81C7.5 9.31 6.79 9 6 9c-1.66 0-3 1.34-3 3s1.34 3 3 3c.79 0 1.5-.31 2.04-.81l7.12 4.16c-.05.21-.08.43-.08.65 0 1.61 1.31 2.92 2.92 2.92s2.92-1.31 2.92-2.92-1.31-2.92-2.92-2.92z\"/>\n          </svg>\n          <span>Share</span>\n        </button>\n\n                <div class=\"share-social-buttons\">\n                  </div>\n      </div>\n    </div>\n  </div>\n</div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 content-area\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"newsletter-incontent block block-listrak block-listraksubscribe-block block--listraksubscribe-block flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--listraksubscribe-block font-normal mt-0\">\n      Sign up for daily gardening advice and tips\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n<form class=\"listrak-form-subscribe\" data-drupal-selector=\"listrak-form-subscribe\" action=\"/plant/plums\" method=\"post\" id=\"listrak-form-subscribe\" accept-charset=\"UTF-8\">\n  <div class=\"js-form-item form-item js-form-type-email form-item-email js-form-item-email form-no-label\">\n      <label for=\"edit-email\" class=\"visually-hidden js-form-required form-required\">Email Address</label>\n          <input placeholder=\"Enter your email address\" data-drupal-selector=\"edit-email\" type=\"email\" id=\"edit-email\" name=\"email\" value=\"\" size=\"60\" maxlength=\"254\" class=\"form-email required\" required=\"required\" />\n\n        </div>\n  <input data-drupal-selector=\"edit-submit\" type=\"submit\" id=\"edit-submit\" name=\"op\" value=\"Sign Up\" class=\"button button--primary js-form-submit form-submit\" />\n  <input autocomplete=\"off\" data-drupal-selector=\"form-gvqxqqaipqjyqutlzzjyqbisf0jke5rw6bg6l1phxo\" type=\"hidden\" name=\"form_build_id\" value=\"form-_GVQXqqaiPqJyQUTlzzJYqBISf0JkE5rw6Bg6l1pHXo\" />\n  <input data-drupal-selector=\"edit-listrak-form-subscribe\" type=\"hidden\" name=\"form_id\" value=\"listrak_form_subscribe\" />\n\n</form>\n\n\n\n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-2 block--views-blockpost-roll-promotion-block-2 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-body block--field-blocknodeplantfield-body flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-body field--type-text-long field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      \n        <p data-start=\"538\" data-end=\"965\">Thinking about adding a little sweetness to your backyard? Plum trees are nature’s overachievers: beautiful in bloom, generous in fruit, and downright delicious when their branches are heavy with ripe, sun-warmed plums. Whether you dream of homemade jam, fresh fruit salads, or the perfect tart, this guide will walk you through everything from picking the right variety to reaping your first juicy&nbsp;harvest.</p><p>Plums (<em>Prunus domestica</em>) belong to the rose family (Rosaceae) along with cherries, <a href=\"https://www.almanac.com/plant/peaches\">peaches</a>, nectarines, and apricots. They are a type of&nbsp;<a href=\"https://www.almanac.com/news/almanac/everything/stone-fruit-how-grow-your-own\">stone fruit</a> that grows on trees in clusters, usually harvested for a short period in late summer or early&nbsp;fall.&nbsp;</p><p>These round, small fruits are usually reddish-purple in color and have smooth skin when ripe. Their flesh can be orange, red, purple, yellow, or white, and can vary in taste—some are sweet while others are&nbsp;tart.&nbsp;</p><p>There are so many ways to enjoy this juicy fruit from baking (pies, cakes, muffins) to jam-making. We also enjoy plum sauces served with pork and chicken. Or, enjoy the fruit raw like an apple and add plum slices to cereals, yogurts, and even&nbsp;salad.</p><p>Plums are also nutritious as a good source of vitamin C and&nbsp;antioxidants.</p><h3>Choosing a&nbsp;Plum&nbsp;Tree</h3><p>There are three major categories of plum trees: <strong>European</strong>, <strong>Japanese</strong>, and <strong>American hybrids</strong>.</p><ul><li>The hardy European types do well&nbsp;in most regions across the U.S., and are generally self-fertile. If you&nbsp;have space for only one tree, go with a European plum. (However, even self-fertile trees will produce better if cross-pollinated with a second&nbsp;tree.)</li><li>The Japanese types flourish where peach trees thrive (warmer regions, generally). The Japanese plums’ early blooms make them more susceptible to spring frosts in colder areas. They need to cross-pollinate with a second&nbsp;variety.</li><li>American hybrids&nbsp;are typically the&nbsp;hardiest of the plums, with some varieties surviving as far north as Zone 3. They need to cross-pollinate with a second&nbsp;variety.</li></ul><p>Order bare-root, rather than container-grown trees, if possible. Bare-root plants usually establish better.&nbsp;A well-established tree will yield up to 2 bushels of plums from late summer into&nbsp;fall.</p>\n      </div>\n      \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-2 block--views-blockmore-like-this-block-2 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-2 font-normal mt-0\">\n      Read Next\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-eac5489ef98d59dfa7960d1903687fc7749949920cf90984961213647b5e8260\">\n  \n  \n  \n\n  \n  \n  \n\n  <div class=\"item-list\">\n  \n  <ul>\n\n          <li><div class=\"views-field views-field-title\"><a href=\"/stone-fruit-how-grow-your-own\" hreflang=\"und\">Stone Fruit: How to Grow Your Own</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/unusual-fruit-and-fruit-trees-grow\" hreflang=\"und\">Unusual Fruit and Fruit Trees to Grow</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/plant/raspberries\" hreflang=\"und\">How to Grow Raspberries: A Juicy Guide to Planting, Harvesting &amp; Pruning</a></div></li>\n    \n  </ul>\n\n</div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-planting block--field-blocknodeplantfield-planting flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-planting field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Planting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <h3>When to Plant Plum&nbsp;Trees</h3><p>Plant plum trees&nbsp;in early spring, as soon as the frost in the ground has thawed. If the soil is very waterlogged, it is best to wait until it&nbsp;drains.</p><h3>Selecting a Planting&nbsp;Site</h3><p>Plums should really only be planted in a prime location&nbsp;featuring all of the following characteristics. Otherwise, they may not perform&nbsp;well.</p><ul><li>Plant plum trees in loamy, well-draining soil.&nbsp;Plums&nbsp;do not do well when planted&nbsp;in clay-heavy soils or in locations where their roots will be constantly&nbsp;wet.</li><li>Choose a planting location that receives full sun—6 to 8 hours of direct sunlight at the very&nbsp;least.</li><li>Avoid planting in low areas where frost may settle, as the frost can damage your trees. Because they flower so early, plums are especially vulnerable to spring frosts, which can damage blooms and result in sub-par&nbsp;fruiting.</li><li>Find a sheltered location, such as a south- or west-facing spot out of the wind if possible. This will help the plum tree set&nbsp;fruit.</li></ul><h3>How to Plant a Plum&nbsp;Tree</h3><ul><li>Space standard-size trees 20 to 25 feet apart and dwarf trees 10 to 15 feet&nbsp;apart.</li><li>Set bare-root trees atop a small mound of soil in the center of the planting hole, and spread the roots down and away without unduly bending&nbsp;them.</li><li>To prepare a container-grown tree for planting, remove the tree&nbsp;from its pot and get rid of&nbsp;any tightly circling roots by laying the root ball on its side and using shears to trim off these roots. Do your best to untangle roots without damaging roots, but if the root ball is particularly pot-bound, you can loosen it by scraping up and down the sides with a knife or hand&nbsp;fork.</li><li>When planting grafted trees, it&#8217;s important to keep the graft union&nbsp;1 to 2 inches above the soil line. This is especially true for dwarf varieties, as roots may start to grow from above the graft if the tree is planted too deep, bypassing the rootstock that keeps the tree&nbsp;dwarf-size.</li><li>Dig a hole that&#8217;s a few inches deeper and wider than the spread of the roots.<ul><li>For bare-root trees, set the tree on top of a small mound of soil in the middle of the hole and spread the roots away from the trunk without excessively bending&nbsp;them.</li><li>For container-grown trees, simply place the root ball in the middle of&nbsp;the&nbsp;hole.</li><li>Fill in the hole, stopping periodically to make sure that the roots are thoroughly covered and no air pockets remain around the&nbsp;tree.</li></ul></li><li>Water the tree thoroughly at the time of planting; this helps the soil to settle around the roots. Keep the tree well watered for the first few weeks after&nbsp;planting.</li><li>For bare-root trees, it&#8217;s often recommended to stake the tree for at least one year, until the tree is stable enough to stand on its&nbsp;own.</li></ul><p><strong>See our lovely video showing how to plant a plum tree and find detailed information&nbsp;below.</strong></p><div class=\"youtube-container\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"405\" src=\"https://www.youtube.com/embed/w1hNUsb8L9g\" width=\"720\"></iframe></div></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-care block--field-blocknodeplantfield-care flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-care field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Growing</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \n        <h3>How to Care for Plum&nbsp;Trees</h3><p><strong>Watering</strong></p><ul><li>Be sure to water the young trees heavily every week during the first growing season to help promote growth. Then, water regularly. It’s best to water the plant deeply at the soil line, then let the soil dry out (though not completely)&nbsp;and&nbsp;water&nbsp;again.</li><li>If rain is lacking, water your tree well into mid-October to give it plenty of moisture through the winter&nbsp;months.</li></ul><p><strong>Fertilizing</strong></p><ul><li>Do not fertilize young fruit trees until they have set a&nbsp;crop.</li><li>Once established, fruit production requires regular fertilizing all year long. If there’s good fruit set, fertilize with one pound of calcium nitrate per tree or 1½ lb. 10-10-10. Cut back the nitrogen in fall and winter to avoid encouraging new growth in those&nbsp;seasons.</li></ul><p><strong>General&nbsp;Care</strong></p><ul><li>Are you having pest issues? Talk to your local <a href=\"https://www.almanac.com/content/cooperative-extension-services\">cooperative extension</a>&nbsp;for natural solutions that work in your&nbsp;area.</li><li>To help control <a href=\"https://www.almanac.com/gardening/pests-and-diseases\">pests and diseases</a>, remember to prune your trees to keep them open. You can also <a href=\"https://www.almanac.com/blog/gardening/garden-journal/mulching-guide-benefits-mulch\">mulch</a> around the trees in the spring to help <a href=\"https://www.almanac.com/content/weed-control-techniques\">control weeds</a>, but be sure to remove the mulch in the late fall so that no pests use it over the winter. You can also lightly cultivate the soil around your trees in late spring to eliminate any pests in the&nbsp;soil.</li><li>In the fall, rake away all debris and fallen&nbsp;trees.</li><li>To prevent winter injury: Consider a tree wrap or guard around the lower trunk, especially for a young plum&nbsp;tree.</li><li>Keep an eye on the lower bark and branches for <a href=\"https://www.almanac.com/pest/mice\">mouse</a> or <a href=\"https://www.almanac.com/pest/rabbits\">rabbit</a> damage; if this could be a problem, you may need to install tree guards or fence in young trees with chicken wire for the&nbsp;winter.</li></ul><p><img src=\"/sites/default/files/users/The%20Editors/plum-magenta_full_width.jpg\" alt=\"fresh plums on the branch\" width=\"720\" height=\"480\" loading=\"lazy\"></p><h3>How to Prune Plum&nbsp;Trees</h3><p><strong>When to&nbsp;Prune</strong></p><ul><li>Prune in early spring or mid-summer to avoid infection. The best time for pruning is usually spring for young trees and mid-summer for established&nbsp;ones.</li><li>Do <span class=\"caps\">NOT</span> prune in the fall. Winter injury and&nbsp;infection may&nbsp;occur.</li></ul><p><strong>Thinning&nbsp;Fruit</strong></p><p>“Thinning” is the process of removing developing fruit from a tree in order to increase the overall quality of the produced fruit and to prevent damage to the&nbsp;tree.</p><ul><li>Thinning is usually done about a month&nbsp;after blooming ends in the&nbsp;spring.</li><li>Leave 2-4 inches between each fruit, removing those in&nbsp;between.</li><li>Thinning helps to prevent branches from breaking under the weight of the fruit. If branches do break, prune them back to undamaged wood, ideally cutting back to a natural fork to avoid leaving&nbsp;stubs.</li></ul><p><strong>Pruning: Japanese Plum&nbsp;Trees</strong></p><ul><li>If you have a Japanese variety, the best pruning method is to create an “open center” shape, where the central trunk is cut short and several large branches radiate outwards from it’s tip. In the summer of the first year, cut the vigorous shoots that form on the top of the tree by two or three buds. After about a month, check the tree. As soon as you have three wide-angled branches, spaced equally apart, cut back any other branches so that these three are the main branches. In the early summer of the second year, cut back the branches in the middle of the tree to short stubs and prune any shoots developing below the three main branches. After the third year, remove any shoots in the center of the tree to keep its&nbsp;shape.</li><li>Japanese types require heavy pruning to help keep them in shape and to produce better fruit. It is also good to thin out the fruit on these types of trees. You should space the plums about 3 to 4 inches apart on each&nbsp;branch.</li></ul><p><strong>Pruning: European Plum&nbsp;Trees</strong></p><ul><li>If you have a European variety, the best pruning method is to create a central leader. This shape features a central trunk with branches that spiral out every 5 to 8 inches, making sure that no branch is directly above another. The training for such a system begins in the early summer of the first year, during which time you should remove any shoots that form within 18 inches of the ground. The end result should resemble a Christmas&nbsp;tree.</li><li>European types do not typically require fruit thinning because they do not produce as much fruit as Japanese types. However, the fruit on these types should be spaced about 2 inches apart on each&nbsp;branch.</li></ul><p>For more pruning tips, check our <a href=\"https://www.almanac.com/content/spring-pruning-guide-trees-and-shrubs\">spring pruning guide</a>.</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"plain-text block block-layout-builder block-field-blocknodeplantfield__recommended block--field-blocknodeplantfield__recommended flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field__recommended field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Types</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <ul><li>For a <strong>European</strong> type, try the <strong>‘Stanley&#8217;</strong>. This semi-freestone type works great for the eastern, midwestern, and&nbsp;some of the northwest regions of the <span class=\"caps\">U.S.</span> It is self-fertile, meaning no cross-pollination is necessary. It&#8217;s harvested in late August, producing&nbsp;medium to large plums with dark blue skin and greenish-yellow flesh and is great for cooking, canning, or eating&nbsp;fresh.</li><li>For a <strong>Japanese</strong> type, try the <strong>‘Satsuma&#8217;</strong>, which produces large, dark-red plums. This kind is good for eating fresh and canning because of its sweet&nbsp;taste.</li><li><strong>American hybrid</strong> trees, such as <strong>‘Alderman&#8217;</strong>, <strong>‘Superior&#8217;</strong>, and <strong>‘Underwood&#8217;</strong>, are all popular choices. These trees combine the taste of the Japanese variety with the hardiness of the European variety. These types work well for regional&nbsp;extremes.</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-harvest block--field-blocknodeplantfield-harvest flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-harvest field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Harvesting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <h3>When to Harvest&nbsp;Plums</h3><ul><li>Plums are ready to be harvested from late summer&nbsp;into fall, depending on your&nbsp;area.</li><li><strong>European plums</strong> have the best flavor when left to ripen on the tree. You can tell when plums are ripe by applying gentle pressure with your fingers. If the skin of the fruit feels soft, then it is ready to be picked. Plums should come off the tree easily with just a slight twist of the&nbsp;fruit.</li><li><strong>Japanese plums</strong> are picked slightly earlier; allow them to ripen in a cool&nbsp;place.</li><li>Plums will not sweeten much after harvest, so be sure to pick them when they&#8217;re mature. (Try one before you pick them&nbsp;all!)</li></ul><h3>How to Store&nbsp;Plums</h3><ul><li>Unfortunately, the fruit does not store for long, so must be eaten or preserved. Alternatively, you can pick the fruits when they are still slightly firm and store them in a cool place to fully&nbsp;ripen.</li><li>The best place to store plums is in the refrigerator. The best temperature for storing plums is about 31° to 32°F with relative humidity around 90–95%; if kept at this temperature, plums may last for 2 to 4&nbsp;weeks.</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n<div class=\"recommender-title block block-block-content block-block-contente8acfdbd-8aa8-4a11-9e44-f56cad64ee7a gardening-recommendations print-no\">\n  \n      <h2 class=\"block__title category-heading\">Gardening Products</h2>\n    \n\n  <div class=\"block__content\">\n    <div class=\"gardening-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"49397b29-784d-45ad-ba5f-2ca9659c9feb\">\n    <script type=\"text/html\">\n       var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\" style=\"width: 32%\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div></p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-pests block--field-blocknodeplantfield-pests flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-pests field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Pests/Diseases</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                              \n        <ul><li><strong>Silver leaf&nbsp;disease</strong></li><li><strong>Honey&nbsp;fungus</strong></li><li><strong>Bacterial&nbsp;canker</strong></li><li><strong>Pocket&nbsp;plum</strong></li><li><a href=\"https://www.almanac.com/content/japanese-beetles\"><strong>Japanese&nbsp;beetles</strong></a></li><li><strong>Plum </strong><a href=\"https://www.almanac.com/content/aphids\"><strong>aphids</strong></a></li><li><strong>Plum&nbsp;moth</strong></li></ul><p>Contact your local <a href=\"https://www.almanac.com/content/cooperative-extension-services\">cooperative extension</a> to implement a spraying program that can help manage these <a href=\"https://www.almanac.com/gardening/pests-and-diseases\">pests and diseases</a>.</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-wit-and-wisdom block--field-blocknodeplantfield-wit-and-wisdom flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-wit-and-wisdom field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Wit and Wisdom</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                              \n        <p>“<em>The children were nestled all snug in their beds,</em><br><em>While visions of sugar-plums danced in their heads.</em>”<br>–Clement Clarke Moore, “A Visit from St. Nicholas” (a.k.a “&#8201;‘Twas the Night Before Christmas”),&nbsp;1822</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-recipes block--field-blocknodeplantfield-recipes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-recipes field--type-entity-reference field--label-above\">\n    <div class=\"field__label\">Recipes</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/recipe/dark-plum-duff\" hreflang=\"und\">Dark Plum Duff</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/indian-summer-applesauce\" hreflang=\"und\">Second Summer Applesauce</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/plum-crostata\" hreflang=\"und\">Plum Crostata</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/christmas-plum-pudding\" hreflang=\"und\">Christmas Plum Pudding</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-cooking-notes block--field-blocknodeplantfield-cooking-notes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-cooking-notes field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Cooking Notes</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                              \n        <ul><li>Plums are great for making <a href=\"https://www.almanac.com/content/making-jams-and-jellies-tips-and-recipes\">jams or jellies</a>.</li><li>Plums can also be stored through freezing or drying them (dried plums are prunes), learn <a href=\"https://www.almanac.com/drying-vegetables-and-fruits-with-a-dehydrator\">how to dry fruit with a dehydrator</a>.</li></ul><p><br>&nbsp;</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-topics block--field-blocknodeplantfield-topics flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n      <div class=\"field field--name-field-topics field--type-entity-reference field--label-hidden field__items\">\n              <div class=\"field__item\"><a href=\"/topics/gardening/edible-gardening/fruit\" hreflang=\"en\">Fruit</a></div>\n          </div>\n  \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block--author-bio block-views block-views-blockauthor-bio-block-1 block--views-blockauthor-bio-block-1 flex flex-col\">\n  \n      <div class=\"block__title block-title block-title--views-blockauthor-bio-block-1 w-full\">\n      About The Author\n    </div>\n    \n\n            <div class=\"block__content author-bio-content\">\n                <div class=\"author-bio-main\">\n                                                              \n                                            <div class=\"author-picture-wrapper\">\n                  <img src=\"/sites/default/files/pictures/2024-10/IMG_0365.jpeg\" alt=\"Catherine Boeckmann\" class=\"author-picture\">\n                </div>\n              \n                            <div class=\"author-info-section\">\n                                \n                    <h2 class=\"author-name\">Catherine Boeckmann</h2>\n\n                \n                                                  <h3 class=\"author-job-title\">Executive Digital Editor and Master Gardener</h3>\n                \n                                                                                                            <div class=\"author-bio\">Catherine Boeckmann is the Executive Digital Editor of Almanac.com, the website companion of The Old Farmer&#039;s Almanac. She covers gardening, plants, pest control, soil composition, seasonal and moon c...</div>\n                                  \n                                                  <div class=\"author-link-wrapper\">\n                    <a href=\"/author/catherine-boeckmann\" class=\"author-link\">\n                      Read More from Catherine Boeckmann\n                    </a>\n                  </div>\n                \n                                \n                                              </div>\n                              </div>\n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-guides block-guides-toc-block block--guides-toc-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-1 block--views-blockmore-like-this-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-1 font-normal mt-0\">\n      More Like This\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-56d60b765ca16d451eac5ac59bf7e53a0392b9344f3767942655aba3730e160a\">\n  \n  \n  \n\n  \n  \n  \n\n  \n\n\n<!-- Check if there are multiple rows -->\n  <!-- Multiple rows - wrap each in grid tile -->\n  <div class=\"grid gap-6 auto-rows-auto grid-cols-1 md:grid-cols-3 mb-2\">\n                                        <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/stone-fruit-how-grow-your-own\">\n\n\n\n<article data-history-node-id=\"89054\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 89054\n    Current path: /plant/plums\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/images/peaches-379893_640.jpg?itok=HhUBG4UX\" width=\"650\" height=\"366\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/stone-fruit-how-grow-your-own\" hreflang=\"und\">Stone Fruit: How to Grow Your Own</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/unusual-fruit-and-fruit-trees-grow\">\n\n\n\n<article data-history-node-id=\"130469\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 130469\n    Current path: /plant/plums\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/cowberries-5548811_1920_full_width.jpg?itok=_87AYDVp\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/unusual-fruit-and-fruit-trees-grow\" hreflang=\"und\">Unusual Fruit and Fruit Trees to Grow</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/raspberries\">\n\n\n\n<article data-history-node-id=\"121500\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 121500\n    Current path: /plant/plums\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/raspberries.jpg?itok=zR6z631-\" width=\"650\" height=\"366\" alt=\"red raspberries\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/raspberries\" hreflang=\"und\">How to Grow Raspberries: A Juicy Guide to Planting, Harvesting &amp; Pruning</a></h3></div>\n            </div>\n                                                                <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/growing-asian-pears-easy-and-exotic\">\n\n\n\n<article data-history-node-id=\"122829\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 122829\n    Current path: /plant/plums\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/asian-pear-936916_1920_full_width.jpg?itok=syKCTke2\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/growing-asian-pears-easy-and-exotic\" hreflang=\"und\">Growing Asian Pears—Juicy-Sweet, Yet Crisp!</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/cherries\">\n\n\n\n<article data-history-node-id=\"107766\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 107766\n    Current path: /plant/plums\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/cherries-planting-growing-harvesting.jpg?itok=S89QStyD\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/cherries\" hreflang=\"und\">How to Grow Cherries: The Complete Guide</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/best-apples-baking-and-cooking\">\n\n\n\n<article data-history-node-id=\"260760\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 260760\n    Current path: /plant/plums\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/THE.jpg?itok=NOLuxZSB\" width=\"650\" height=\"366\" alt=\"apples on a wooden background, the best apples for baking, the best apples for cooking, applesauce, apple cider, and apple butter\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/best-apples-baking-and-cooking\" hreflang=\"und\">Best Apples for Baking, Pies, Sauces, Cider &amp; More (With Apple Variety Chart)</a></h3></div>\n            </div>\n                              </div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-1 block--views-blockpost-roll-promotion-block-1 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 more-like-this print-no\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"views-element-container block block-views block-views-blockcomment-form-block-1 block--views-blockcomment-form-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockcomment-form-block-1 font-normal mt-0\">\n      Comments\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-2543adac317a5465fb18b2b1ed8f721b3ead806beb5c22901291093905c3d826\">\n  \n  \n  \n\n  \n  \n  \n\n      <div class=\"views-row\"><div class=\"views-field views-field-nid\"><span class=\"field-content\"><a href=\"/comment/reply/node/90165/comment_node_plant\">Add a Comment</a></span></div></div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n\n<div class=\"views-element-container comment-ajax-wrapper\">\n  \n    \n      <div><div class=\"js-view-dom-id-02433af5d05d7b71947ab20c1f7d29878dfbd7c9417a47b49309676e5a283c79\">\n  \n  \n  \n\n  \n  \n  \n\n  <div data-drupal-views-infinite-scroll-content-wrapper class=\"views-infinite-scroll-content-wrapper clearfix\">    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"134503\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;S Mangan&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sun, 06/09/2024 - 08:01</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"134503\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      This article does not describe how to prune or when to pick American Hybrid varieties. Which is what I have.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-134503\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"134514\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Mon, 06/10/2024 - 14:22</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"134514\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Hi S,</p><p>You should plan to prune your plum trees in late winter/early spring, after the coldest part of the winter has passed, but before buds break and new growth occurs. When pruning is done during the summer or fall, it can reduce dormancy and can potentially cause damage to your plum trees, especially when there is an early winter.</p><p>When pruning, start by removing and dead, damaged, or diseased branches. Then remove branches to allow for more light to penetrate, increase fruit quality, and encourage new branch development. You should also prune off suckers coming from the rootstock and vegetative water sprouts growing straight up from main branches.</p><p>Harvesting plums will take place in summer into fall (depending on your growing area). You should allow the plums to ripen on the tree as they will not gain sweetness once picked. One indicator is if you press on the skin and it is slightly soft to the touch. If you are unsure, pick one and try it to see what if the taste is to your liking.</p><p>Hope this helps! &nbsp;</p>\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-134514\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"125341\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Jes&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sun, 08/07/2022 - 19:06</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"125341\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I don't know the type of plum tree i have, but it's rather large and produces a lot of plums.  We have this black fungus that keeps growing on the branches every year.  We have tried neam oil and neam pesticide, which have not worked.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-125341\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"117537\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Scott&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sat, 04/24/2021 - 16:37</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"117537\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I purchased a Hollywood variety for my Seattle area home, and now realize I need a 2nd variety for x-pollination. The next closest location for the 2nd tree would be about 100' away.  Is that too far for an effective x-pollination sibling?\r\n\r\nThanks\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-117537\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"117569\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Mon, 04/26/2021 - 16:49</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"117569\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>The recommended maximum distance between plum trees&nbsp;is 50 feet, but as long as there are plenty of&nbsp;pollinators in your area, 100 feet shouldn't be too far. You may just end up with fewer plums than ideal—but that's better than no plums!</p>\r\n\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-117569\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"112466\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Pam Wells&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 08/27/2020 - 09:23</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"112466\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      My Stanley Plum Tree dropped over half its unripened fruit in early July and then dropped more in August.  It does not appear diseased.  Is that a sign of lack of fertilizer or hot weather? Or some other reason?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-112466\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"137529\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;David Lenoir&lt;/span&gt;</span>\n        <span class=\"comment-time\">Wed, 04/23/2025 - 07:40</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"137529\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I have been having this same problem for the last few years. I have tried watering, 10-10-10 and citrus fertilizer to no avail.\r\nMy trees are loaded and when the fruit is about half size they begin falling off.\r\nI am in mid S.C. And the trees are in full sun.\r\nI am having the same issues with my two peach trees.\r\nAny ideas of what I should do.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-137529\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"121809\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Hans Luckey&lt;/span&gt;</span>\n        <span class=\"comment-time\">Wed, 12/29/2021 - 09:50</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"121809\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Best time to plant \n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-121809\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"112473\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Thu, 08/27/2020 - 15:35</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"112473\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>That's unfortunate. It's unlikelly to be too much or too little fertilizer. Premature fruit drop is common among fruit trees; it's Mother Nature's way of reducing the load—especially if you do not thin the fruit load yourself (prune when plums are about 3/4-inch long, leaving&nbsp;4 to 6 inches between remaining fruits). Weather could be a factor; high heat in early spring can stress the tree, and if conditions in general have&nbsp;been dry, the tree may not be well irrigated.</p>\r\n\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-112473\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"112462\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Teresa&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 08/27/2020 - 08:16</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"112462\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90165\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I'm in zone 4 and two years ago bought a home with two plum trees on the property.  They are quite large, have lovely, fragrant blooms in early spring, but have produced no fruit at all. What could be wrong? The trees are healthy looking with no sign of pests or disease. Help?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-112462\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n</div>\n\n    \n<div class=\"comment-pager-wrapper\">\n  <ul class=\"comment-pagination js-pager__items\" data-drupal-views-infinite-scroll-pager>\n        \n              <li class=\"pager__item\">\n        <span class=\"pager-previous disabled button\">« Previous</span>\n      </li>\n    \n        \n              <li class=\"pager__item\">\n                  <span class=\"current-page button\">1</span>\n              </li>\n          <li class=\"pager__item\">\n                  <a href=\"?page=1\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to page 2\">2</a>\n              </li>\n    \n              <li class=\"pager__item\">\n        <span class=\"pager-ellipsis button\">…</span>\n      </li>\n      <li class=\"pager__item\">\n        <a href=\"?page=9\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to last page\">10</a>\n      </li>\n    \n        <li class=\"pager__item\">\n      <a href=\"?page=1\" class=\"use-ajax button js-pager__item pager-next\" data-drupal-views-infinite-scroll-pager-link title=\"Go to next page\" rel=\"next\">Next »</a>\n    </li>\n  </ul>\n</div>\n\n\n  \n  \n\n  \n  \n</div>\n</div>\n\n  </div>\n\n      </div>\n    \n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"store-logo block block-block-content block-block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 block--block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div style=\"align-items:center;background-color:#005336;display:flex;flex-wrap:wrap;gap:20px;justify-content:space-evenly;margin-bottom:20px;margin-top:40px;padding:10px;width:100%;\"><div style=\"color:#fff;\">📣<strong>The Gardening Club Just Got Better!</strong> 3 Deliveries, 10% Store Discount, and more!</div><div><a class=\"text-button\" href=\"https://store.almanac.com/pages/most-popular-club\" target=\"blank\">Learn More</a></div></div><a href=\"https://store.almanac.com/\" target=\"_blank\"><img src=\"https://www.almanac.com/sites/default/files/promotion/old-farmers-almanac-store-logo-1200px.jpg\" data-entity-uuid=\"c84260b7-88a4-4419-a3ff-3e408f8c6c79\" data-entity-type=\"file\" alt=\"The Old Farmer's Almanac Store\" width=\"600\" height=\"77\" align=\"center\" class=\"align-center\" loading=\"lazy\"></a></p>\n      </div>\n      \n      </div>\n      </div>\n<div class=\"content-recommender print-no block block-block-content block-block-contentfdd6ba48-ec8e-4e76-8008-f0a9ba0e596b listrak-recommendations\">\n  \n    \n\n  <div class=\"block__content\">\n    <div class=\"listrak-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"f5f04466-f923-491d-9354-679d54e32def\">\n    <script type=\"text/html\">\n        var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div>           \n</p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n    </div>\n  </div>\n\n  </div>\n\n  </article>\n\n      </div>\n      </div>\n\n  </div>\n\n    \n  </section>\n\n  </main>\n\n<footer id=\"page-footer\">\n    <div class=\"w-full bg-sand newsletter-signup-footer\">\n    <div class=\"max-w-[85rem] mx-auto md:px-20\">\n\n      <div class=\"flex-nowrap w-full md:w-auto pt-8 text-center md:text-left\">\n        <h4 class=\"text-xl md:text-2xl font-normal font-sans leading-tight text-black mb-2\">Get Almanac's Daily Updates</h4>\n      </div>\n\n      <div class=\"flex flex-col md:flex-row items-center justify-between gap-6 pb-8\">\n                <div class=\"text-center md:text-left flex-1\">\n          <p class=\"text-base md:text-lg text-black\">\n            <span class=\"uppercase font-bold\">BONUS</span>: You'll also receive our free <em>Beginner Gardening Guide!</em>\n          </p>\n        </div>\n\n                <div class=\"flex-grow w-full md:w-auto\">\n          <form class=\"flex flex-col sm:flex-row gap-3 md:gap-4 w-full md:w-auto sm:px-4 p-0\" action=\"/\" method=\"post\">\n            <input\n              type=\"email\"\n              name=\"email\"\n              placeholder=\"Enter your email address\"\n              class=\"flex-1 px-3 py-2 md:px-4 md:py-3 text-gray-900 bg-white focus:outline-none focus:ring-2 focus:ring-brick-red placeholder-gray-500\"\n              required\n            >\n            <button\n              type=\"submit\"\n              class=\"px-4 py-2 md:px-6 md:py-3 bg-brick-red text-white font-bold hover:bg-dark-red focus:outline-none focus:ring-2 focus:ring-brick-red transition-colors whitespace-nowrap\"\n            >\n              Go\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n  </div>\n\n    <div class=\"layout layout--page max-w-[85rem] mx-auto\">\n    <div class=\"container mx-auto pb-12\">\n      \n<div class=\"region region--footer-top footer-top-region\">\n  <div class=\"section--container\">\n    <div class=\"grid grid-cols-1 md:grid-cols-3 gap-8\">\n      <nav  id=\"block-almanac-general\" class=\"block block-menu navigation menu--general\" aria-labelledby=\"block-almanac-general-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-general-menu\">Our Brands</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"https://store.almanac.com/\">The Old Farmer’s Almanac Store</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://newengland.com/\">Yankee Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.familytreemagazine.com/\">Family Tree Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhbr.com/\">NH Business Review</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhmagazine.com/\">New Hampshire Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://yankeecustommarketing.com/\">Yankee Custom Marketing</a>\n              </li>\n      </ul>\n\n  </nav>\n<nav  id=\"block-almanac-resources\" class=\"block block-menu navigation menu--resources\" aria-labelledby=\"block-almanac-resources-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-resources-menu\">Resources</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"/about-us\">About Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/contact\">Contact Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/signup\">Free Daily Newsletter</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/webcam\">Webcam</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediakit\">Advertise with Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediaroom\">Media Relations</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/retail\">Sell the Almanac</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/wheretobuy\">Where to Buy</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/terms-of-use/\">Terms of Use</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/privacy-policy\">Privacy Policy</a>\n              </li>\n      </ul>\n\n  </nav>\n<div class=\"social-menu flex\">\n  \n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n\n    </div>\n  </div>\n</div>\n\n\n      <div class=\"social-menu grid grid-cols-5 gap-8\">\n        \n      </div>\n\n      <div class=\"text-sm text-gray-600 flex justify-between mt-24 mb-12\">\n        <div>\n            © 2025 <a href=\"https://ypi.com/\" target=\"_blank\" class=\"inline\">Yankee Publishing Inc.</a>, An Employee-Owned Company.\n        </div>\n        <div>\n          1121 Main Street | P.O. Box 520 | Dublin, NH 03444\n        </div>\n      </div>\n    </div>\n  </div>\n</footer>\n\n  </div>\n\n\n  <div class=\"region region--page-bottom\">\n    \n  </div>\n\n  \n  <script type=\"application/json\" data-drupal-selector=\"drupal-settings-json\">{\"path\":{\"baseUrl\":\"\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/90165\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"eJw9j1sSwyAIRTekdUkOMSTDFMFBbMfdN22S_gD38XEAriBQ0s66AMfuk0n2AJfNMHV4XAbxihb7aE3N_3EzqmAzHnPHWFTclENhBHHgZ4K2FI9tLEwlFK0VxdNqowE_LhmXGV-Eb7S7kDe1mm7RYCcBJ5Wwwux5iBOnLyf2cOLlCy_5W4ty7lh-_StdqRd9oc2kgkcemLobPNO1g8-mu9E20_8KX6SefvNRdR2Mp5VJNhJyzL0cv_JZibcbT_cD4OiHTA\",\"theme\":\"almanac\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:02433af5d05d7b71947ab20c1f7d29878dfbd7c9417a47b49309676e5a283c79\":{\"view_name\":\"comments_with_ajax_\",\"view_display_id\":\"block_1\",\"view_args\":\"90165\",\"view_path\":\"\\/node\\/90165\",\"view_base_path\":null,\"view_dom_id\":\"02433af5d05d7b71947ab20c1f7d29878dfbd7c9417a47b49309676e5a283c79\",\"pager_element\":0}}},\"almanac\":{\"adExclusions\":{\"fullExclude\":[\"\\/retail\",\"\\/mediakit\",\"\\/club\",\"\\/winter\",\"\\/mediaroom\",\"\\/kids\",\"\\/old-farmers-almanac-promotional-images\"],\"videoOnly\":[\"\\/how-to-kill-poison-ivy\",\"\\/wheretobuy\",\"\\/feminized-seeds\",\"\\/autoflower-seeds\",\"\\/how-to-germinate-cannabis-seeds\"]}},\"user\":{\"uid\":0,\"permissionsHash\":\"a870a3cd03311fe2742a98671d86d33235d0ba55333d275d5575e9fd83f56f7e\"}}</script>\n<script src=\"/core/misc/drupalSettingsLoader.js?v=11.2.4\"></script>\n<script src=\"/themes/almanac/dist/js/scripts.js?t4yh8p\"></script>\n<script src=\"/modules/contrib/views_infinite_scroll/js/infinite-scroll.js?v=11.2.4\"></script>\n\n</body>\n</html>\n",
  "scrapedAt" : "2025-11-04T21:31:47.948865Z",
  "successful" : true,
  "errorMessage" : null
}