{
  "slug" : "potatoes",
  "source" : "Almanac.com",
  "url" : "https://www.almanac.com/plant/potatoes",
  "commonName" : "Planting, Growing, and Harvesting Potatoes",
  "description" : null,
  "companionSection" : "",
  "plantingGuide" : "### Dig into the basics of planting, growing, and storing potatoes\n\n\n### Planting\nWhen to Plant Potatoes Garden potatoes can be planted 2 to 4 weeks before the average last frost date. The soil temperature should be at least 55°F during the day and 45°F at night. However, pay more attention to the soil than the calendar to determine planting time. The soil should not be so wet that it sticks together and is hard to work. Let it dry out a bit first. If you have a late and wet spring, you can plant later, through April (depending on location) or even June, especially in containers. In cooler regions, the early-maturing potatoes are usually planted early to mid-April. In warmer regions, planting times range from September to February; in central Florida, gardeners plant potatoes in January; in Georgia, they plant in February. See our Planting Guide for the best dates to plant by zip code or postal code. How to Plant Potatoes Potatoes for planting are called seed potatoes and are usually sold in bags or netting. Use certified (disease-resistant) seed potatoes from which eyes (buds) protrude. Do not confuse seed potatoes with potato seeds or grocery produce. When you get them, break them free, lay them out in a tray (such as an old egg carton), and pop them somewhere bright and frost-free to sprout, such as an indoor windowsill. This is a process called chitting. It’s not essential, but chitting helps speed things along so that by the time the potatoes are planted, they’ll be primed and itching to send out roots. As the video below shows, after a month of chitting, the potatoes produced stout, stocky, green sprouts, which is exactly what we’re after; we don’t want the long, pale sprouts you get when potatoes are left in the dark. But if you haven’t had a chance to chit your potatoes and it’s already time to plant, don’t worry—get them in the ground. A great way to get more seed potatoes for free is to cut them in half. But only do this if they’ve got plenty of eyes, which appear as small dimples and are where the sprouts emerge from. For this reason, you want to place the end with the most eyes facing upwards. At least 2 days before planting, use a clean, sharp paring knife to cut large potatoes into golf ball-size pieces, with one to two eyes each. This time allows the pieces to heal or form a protective layer over the cut surface, improving both moisture retention and rot resistance. Do not cut up seed potatoes that are smaller than a hen’s egg; plant them whole. Preparing seed potatoes for planting. Photo by tanyss/Getty Images. You’ll need a location with at least 6 hours of direct sunlight and fertile, loose, well-draining soil; hard or compacted soil leads to misshapen tubers. Ideally, the soil is slightly acidic (pH 5.8 to 6.5), and the soil temperature is at least 45º to 55ºF (7° to 13°C). In the fall, mix compost or organic matter into the soil. Learn more about compost, soil amendments, and preparing the soil for planting.) Outside, prepare the planting area by simply spreading compost across the surface to a depth of around an inch or 3 cm. Potatoes are fairly hungry plants, so this extra nourishment will help to support good soil fertility and a strong harvest. 4 Methods of Planting Potatoes There are different approaches to planting potatoes: Dig Holes: For each seed potato, dig a hole about 6 inches deep (16 cm). Add in a little slow-release organic fertilizer (e.g., chicken manure pellets) and then pop in the potato with sprouts pointing up and cover with soil. Space potatoes about 16 inches (40 cm) apart in both directions for early types. Main crop potatoes need a bit more space to stretch their legs, so space them at 18 inches (45 cm) apart. Dig V-Shaped Trenches: Dig 2- to 2.5-foot-deep (15- to 190-cm) trenches. Lay a nourishing cushion of garden compost along the bottom and a few of those chicken manure pellets, then set your tubers into position about 1 foot (30 cm) apart. Then, just fill back in. I don’t think it makes a huge difference which way you plant, so do whatever’s easiest in the space you have. Plant in Straw: Nestle seed potatoes down into the soil surface, then cover them with straw. See our article on planting potatoes in straw. Plant Potatoes in Pots: If you don’t have the garden space, plant in large containers, old compost sacks, trash cans, or purpose-made potato sacks. Fill the bottom of your pot or sack with about 4 inches (10 cm) of potting mix, then lay one or two potatoes on top and cover. Once the foliage is growing, add in more potting mix, a bit at a time, to hill or earth them up until the soil level reaches the top, at which point the foliage almost seems to explode in size. See our article about container gardening with potatoes.\n\n### When to Plant Potatoes\nGarden potatoes can be planted 2 to 4 weeks before the average last frost date. The soil temperature should be at least 55°F during the day and 45°F at night. However, pay more attention to the soil than the calendar to determine planting time. The soil should not be so wet that it sticks together and is hard to work. Let it dry out a bit first. If you have a late and wet spring, you can plant later, through April (depending on location) or even June, especially in containers.\nIn cooler regions, the early-maturing potatoes are usually planted early to mid-April. In warmer regions, planting times range from September to February; in central Florida, gardeners plant potatoes in January; in Georgia, they plant in February.\nSee our Planting Guide for the best dates to plant by zip code or postal code.\n\n### How to Plant Potatoes\nPotatoes for planting are called seed potatoes and are usually sold in bags or netting. Use certified (disease-resistant) seed potatoes from which eyes (buds) protrude. Do not confuse seed potatoes with potato seeds or grocery produce.\nWhen you get them, break them free, lay them out in a tray (such as an old egg carton), and pop them somewhere bright and frost-free to sprout, such as an indoor windowsill. This is a process called chitting. It’s not essential, but chitting helps speed things along so that by the time the potatoes are planted, they’ll be primed and itching to send out roots.\nAs the video below shows, after a month of chitting, the potatoes produced stout, stocky, green sprouts, which is exactly what we’re after; we don’t want the long, pale sprouts you get when potatoes are left in the dark. But if you haven’t had a chance to chit your potatoes and it’s already time to plant, don’t worry—get them in the ground.\n\nA great way to get more seed potatoes for free is to cut them in half. But only do this if they’ve got plenty of eyes, which appear as small dimples and are where the sprouts emerge from. For this reason, you want to place the end with the most eyes facing upwards.\nAt least 2 days before planting, use a clean, sharp paring knife to cut large potatoes into golf ball-size pieces, with one to two eyes each. This time allows the pieces to heal or form a protective layer over the cut surface, improving both moisture retention and rot resistance. Do not cut up seed potatoes that are smaller than a hen’s egg; plant them whole.\n- You’ll need a location with at least 6 hours of direct sunlight and fertile, loose, well-draining soil; hard or compacted soil leads to misshapen tubers. Ideally, the soil is slightly acidic (pH 5.8 to 6.5), and the soil temperature is at least 45º to 55ºF (7° to 13°C). In the fall, mix compost or organic matter into the soil. Learn more about compost, soil amendments, and preparing the soil for planting.)\n- Outside, prepare the planting area by simply spreading compost across the surface to a depth of around an inch or 3 cm. Potatoes are fairly hungry plants, so this extra nourishment will help to support good soil fertility and a strong harvest.\n\n### 4 Methods of Planting Potatoes\nThere are different approaches to planting potatoes:\n- Dig Holes: For each seed potato, dig a hole about 6 inches deep (16 cm). Add in a little slow-release organic fertilizer (e.g., chicken manure pellets) and then pop in the potato with sprouts pointing up and cover with soil. Space potatoes about 16 inches (40 cm) apart in both directions for early types. Main crop potatoes need a bit more space to stretch their legs, so space them at 18 inches (45 cm) apart.\n- Dig V-Shaped Trenches: Dig 2- to 2.5-foot-deep (15- to 190-cm) trenches. Lay a nourishing cushion of garden compost along the bottom and a few of those chicken manure pellets, then set your tubers into position about 1 foot (30 cm) apart. Then, just fill back in. I don’t think it makes a huge difference which way you plant, so do whatever’s easiest in the space you have.\n- Plant in Straw: Nestle seed potatoes down into the soil surface, then cover them with straw. See our article on planting potatoes in straw.\n- Plant Potatoes in Pots: If you don’t have the garden space, plant in large containers, old compost sacks, trash cans, or purpose-made potato sacks. Fill the bottom of your pot or sack with about 4 inches (10 cm) of potting mix, then lay one or two potatoes on top and cover. Once the foliage is growing, add in more potting mix, a bit at a time, to hill or earth them up until the soil level reaches the top, at which point the foliage almost seems to explode in size. See our article about container gardening with potatoes.\n\n### How to Grow Parsnips: Planting, Growing, and Harvesting Guide\n\n\n### How to Grow Sweet Potatoes: Planting Slips & Harvesting Tips\n\n\n### How to Grow Eggplant (Aubergines): Planting, Growing & Harvesting Tips\n\n\n### Companion Planting Chart: Tomatoes, Potatoes, and Veggies!\n\n\n### How to Grow Peas: Complete Guide to Planting, Growing, and Harvesting Peas\n",
  "careInstructions" : "### Dig into the basics of planting, growing, and storing potatoes\n\n\n### Growing\nHow to Grow Potatoes Firstly, water! This is really important because potatoes are lush and leafy plants, and those tubers take a lot of effort to swell. So if it’s dry, water thoroughly. Maintain even moisture, especially from the time after the flowers bloom. Potatoes need 1 to 2 inches of water a week. Too much water right after planting and not enough as the potatoes begin to form can cause them to become misshapen. Stop watering when the foliage begins to turn yellow and die off. If you’re growing potatoes in containers, take extra care to keep your plants really well watered, especially in warmer weather, as this really will make all the difference in achieving a good crop. Hilling Potatoes The potato flavor is improved by depth and darkness. As the potato plants grow above the soil surface, you’ll need to periodically “hill up” or mound up soil and compost around the plant so that only the top leaves stick out of the ground. When growing potatoes, it’s vital not to allow potato spuds to be exposed to sunlight, as this also causes them to turn green and produce solanine, a chemical that gives off a bitter taste and is toxic. Do the hilling in the morning, when plants are at their tallest. (During the heat of the day, plants start drooping.) Just draw up the soil with a hoe every time the stems get to around 6 to 8 inches (15 to 20 cm) tall so that just the very tops are left poking out. Continue doing this in stages until you can no longer draw up any more soil, or the foliage closes over in between the rows. If you’re growing your potatoes in a smaller raised bed, it may be easier to simply top up with organic matter around the whole area. Hilling keeps potatoes from getting sunburned, which can cause them to turn green and produce a bitter, toxic chemical. Credit: Avalon Studio/Getty. Protect Your Potatoes From Frost Potatoes aren’t fussy vegetables, which makes them a fabulous choice for first-time growers. They do well in most soils and almost always produce plenty to hunt for at harvest time. That said, you can do a few things to elevate your crop. Late frosts can damage the young foliage—something to watch out for with early starts. Frost-bitten plants usually have enough energy to shake off any damage, but it can set plants back nonetheless. So if a frost is forecast and potatoes stand to get clobbered, do whatever you can to protect them. Cover the area in a few layers of warming fleece or row cover fabric, cover clusters of shoots with pots, or draw up the soil to bury the young shoots. Note: In cool growing seasons, potato vines may sport berries. The berries are the fruit. Cut one open and see how it resembles its cousin, the tomato. Potato berries are poisonous and inedible. Plus, their seeds will not produce potato plants that resemble the parent. Discard them. Practice yearly crop rotation with potatoes in order to avoid pests and diseases.\n\n### How to Grow Parsnips: Planting, Growing, and Harvesting Guide\n\n\n### How to Grow Eggplant (Aubergines): Planting, Growing & Harvesting Tips\n\n\n### How to Grow Peas: Complete Guide to Planting, Growing, and Harvesting Peas\n",
  "harvestInfo" : "### Harvesting\nHarvesting potatoes is fun! It’s like unearthing nature’s treasures. Harvest potatoes on dry days. Dig up gently, being careful not to puncture the tubers. Avoid cutting or bruising potato skin. The soil should not be compacted, so digging should be easy. Potatoes can tolerate light frost, but when the first hard frost is expected, it’s time to get out the shovels and start digging potatoes. Harvesting at the right stage keeps tubers from sitting too long—upping the chances of a slug or disease attack, particularly for main crop spuds. Earlies are the first to be lifted, usually while the plants are still in flower. Your tubers should be about the size of a hen’s egg or a touch bigger, but it’s up to you how big you want them. Use a fork and work your way in from the edge of the plant, taking care to avoid stabbing into the potatoes themselves. Once you’ve loosened the plants, you can lift them to expose most of the spuds, but be sure to dig around in the soil for any you’ve missed! Dig up main crop spuds once the foliage is dying back towards the end of the growing season. I find it easier to cut back the foliage before digging up the potatoes on a dry day. Leave the potatoes on the soil surface for a few hours so the skin can dry off a bit. Don’t leave them there any longer, or they may start to turn green. Extra tips for knowing when and how to dig up potatoes: Toughen up potatoes for storage before harvest by not watering them much after mid-August. Dig up a test hill to see how mature the potatoes are. The skins of mature potatoes are thick and firmly attached to the flesh. If the skins are thin and rub off easily, your potatoes are still too new and should be left in the ground for a few more days. If the soil is very wet, let the potatoes air-dry as much as possible before putting them in bags or baskets. Small green spots can be trimmed off, but throw the potato out if there is significant greening. Only store potatoes that are free of bruises, disease, or damage, as you don’t want problems in storage, and check on stored potatoes every few weeks and remove any that are starting to spoil. How to Cure Potatoes Once they’ve dried off, pack them up into breathable sacks or just sturdy cardboard boxes to store somewhere dark, cool but frost-free (45° to 60°F / 7° to 15°C) for up to 2 weeks. This allows the potato skin to cure and thus keep longer. Brush off any clinging soil; do not wash the potatoes until ready to eat; washing will shorten their life. How to Store Potatoes If you are harvesting potatoes to eat within a few days, storage is not an issue. You can store anywhere. To store potatoes for keeping, however, you need a dark, cool (38° to 40°F) place; if it’s too warm, potatoes will sprout and be susceptible to disease. Also, it needs to be somewhat humid; potatoes are 80% water, so if it’s too dry, potatoes wither and dry out. If you happen to have a damp cellar, you’re all set! Otherwise, consider an extra refrigerator set a few degrees higher than normal with tubers in dark-colored plastic bags that are perforated (with many holes cut in the side) for air movement. Avoid all light to prevent greening. Or, consider an unheated entrance, spare room, closet, attic, cabinet, or insulated garage. To elevate humidity, you could place large pans of water in front of the air source. Even after harvest, potatoes still use oxygen and give off carbon dioxide, so they must have fresh air and ventilation. Never put potatoes in airtight containers. Use perforated bags, as mentioned above. Do not store potatoes with apples; the fruit’s ethylene gas causes spoilage. Find more tips on getting potatoes ready for the root cellar. The edible part of the potato is the underground tuber, an enlarged storage portion of the potato plant. Once the plants are 6 to 8 inches tall or around 5 to 7 weeks after planting, the tuber develops from underground stems called stolons.\n\n### How to Grow Parsnips: Planting, Growing, and Harvesting Guide\n\n\n### How to Grow Sweet Potatoes: Planting Slips & Harvesting Tips\n\n\n### How to Grow Eggplant (Aubergines): Planting, Growing & Harvesting Tips\n\n\n### How to Grow Peas: Complete Guide to Planting, Growing, and Harvesting Peas\n",
  "pestsAndDiseases" : "### Pests/Diseases\nThe most common potato disease is scab, which causes rough, scabby patches on the skin. These can be peeled off along with the skin, so it’s not all bad. But scabby potatoes ain’t half ugly! So avoid scab in the first place by watering to keep the soil consistently moist at the critical time when tubers are developing—basically once the foliage has started to bush out. Adding compost or other organic matter to the soil before planting should help improve water retention, too. It’s also worth seeking out scab-resistant varieties. Potato blight, or late blight, is a little trickier to dodge. It strikes after a period of warm, wet weather, seemingly out of the blue. Blight causes dark patches on the leaves as it takes hold—then it spreads with devastating speed, killing off your entire crop. There are a few blight-resistant varieties, but the choice is very limited. The good news is that early varieties are usually harvested before the blight arrives later in summer. Check regularly, and if you do spot the tell-tale signs of blight, act fast to cut back the foliage before it spreads to the potatoes belowground—then harvest them as soon as possible. Potato Pests and Diseases Pest/Disease Type Symptoms Control/Prevention Aphids Insect Misshapen/yellow leaves; sticky “honeydew” (excrement); sooty, black mold Grow companion plants; knock off with water spray; apply insecticidal soap; put banana or orange peels around plants; wipe leaves with a 1 to 2 percent solution of dish soap (no additives) and water every 2 to 3 days for 2 weeks; add native plants to invite beneficial insects Blight (early) Virus Leaves, beginning with lower ones, develop dark, concentric spots, often with yellow outer ring, and eventually die; tubers/stems also may be affected Destroy infected plants; choose resistant varieties; maintain proper soil fertility; ensure good air circulation; avoid overhead watering; water in morning; disinfect tools; rotate crops Blight (late) Virus Small, greenish gray, water-soaked spots on leaves that enlarge and turn brown, sometimes with yellow halo; white, fuzzy growth on leaf undersides; stems also affected; tubers develop reddish brown dry rot Destroy infected plants; choose resistant varieties and certified, disease-free seed potatoes; ensure good air circulation; avoid overhead watering; remove plant debris; rotate crops Colorado potato beetles Insect Yellow-orange eggs laid in clusters on leaf undersides; larvae and adults chew holes in foliage Handpick; use straw mulch; weed; use row covers; destroy crop residue; rotate crops. In the nymph state, they can be controlled with diatomaceous earth (food grade). If they continue to be a problem, a few sprays of spinosad, an organic pesticide, will get rid of the beetles. Always use products at dawn or dusk to avoid harming beneficial insects. Flea beetles Insect Tiny black beetles that jump when spooked. Numerous tiny holes in leaves; clusters of holes, as if leaf was hit by shotgun Use row covers; mulch heavily; add native plants to invite beneficial insects Leafhoppers Insect White shed skins on leaf undersides (from nymph molting); stippling (many tiny spots) on leaves; “hopperburn” (leaves yellow/brown, curled, or stunted); reduced yield Knock nymphs off leaf undersides with strong spray of water; use row covers; monitor adults with yellow sticky traps; weed; destroy crop residue Potato scab Bacteria Brown, rough, corky spots that can be shallow/raised/sunken Choose resistant varieties and certified disease-free potato seed; maintain soil pH between 5.0 and 5.2; dust seed potatoes with sulfur before planting; use pine needle mulch; keep soil moist after tubers start to form; do not use manure; rotate crops Tomato hornworms Insect Chewed leaves (initially toward top of plant); rapid defoliation; black/green excrement Handpick (leave larvae that have white, rice-like cocoons, which house braconid wasp parasites); till soil in fall and spring; weed; add native plants to invite beneficial insects; grow dill as a trap crop or basil/marigolds as repellents; spray Bacillus thuringiensis (Bt) Whiteflies Insect Sticky “honeydew” (excrement); sooty, black mold; yellow/silver areas on leaves; wilted/stunted plants; distortion; adults fly if disturbed; some species transmit viruses Remove infested leaves/plants; use handheld vacuum to remove pests; spray water on leaf undersides in morning/evening to knock off pests; monitor adults with yellow sticky traps; spray with insecticidal soap; invite beneficial insects and hummingbirds with native plants; weed; use reflective mulch Wireworms Insect Seedlings severed; stunting/wilting; roots eaten; tubers/bulbs bored Trap by digging 2- to 4-inch-deep holes every 3 to 10 feet, fill with mix of germinating beans/corn/peas or potato sections as bait, cover with soil or a board, in 1 week uncover and kill collected wireworms; provide good drainage; remove plant debris; rotate crops FAQ How Long Do Potatoes Take to Grow? The length of time that it takes potatoes to grow to maturity will largely depend on the variety of potato that you are growing. Generally speaking, it takes 90 to 120 days for potatoes to grow. Some varieties, however, like the ‘Yukon Gold’, can be ready to harvest in as little as 70 days. What is a Potato Eye? A potato’s “eyes” can’t see much! These protrusions on the potato are actually the sprouts or buds of new plants. Each potato eye is capable of growing into a new potato plant. The “eyes” of a potato are the sprouts that will grow in a new plant. Photo: Paul Hein How Can I Tell if My Potatoes are Growing? It can be difficult to tell if your potato plant is growing potatoes because, frankly, all the fun is happening underground! When it comes to growing potatoes, patience is key. Within several weeks of planting your potatoes, you should see sprouts emerging from the ground. At this point, the potato plant will begin to form leaves rapidly, and eventually, potato flowers will appear. The flowers on a potato plant are the best indicator that your plant is indeed producing potatoes. How Should I Cut Potatoes for Planting? When planting, you can increase your crop by cutting your larger seed potatoes (make sure that they are at least the size of a golf ball). Use a clean, sharp knife to cut the seed potato, leaving at least two eyes on each section. Some of the bigger seed potatoes can even be cut into three pieces! Then, allow the pieces to “cure” by leaving them in a cool room for several days, forming a scab over the cut end. Curing the seed potatoes will help to prevent root rot. Why Are My Potatoes Green? A potato can turn green when exposed to light (such as under a grocery store’s lighting), especially at certain temperatures. The greening appears as the potato increases its production of harmless chlorophyll (which helps the plant to make food) but also, independently, a natural nerve toxin called solanine, a glycoalkaloid, which serves as the plant’s defense against insects, animals, etc. Usually in the potato, the solanine extends no deeper than about 1/8 inch from the surface. (It is present in all parts of a potato plant, including leaves and stems.) Can I Eat Green Potatoes? According to the Cooperative Extension, if the potato has only small areas of green, then you can use the potato with little risk. But if there is a lot of green, do not eat it. Also, toss it if there is a bitter taste. They also recommend not feeding green potatoes, even after they are trimmed, to children, as they may be more susceptible to solanine. (And do not feed to dogs or other pets.) Cooking will not eliminate the solanine.\n\n### Potato Pests and Diseases\n",
  "rawHtml" : "<!DOCTYPE html>\n<html lang=\"en\" dir=\"ltr\" prefix=\"og: https://ogp.me/ns#\" class=\"h-full bg-background\">\n  <head>\n    <meta charset=\"UTF-8\" />\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n    <meta name=\"p:domain_verify\" content=\"f46e5dfff350743298ae1e5af21e8dd1\"/>\n    <meta name=\"msvalidate.01\" content=\"3B427AB94F44374B431B678687BA15C2\" />\n\n    <meta name=\"apple-mobile-web-app-title\" content=\"Almanac\" />\n    <meta name=\"theme-color\" content=\"#455775\" />\n    <meta name=\"msapplication-navbutton-color\" content=\"#455775\" />\n    <meta name=\"apple-mobile-web-app-status-bar-style\" content=\"#455775\" />\n\n    <title>Planting, Growing, and Harvesting Potatoes | The Old Farmer&#039;s Almanac</title>\n    <meta charset=\"utf-8\" />\n<meta name=\"description\" content=\"Whether you&#039;re a seasoned pro, or a first-time gardener, our how to grow potatoes guide will help you grow your best crop of taters yet. Let’s get digging!\" />\n<link rel=\"canonical\" href=\"https://www.almanac.com/plant/potatoes\" />\n<meta name=\"robots\" content=\"index, follow\" />\n<link rel=\"icon\" href=\"/themes/almanaco/images/favicon.ico\" />\n<link rel=\"mask-icon\" href=\"/themes/almanaco/images/safari-pinned-tab.svg\" />\n<link rel=\"icon\" sizes=\"16x16\" href=\"/themes/almanaco/images/favicon-16x16.png\" />\n<link rel=\"icon\" sizes=\"32x32\" href=\"/themes/almanaco/images/favicon-32x32.png\" />\n<link rel=\"icon\" sizes=\"192x192\" href=\"/themes/almanaco/images/android-chrome-192x192.png\" />\n<link rel=\"apple-touch-icon\" href=\"/themes/almanaco/images/apple-touch-icon-60x60.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"76x76\" href=\"/themes/almanaco/images/apple-touch-icon-76x76.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"120x120\" href=\"/themes/almanaco/images/apple-touch-icon-120x120.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"152x152\" href=\"/themes/almanaco/images/apple-touch-icon-152x152.png\" />\n<meta property=\"og:site_name\" content=\"Almanac.com\" />\n<meta property=\"og:type\" content=\"article\" />\n<meta property=\"og:url\" content=\"https://www.almanac.com/plant/potatoes\" />\n<meta property=\"og:title\" content=\"Planting, Growing, and Harvesting Potatoes\" />\n<meta property=\"og:description\" content=\"Whether you&#039;re a seasoned pro, or a first-time gardener, our how to grow potatoes guide will help you grow your best crop of taters yet. Let’s get digging!\" />\n<meta property=\"og:image\" content=\"https://www.almanac.com/sites/default/files/styles/large/public/image_nodes/potatoes%20eag1e%20GettyImages_0_0.jpg?itok=d6GCdyEF\" />\n<meta property=\"og:image:type\" content=\"image/jpeg\" />\n<meta property=\"og:image:width\" content=\"1205\" />\n<meta property=\"og:image:height\" content=\"800\" />\n<meta property=\"og:image:alt\" content=\"The Old Farmer&#039;s Almanac\" />\n<meta property=\"fb:admins\" content=\"100002198720176,500927460,687947151,1068201072\" />\n<meta property=\"fb:app_id\" content=\"180003315384377\" />\n<meta name=\"twitter:card\" content=\"summary_large_image\" />\n<meta name=\"twitter:title\" content=\"Planting, Growing, and Harvesting Potatoes\" />\n<meta name=\"twitter:site\" content=\"@almanac\" />\n<meta name=\"Generator\" content=\"Drupal 11 (https://www.drupal.org)\" />\n<meta name=\"MobileOptimized\" content=\"width\" />\n<meta name=\"HandheldFriendly\" content=\"true\" />\n<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n<script>var ct_check_js_val = '8898c94f21d3ba0d17f2a06ffca1aa79';var drupal_ac_antibot_cookie_value = 'ca23a11e05e559b3cac9756b0aad182179cd21c898c5ed451f98170264753af2';var ct_use_cookies = 1;var ct_use_alt_cookies = 0;var ct_capture_buffer = 0;</script>\n<script type=\"application/ld+json\">{\n    \"@context\": \"https://schema.org\",\n    \"@graph\": [\n        {\n            \"@type\": \"Article\",\n            \"@id\": \"https://www.almanac.com/plant/potatoes\",\n            \"name\": \"Planting, Growing, and Harvesting Potatoes\",\n            \"headline\": \"Planting, Growing, and Harvesting Potatoes\",\n            \"description\": \"Whether you\\u0027re a seasoned pro, or a first-time gardener, our how to grow potatoes guide will help you grow your best crop of taters yet. Let’s get digging!\",\n            \"datePublished\": \"2025-05-21T11:00:00-0400\",\n            \"dateModified\": \"2025-08-04T14:33:58-0400\",\n            \"isAccessibleForFree\": \"True\",\n            \"author\": {\n                \"@type\": \"Person\",\n                \"@id\": \"https://www.almanac.com/user/170691\",\n                \"name\": \"Catherine Boeckmann\",\n                \"url\": \"https://www.almanac.com/user/170691\"\n            },\n            \"publisher\": {\n                \"@type\": \"NewsMediaOrganization\",\n                \"@id\": \"https://www.almanac.com\",\n                \"name\": \"The Old Farmer\\u0027s Almanac\",\n                \"url\": \"https://www.almanac.com\",\n                \"logo\": {\n                    \"@type\": \"ImageObject\",\n                    \"representativeOfPage\": \"True\",\n                    \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\",\n                    \"width\": \"308\",\n                    \"height\": \"108\"\n                }\n            }\n        },\n        {\n            \"@type\": \"NewsMediaOrganization\",\n            \"additionalType\": \"Organization\",\n            \"@id\": \"https://www.almanac.com/\",\n            \"description\": \"The Old Farmer’s Almanac is your trusted source for long range weather forecasts, moon phases, full moon dates and times, gardening tips, sunrise and sunset times, Best Days, tide charts, home remedies, folklore, and more.\",\n            \"sameAs\": \"https://en.wikipedia.org/wiki/Old_Farmer%27s_Almanac\",\n            \"name\": \"The Old Farmer\\u0027s Almanac\",\n            \"url\": \"https://www.almanac.com/\",\n            \"telephone\": \"1-800-ALMANAC\",\n            \"contactPoint\": {\n                \"@type\": \"ContactPoint\",\n                \"telephone\": \"+1-800-256-2622\",\n                \"email\": \"support@almanac.com\",\n                \"url\": \"https://www.almanac.com/\",\n                \"contactType\": \"customer service\",\n                \"contactOption\": \"TollFree\",\n                \"productSupported\": \"The Old Farmer\\u0027s Almanac\"\n            },\n            \"logo\": {\n                \"@type\": \"ImageObject\",\n                \"representativeOfPage\": \"True\",\n                \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\"\n            }\n        }\n    ]\n}</script>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n    \n\n        \n\n    <link rel=\"preconnect\" href=\"https://fonts.googleapis.com\" crossorigin />\n  <link rel=\"preconnect\" href=\"https://fonts.gstatic.com\" crossorigin />\n  <link rel=\"preload\" as=\"style\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n\n    <link rel=\"modulepreload\" href=\"/themes/almanac/dist/js/scripts.js\">\n\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" media=\"print\" onload=\"this.media='all'\" />\n\n    <noscript>\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n  </noscript>\n\n        <style>\n      body {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n        margin: 0;\n        background-color: #ffffff;\n      }\n      h1, h2, h3, h4, h5 {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n      }\n      a {\n        color: #595974;\n        text-decoration: none;\n      }\n      a:hover {\n        color: #ad2a24;\n      }\n    </style>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n  <script>window.freestar = { config: { enabled_slots: [] } };</script>\n\n    \n\n                                                                                                                  \n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  window.raptivetarget = {\n    tags: [],\n    category: \"\",\n    postType: \"plant\",\n    postId: 90268,\n    special: true\n  };\n\n  if (window.console && window.console.log) {\n    console.log('Raptive targeting configured:', window.raptivetarget);\n  }\n</script>\n\n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  (function(w, d) {\n    // Debug: Log that we're initializing AdThrive in head\n    if (w.console && w.console.log) {\n      w.console.log('Raptive: Initializing AdThrive script in head for path:', w.location.pathname);\n    }\n\n    w.adthrive = w.adthrive || {};\n    w.adthrive.cmd = w.adthrive.cmd || [];\n    w.adthrive.plugin = 'adthrive-ads-manual';\n    w.adthrive.host = 'ads.adthrive.com';\n\n    var s = d.createElement('script');\n    s.async = true;\n    s.setAttribute('referrerpolicy', 'no-referrer-when-downgrade');\n    s.src = 'https://' + w.adthrive.host + '/sites/6810e43f9a254b456fd9027c/ads.min.js?referrer=' + w.encodeURIComponent(w.location.href) + '&cb=' + (Math.floor(Math.random() * 100) + 1);\n\n    // Debug: Log script loading\n    s.onload = function() {\n      if (w.console && w.console.log) {\n        w.console.log('Raptive: AdThrive script loaded successfully');\n      }\n    };\n    s.onerror = function() {\n      if (w.console && w.console.error) {\n        w.console.error('Raptive: Failed to load AdThrive script');\n      }\n    };\n\n    var n = d.getElementsByTagName('script')[0];\n    n.parentNode.insertBefore(s, n);\n  })(window, document);\n</script>\n\n  \n</head>\n<body class=\"page-not-front page-type-content content-type-plant\">\n  <div class=\"region region--page-top\">\n    \n  </div>\n\n    <div class=\"dialog-off-canvas-main-canvas\" data-off-canvas-main-canvas>\n    <header id=\"page--header\" class=\"section--fullwidth\">\n  \n  <div id=\"region--store_banner\">\n  \n\n<div id=\"block-almanac-storesalebanner\" class=\"block block-block-content block-block-content9bb2b53c-bf24-46a9-96e3-8b872395f31e block--block-content9bb2b53c-bf24-46a9-96e3-8b872395f31e flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div class=\"text-align-center\" style=\"background-color:#ad2a24;padding-bottom:5px;padding-top:5px;width:100%;\"><div style=\"display:flex;justify-content:center;\"><a style=\"color:#fff;font-size:18px;\" href=\"https://store.almanac.com/pages/black-friday-cyber-monday?utm_campaign=OFA-Store-BlackFriday&amp;utm_content=top-banner\" target=\"_blank\">Shop Our Black Friday Sale at The Almanac Store →</a></div></div></p>\n      </div>\n      \n      </div>\n      </div>\n\n</div>\n\n\n    <section class=\"region--global-header flex flex-col sm:flex-row justify-between border-t-brick-red border-t-4 mb-8 text-sm px-4 shadow-sm\">\n  <div class=\"social-menu flex justify-center sm:justify-start\">\n\n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n<div class=\"global-menu flex justify-center sm:justify-end\">\n<a\n  href=\"/signup\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Get Almanac&#039;s Daily Updates\n</a>\n<a\n  href=\"/weather/longrange\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Extended Forecasts\n</a>\n<a\n  href=\"/wheretobuy\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Where to Buy\n</a>\n<a\n  href=\"/contact\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Contact Us\n</a>\n\n</div>\n\n</section>\n\n\n    \n\n<nav aria-label=\"Global\" class=\"nav section--container mb-4\">\n  \n    <div class=\"nav--logo\">\n    <a href=\"/\">\n      <span class=\"sr-only\">Almanac</span>\n      <img src=\"/themes/almanac/logo.svg\" alt=\"Almanac Logo\" width=\"309\" height=\"74\" class=\"no-bg\">\n    </a>\n    <a class=\"calendar no-underline\" href=\"/calendar/today\">\n      Sunday, November 2, 2025\n    </a>\n  </div>\n\n    <div class=\"nav--menu\">\n    <div class=\"flex flex-wrap md:justify-start md:flex-nowrap z-50 w-full transition-all duration-300\" data-nav-container>\n  <nav class=\"flex relative max-w-[85rem] w-full mx-auto md:flex md:items-center md:justify-between md:gap-3 py-2 px-4 sm:px-6 lg:px-8 transition-all duration-300\" data-nav>\n\n        <div class=\"nav-logo transition-all duration-300 flex flex-shrink-0\" data-nav-logo>\n      <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n        <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n      </a>\n    </div>\n\n        <div class=\"nav-breadcrumb transition-all duration-300 flex-1 flex justify-center min-w-0 invisible lg:visible\" data-nav-breadcrumb>\n      <nav class=\"breadcrumb\" role=\"navigation\" aria-label=\"Breadcrumb\">\n        <ol class=\"flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse min-w-28\">\n                                                                               <li class=\"inline-flex items-center\">\n                                      <a href=\"/gardening\" class=\"no-underline uppercase font-sans text-xs text-gray-600 hover:text-brick-red\">Gardening</a>\n                                  </li>\n                                                         <li class=\"inline-flex items-center\">\n                                      <span class=\"uppercase font-sans text-xs text-gray-800\">Growing Guides</span>\n                                  </li>\n                                            </ol>\n      </nav>\n    </div>\n\n        <div class=\"flex items-center gap-x-1 flex-shrink-0\">\n            <button type=\"button\" class=\"menu-toggle md:hidden relative size-9 flex justify-center items-center font-medium text-[12px] border border-gray-200 text-gray-800 hover:bg-gray-100 focus:outline-none focus:bg-gray-100 disabled:opacity-50 disabled:pointer-events-none transition-all duration-300\" data-nav-toggle>\n        <svg class=\"menu-open-icon size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <line x1=\"3\" x2=\"21\" y1=\"6\" y2=\"6\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"12\" y2=\"12\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"18\" y2=\"18\"/>\n        </svg>\n        <svg class=\"menu-close-icon hidden size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <path d=\"M18 6 6 18\"/>\n          <path d=\"m6 6 12 12\"/>\n        </svg>\n        <span class=\"sr-only\">Toggle navigation</span>\n      </button>\n      \n            <div class=\"hidden md:flex items-center gap-x-1\">\n                                          <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Gardening\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/gardening\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        All Gardening \n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/planting-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Planting Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/frostdates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Frost Dates\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/growing-guides\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Growing Guides\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/pests-and-diseases\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Pests and Problems\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Calculators and Tools\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://gardenplanner.almanac.com/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Planner\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Weather\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Weather Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/fall-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Forecast 2025\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Thanksgiving Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Winter Forecast 2025-2026\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/longrange\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        60-Day Long-Range Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        5-Day Forecast\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Moon &amp; Sun\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/astronomy\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Astronomy Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/full-moon-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Harvest Moon!\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moon Phase Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/full\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Next Full Moon\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/sun-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Sunrise and Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moonrise &amp; Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        More Astronomy Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/meteor-shower-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Meteor Showers\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/first-day-seasons\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Seasons\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Calendar\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        2025 Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Holidays and Events\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/calendar/tools\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Calendar Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/bestdays/timetable\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Best Days Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/best-fishing-days\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fishing Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/monthly-horoscope-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Horoscope\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Mercury Retrograde Dates\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Food\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/cooking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Find A Recipe\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        When to Harvest\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/cooking/preserving-food\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Canning and Pickling\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Grilling Recipes\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Baking\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Store\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"https://store.almanac.com/garden/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Garden\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Weather\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Moon &amp; Sun\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Calendars\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Food\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                              \n                <div class=\"menu-item relative mt-1\" data-nav-search>\n          <form class=\"menu-item-form\" action=\"/search/site\" method=\"get\">\n            <input\n              name=\"search_api_fulltext\"\n              type=\"text\"\n              class=\"h-10 px-5 pr-10 w-12 md:w-12 transition-all duration-300\"\n              placeholder=\"Search...\"\n            />\n            <button type=\"submit\" class=\"absolute right-0 top-0 fill-black transition-all duration-300\">\n              <svg class=\"h-5 w-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n              </svg>\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n\n        <div id=\"menu-mobile\" class=\"mobile-menu\" data-nav-menu>\n      <div class=\"mobile-menu-content\">\n        <div class=\"mobile-menu-header\">\n          <div class=\"mobile-menu-logo\">\n            <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n              <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n            </a>\n          </div>\n          <button type=\"button\" class=\"mobile-menu-close\" aria-label=\"Close menu\">\n            <svg class=\"size-6\" xmlns=\"http://www.w3.org/2000/svg\" fill=\"none\" viewBox=\"0 0 24 24\" stroke=\"currentColor\">\n              <path stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" d=\"M6 18L18 6M6 6l12 12\" />\n            </svg>\n          </button>\n        </div>\n\n        <nav class=\"mobile-menu-nav\">\n                                                  <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Gardening\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/gardening\" class=\"mobile-menu-link\">\n                      All Gardening \n                    </a>\n                                      <a href=\"/gardening/planting-calendar\" class=\"mobile-menu-link\">\n                      Planting Calendar\n                    </a>\n                                      <a href=\"/gardening/frostdates\" class=\"mobile-menu-link\">\n                      Fall Frost Dates\n                    </a>\n                                      <a href=\"/gardening/growing-guides\" class=\"mobile-menu-link\">\n                      Growing Guides\n                    </a>\n                                      <a href=\"/gardening/pests-and-diseases\" class=\"mobile-menu-link\">\n                      Pests and Problems\n                    </a>\n                                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"mobile-menu-link\">\n                      Garden Calculators and Tools\n                    </a>\n                                      <a href=\"https://gardenplanner.almanac.com/\" class=\"mobile-menu-link\">\n                      Garden Planner\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Weather\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/weather\" class=\"mobile-menu-link\">\n                      Weather Overview\n                    </a>\n                                      <a href=\"/fall-weather-forecast\" class=\"mobile-menu-link\">\n                      Fall Forecast 2025\n                    </a>\n                                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"mobile-menu-link\">\n                      Thanksgiving Forecast\n                    </a>\n                                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"mobile-menu-link\">\n                      Winter Forecast 2025-2026\n                    </a>\n                                      <a href=\"/weather/longrange\" class=\"mobile-menu-link\">\n                      60-Day Long-Range Forecast\n                    </a>\n                                      <a href=\"/weather/forecast\" class=\"mobile-menu-link\">\n                      5-Day Forecast\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Moon &amp; Sun\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/astronomy\" class=\"mobile-menu-link\">\n                      Astronomy Overview\n                    </a>\n                                      <a href=\"/content/full-moon-october\" class=\"mobile-menu-link\">\n                      OCT Harvest Moon!\n                    </a>\n                                      <a href=\"/astronomy/moon/calendar\" class=\"mobile-menu-link\">\n                      Moon Phase Calendar\n                    </a>\n                                      <a href=\"/astronomy/moon/full\" class=\"mobile-menu-link\">\n                      Next Full Moon\n                    </a>\n                                      <a href=\"/astronomy/sun-rise-and-set\" class=\"mobile-menu-link\">\n                      Sunrise and Set Times\n                    </a>\n                                      <a href=\"/astronomy/moon-rise-and-set\" class=\"mobile-menu-link\">\n                      Moonrise &amp; Set Times\n                    </a>\n                                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"mobile-menu-link\">\n                      More Astronomy Calculators\n                    </a>\n                                      <a href=\"/content/meteor-shower-calendar\" class=\"mobile-menu-link\">\n                      Meteor Showers\n                    </a>\n                                      <a href=\"/content/first-day-seasons\" class=\"mobile-menu-link\">\n                      Seasons\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Calendar\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/calendar\" class=\"mobile-menu-link\">\n                      2025 Calendar\n                    </a>\n                                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"mobile-menu-link\">\n                      Holidays and Events\n                    </a>\n                                      <a href=\"/topics/calendar/tools\" class=\"mobile-menu-link\">\n                      Calendar Calculators\n                    </a>\n                                      <a href=\"/bestdays/timetable\" class=\"mobile-menu-link\">\n                      Best Days Calendar\n                    </a>\n                                      <a href=\"/best-fishing-days\" class=\"mobile-menu-link\">\n                      Fishing Calendar\n                    </a>\n                                      <a href=\"/monthly-horoscope-october\" class=\"mobile-menu-link\">\n                      OCT Horoscope\n                    </a>\n                                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"mobile-menu-link\">\n                      Mercury Retrograde Dates\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Food\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/cooking\" class=\"mobile-menu-link\">\n                      Find A Recipe\n                    </a>\n                                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"mobile-menu-link\">\n                      When to Harvest\n                    </a>\n                                      <a href=\"/cooking/preserving-food\" class=\"mobile-menu-link\">\n                      Canning and Pickling\n                    </a>\n                                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"mobile-menu-link\">\n                      Grilling Recipes\n                    </a>\n                                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"mobile-menu-link\">\n                      Baking\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Store\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"https://store.almanac.com/garden/\" class=\"mobile-menu-link\">\n                      Shop Garden\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"mobile-menu-link\">\n                      Shop Weather\n                    </a>\n                                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"mobile-menu-link\">\n                      Shop Moon &amp; Sun\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"mobile-menu-link\">\n                      Shop Calendars\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"mobile-menu-link\">\n                      Shop Food\n                    </a>\n                                  </div>\n              </div>\n                      \n                    <div class=\"mobile-menu-search\">\n            <form class=\"search-form\" action=\"/search/site\" method=\"get\">\n              <input\n                name=\"search_api_fulltext\"\n                type=\"text\"\n                class=\"search-input\"\n                placeholder=\"Search...\"\n              />\n              <button type=\"submit\" class=\"search-button\">\n                <svg class=\"size-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                  <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n                </svg>\n              </button>\n            </form>\n          </div>\n        </nav>\n      </div>\n    </div>\n      </nav>\n</div>\n<!-- Nav spacer to prevent layout shift when sticky nav appears -->\n<div class=\"nav-spacer\" aria-hidden=\"true\" style=\"height:0;\"></div>\n\n  </div>\n\n</nav>\n\n\n  </header>\n\n<main id=\"content\" class=\"section--container\">\n    <div>\n    \n\n<div id=\"block-almanac-breadcrumbs\" class=\"block block-system block-system-breadcrumb-block block--system-breadcrumb-block flex flex-col w-full\">\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n          <nav role=\"navigation\" aria-labelledby=\"system-breadcrumb\">\n    <h2 id=\"system-breadcrumb\" class=\"visually-hidden\">Breadcrumb</h2>\n    <ol>\n          <li>\n                  <a href=\"/\">Home</a>\n              </li>\n          <li>\n                  <a href=\"/gardening\">Gardening</a>\n              </li>\n          <li>\n                  <a href=\"/gardening/growing-guides\">Growing Guides</a>\n              </li>\n        </ol>\n  </nav>\n\n      </div>\n      </div>\n\n  </div>\n\n  \n\n  <section class=\"layout layout--onecol\">\n    \n      <div>\n    \n\n<div id=\"block-almanac-page-title\" class=\"block block-core block-page-title-block block--page-title-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n<h1 class=\"page-title\">      <span class=\"field field--name-title field--type-string field--label-hidden\">Planting, Growing, and Harvesting Potatoes</span>\n  </h1>\n\n      </div>\n      </div>\n\n\n<div id=\"block-almanac-content\" class=\"block block-system block-system-main-block block--system-main-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n\n<article data-history-node-id=\"90268\" class=\"node node--type-plant node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: true\n    Is front: false\n    View mode: full\n    Node type: plant\n    Node ID: 90268\n    Current path: /plant/potatoes\n    -->\n\n                  \n                    \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n      <div class=\"layout layout--twocol-section layout--twocol-section--75-25 plant-info\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-imageprimary block--field-blocknodeplantfield-imageprimary flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-imageprimary field--type-entity-reference field--label-hidden field__item\">\n\n\n\n<article data-history-node-id=\"188880\" class=\"node node--type-image node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: full\n    Node type: image\n    Node ID: 188880\n    Current path: /plant/potatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/or/public/image_nodes/potatoes%20eag1e%20GettyImages_0_0.jpg?itok=2f0aclaC\" width=\"1186\" height=\"667\" alt=\"hands holding dirty potatoes after they have been dug from the garden\" class=\"image-style-or\" />\n\n\n</div>\n          </div>\n  \n  <div class=\"field field--name-field-credit field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Photo Credit</div>\n              <div class=\"field__item\">Eag1e/Getty</div>\n          </div>\n\n  </div>\n\n  </article>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"botanical-name block block-layout-builder block-field-blocknodeplantfield-botanicalname block--field-blocknodeplantfield-botanicalname flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-botanicalname field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Botanical Name</div>\n              <div class=\"field__item\">Solanum tuberosum</div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-plant-type-term block--field-blocknodeplantfield-plant-type-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-plant-type-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Plant Type</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/type/vegetables\" hreflang=\"en\">Vegetables</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-sun-exposure-term block--field-blocknodeplantfield-sun-exposure-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-sun-exposure-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Sun Exposure</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/sun/full-sun\" hreflang=\"en\">Full Sun</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-soil-ph-term block--field-blocknodeplantfield-soil-ph-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-soil-ph-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Soil pH</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/ph/acidic\" hreflang=\"en\">Acidic</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-subhead block--field-blocknodeplantfield-subhead flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-subhead field--type-string field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Subhead</div>\n              <div class=\"field__item\"><h2>Dig into the basics of planting, growing, and storing potatoes</h2>\n</div>\n          </div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33\">\n\n          <div  class=\"layout__region layout__region--first\">\n        <div class=\"author-line-block\">\n        <div class=\"author-line\">\n      <span class=\"author-label\">Written By:</span>\n      <span class=\"author-name\"><a href=\"/author/catherine-boeckmann\" hreflang=\"en\">Catherine Boeckmann</a></span>\n                                <span class=\"author-title\">Executive Digital Editor and Master Gardener</span>\n                  </div>\n  \n    </div>\n\n\n<div class=\"date_line block block-layout-builder block-field-blocknodeplantchanged block--field-blocknodeplantchanged flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-changed field--type-changed field--label-hidden field__item\"><time datetime=\"2025-08-04T14:33:58-04:00\" class=\"datetime\">August 4, 2025</time>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-almanac-share block-almanac-share-block block--almanac-share-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n<div class=\"mt-8 pt-6\">\n  \n    <div class=\"share-component\"\n       data-share-title=\"Planting, Growing, and Harvesting Potatoes\"\n       data-share-text=\"Check out this great content from The Old Farmer&#039;s Almanac!\"\n       data-share-url=\"https://www.almanac.com/plant/potatoes\"\n       data-share-hashtags=\"almanac\"\n       data-share-via=\"oldfarmersalmanac\"\n       data-print-service=\"printfriendly\">\n\n    <div class=\"share-component--buttons\">\n            <div class=\"share-toggle-container\">\n                <button type=\"button\" class=\"share-toggle\" aria-label=\"Share this content\">\n          <svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 24 24\" fill=\"currentColor\">\n            <path d=\"M18 16.08c-.76 0-1.44.3-1.96.77L8.91 12.7c.05-.23.09-.46.09-.7s-.04-.47-.09-.7l7.05-4.11c.54.5 1.25.81 2.04.81 1.66 0 3-1.34 3-3s-1.34-3-3-3-3 1.34-3 3c0 .24.04.47.09.7L8.04 9.81C7.5 9.31 6.79 9 6 9c-1.66 0-3 1.34-3 3s1.34 3 3 3c.79 0 1.5-.31 2.04-.81l7.12 4.16c-.05.21-.08.43-.08.65 0 1.61 1.31 2.92 2.92 2.92s2.92-1.31 2.92-2.92-1.31-2.92-2.92-2.92z\"/>\n          </svg>\n          <span>Share</span>\n        </button>\n\n                <div class=\"share-social-buttons\">\n                  </div>\n      </div>\n    </div>\n  </div>\n</div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 content-area\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"newsletter-incontent block block-listrak block-listraksubscribe-block block--listraksubscribe-block flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--listraksubscribe-block font-normal mt-0\">\n      Sign up for daily gardening advice and tips\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n<form class=\"listrak-form-subscribe\" data-drupal-selector=\"listrak-form-subscribe\" action=\"/plant/potatoes\" method=\"post\" id=\"listrak-form-subscribe\" accept-charset=\"UTF-8\">\n  <div class=\"js-form-item form-item js-form-type-email form-item-email js-form-item-email form-no-label\">\n      <label for=\"edit-email\" class=\"visually-hidden js-form-required form-required\">Email Address</label>\n          <input placeholder=\"Enter your email address\" data-drupal-selector=\"edit-email\" type=\"email\" id=\"edit-email\" name=\"email\" value=\"\" size=\"60\" maxlength=\"254\" class=\"form-email required\" required=\"required\" />\n\n        </div>\n  <input data-drupal-selector=\"edit-submit\" type=\"submit\" id=\"edit-submit\" name=\"op\" value=\"Sign Up\" class=\"button button--primary js-form-submit form-submit\" />\n  <input autocomplete=\"off\" data-drupal-selector=\"form-d4rdwhk0lmywb53lsbyxaxbabyev4oyh9n7sxsr3ptg\" type=\"hidden\" name=\"form_build_id\" value=\"form-d4RDWhK0lMyWb53lsbYxAXbAbyEv4Oyh9N7SxSR3Ptg\" />\n  <input data-drupal-selector=\"edit-listrak-form-subscribe\" type=\"hidden\" name=\"form_id\" value=\"listrak_form_subscribe\" />\n\n</form>\n\n\n\n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-2 block--views-blockpost-roll-promotion-block-2 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-body block--field-blocknodeplantfield-body flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-body field--type-text-long field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \n        <p>Potatoes are more than just a side dish—they&#8217;re a gardener’s delight! Growing your own “taters” is a rewarding experience, from planting those little seed potatoes to digging up a bountiful harvest. Whether you&#8217;re a seasoned pro or a first-time gardener, our Potato Growing Guide will help you grow the best crop of potatoes yet. Let’s get&nbsp;digging!</p><div style=\"background-color:#fbedcb;max-width:300px;padding:20px;\"><p style=\"margin-top:0;\"><strong>In This&nbsp;Article</strong></p><div style=\"border-left:2px solid #ad2a24;margin-top:10px;padding-left:15px;\"><p style=\"margin:10px 0;\"><a href=\"#planting\">Planting&nbsp;Potatoes</a></p><p style=\"margin:10px 0;\"><a href=\"#growing\">Growing&nbsp;Potatoes</a></p><p style=\"margin:10px 0;\"><a href=\"#hilling\">Hilling</a></p><p style=\"margin:10px 0;\"><a href=\"#harvesting\">Harvesting</a></p><p style=\"margin:10px 0;\"><a href=\"#storing\">Storing</a></p><p style=\"margin:10px 0;\"><a href=\"#pests\">Pests and&nbsp;Diseases</a></p><p style=\"margin:10px 0;\"><a href=\"#faq\"><span class=\"caps\">FAQ</span></a></p></div></div><h2>About&nbsp;Potatoes</h2><p>The potato (<em>Solanum tuberosum</em>)&nbsp;is a cool-weather vegetable that typically yields bigger crops in the northern portion of the United States; however, they can be grown as a winter crop in warmer climates.&nbsp;Potatoes are related to peppers, tomatoes, and eggplants but are adapted to higher elevations and harsher growing conditions; the Incas in Peru first documented them. According to <a href=\"https://www.montana.edu/extension/pspp/funspudfacts.html\" target=\"_blank\">Montana State University</a>, this vegetable arrived in the American Colonies in 1621 when the Governor of Bermuda sent potatoes to the Governor of Virginia at&nbsp;Jamestown.</p>\n      </div>\n      \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-2 block--views-blockmore-like-this-block-2 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-2 font-normal mt-0\">\n      Read Next\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-83134a4c6fa56c19ec3be97d2e641d08dd27eb5295000e233e44638df61b0d51\">\n  \n  \n  \n\n  \n  \n  \n\n  <div class=\"item-list\">\n  \n  <ul>\n\n          <li><div class=\"views-field views-field-title\"><a href=\"/plant/parsnips\" hreflang=\"und\">How to Grow Parsnips: Planting, Growing, and Harvesting Guide</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/plant/sweet-potatoes\" hreflang=\"und\">How to Grow Sweet Potatoes: Planting Slips &amp; Harvesting Tips</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/plant/eggplants\" hreflang=\"und\">How to Grow Eggplant (Aubergines): Planting, Growing &amp; Harvesting Tips</a></div></li>\n    \n  </ul>\n\n</div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-planting block--field-blocknodeplantfield-planting flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-planting field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Planting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                \n        <h3 id=\"planting\">When to Plant&nbsp;Potatoes</h3><p>Garden potatoes can be planted 2 to 4 weeks before the <a href=\"https://www.almanac.com/gardening/frostdates\">average last frost date</a>. The soil temperature should be at least 55°F during the day and 45°F at night. However, pay more attention to the soil than the calendar to determine planting time.&nbsp;The soil should not be so wet that it sticks together and is hard to work. Let it dry out a bit first.&nbsp;If you have a late and wet spring, you can plant later, through April (depending on location) or even June, especially in&nbsp;containers.&nbsp;</p><p>In cooler regions, the early-maturing potatoes are usually planted early to mid-April. In warmer regions, planting times range from September to February; in central Florida, gardeners plant potatoes in January; in Georgia, they plant in&nbsp;February.</p><p><a href=\"https://www.almanac.com/gardening/planting-calendar\">See our Planting Guide for the best dates to plant by zip code or postal code</a>.</p><p><a href=\"https://gardenplanner.almanac.com/\"><img src=\"/sites/default/files/users/Almanac%20Staff/growveg_potatoes.jpeg\" alt=\"Spacing for Potatoes\" width=\"720\" height=\"238\" loading=\"lazy\"></a></p><h3>How to Plant&nbsp;Potatoes</h3><p>Potatoes for planting are called seed potatoes and are usually sold in bags or netting. Use certified (disease-resistant) seed potatoes from which eyes (buds) protrude. Do not confuse seed potatoes with potato seeds or grocery&nbsp;produce.</p><p>When you get them, break them free, lay them out in a tray (such as an old egg carton), and pop them somewhere bright and frost-free to sprout, such as an indoor windowsill. This is a process called <em>chitting</em>. It’s not essential, but chitting helps speed things along so that by the time the potatoes are planted, they’ll be primed and itching to send out&nbsp;roots.&nbsp;</p><p>As the video below shows, after a month of chitting, the potatoes produced stout, stocky, green sprouts, which is exactly what we’re after; we don’t want the long, pale sprouts you get when potatoes are left in the dark. But if you haven’t had a chance to chit your potatoes and it’s already time to plant, don’t worry—get them in the&nbsp;ground.</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/pMH5q-PuIBE\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></p><p>A great way to get more seed potatoes for free is to cut them in half. But only do this if they’ve got plenty of eyes, which appear as small dimples and are where the sprouts emerge from. For this reason, you want to place the end with the most eyes facing&nbsp;upwards.&nbsp;</p><p>At least 2 days before planting, use a clean, sharp paring knife to cut large potatoes into golf ball-size pieces, with one to two eyes each. This time allows the pieces to heal or form a protective layer over the cut surface, improving both moisture retention and rot resistance. Do not cut up seed potatoes that are smaller than a hen’s egg; plant them&nbsp;whole.&nbsp;</p><figure role=\"group\">\n<img alt=\"Man planting potatoes.\" height=\"446\" src=\"/sites/default/files/users/AlmanacStaffArchive/man_planting_potatoes_tanyss_gi_full_width.jpg\" width=\"720\" loading=\"lazy\">\n<figcaption>&nbsp;<em>Preparing seed potatoes for planting.&nbsp;</em><br><em>Photo by tanyss/Getty Images.</em></figcaption>\n</figure>\n<ul><li>You’ll need a location with at least 6 hours of direct sunlight and fertile, loose, well-draining soil; hard or compacted soil leads to misshapen tubers. Ideally, the soil is slightly acidic (pH 5.8 to 6.5), and the soil temperature is at least 45º to 55ºF&nbsp;(7° to 13°C). In the fall, mix compost or organic matter into the soil. Learn more about compost, <a href=\"https://www.almanac.com/blog/gardening/garden-journal/organic-soil-amendments-explained\">soil amendments</a>, and <a href=\"https://www.almanac.com/content/preparing-soil-planting\">preparing the soil for planting</a>.)</li><li>Outside, prepare the planting area by simply spreading compost across the surface to a depth of around an inch or 3 cm. Potatoes are fairly hungry plants, so this extra nourishment will help to support good soil fertility and a strong&nbsp;harvest.&nbsp;</li></ul><h3>4 Methods of Planting&nbsp;Potatoes</h3><p>There are different approaches to planting&nbsp;potatoes:</p><ol><li><strong>Dig Holes:</strong> For each seed potato, dig a hole about 6 inches deep (16 cm). Add in a little slow-release organic fertilizer (e.g., chicken manure pellets) and then pop in the potato with sprouts pointing up and cover with soil. Space potatoes about 16 inches (40 cm) apart in both directions for early types. Main crop potatoes need a bit more space to stretch their legs, so space them at 18 inches (45 cm)&nbsp;apart.</li><li><strong>Dig V-Shaped Trenches:</strong> Dig 2- to 2.5-foot-deep (15- to 190-cm) trenches. Lay a nourishing cushion of garden compost along the bottom and a few of those chicken manure pellets, then set your tubers into position about 1 foot (30 cm) apart. Then, just fill back in. I don’t think it makes a huge difference which way you plant, so do whatever’s easiest in the space you&nbsp;have.</li><li><strong>Plant in Straw:</strong> Nestle seed potatoes down into the soil surface, then cover them with straw. <a href=\"https://www.almanac.com/video/planting-potatoes-straw-no-dig\">See our article on planting potatoes in straw</a>.</li><li><strong>Plant Potatoes in Pots:</strong> If you don’t have the garden space, plant in large containers, old compost sacks, <a href=\"https://www.almanac.com/how-grow-potatoes-trash-can\">trash cans</a>, or purpose-made potato sacks. Fill the bottom of your pot or sack with about 4 inches (10 cm) of potting mix, then lay one or two potatoes on top and cover. Once the foliage is growing, add in more potting mix, a bit at a time, to hill or earth them up until the soil level reaches the top, at which point the foliage almost seems to explode in size. <a href=\"https://www.almanac.com/growing-potatoes-containers\">See our article about container gardening with potatoes</a>.</li></ol></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-care block--field-blocknodeplantfield-care flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-care field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Growing</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \n        <h3 id=\"growing\">How to Grow&nbsp;Potatoes</h3><p>Firstly, water! This is really important because potatoes are lush and leafy plants, and those tubers take a lot of effort to swell. So if it’s dry, water thoroughly. Maintain even moisture, especially from the time after the flowers bloom. <a href=\"https://extension.usu.edu/yardandgarden/research/potatoes-in-the-garden\" target=\"_blank\">Potatoes need 1 to 2 inches of water a week</a>. Too much water right after planting and not enough as the potatoes begin to form can cause them to become misshapen. Stop watering when the foliage begins to turn yellow and die off.&nbsp;<br><br>If you’re growing potatoes in containers, take extra care to keep your plants really well watered, especially in warmer weather, as this really will make all the difference in achieving a good&nbsp;crop.&nbsp;</p><h3 id=\"hilling\">Hilling&nbsp;Potatoes</h3><p>The potato flavor is improved by depth and darkness. As the potato plants grow above the soil surface, you’ll need to periodically “hill up” or mound up soil and compost around the plant so that only the top&nbsp;leaves stick out of the ground. When growing potatoes, it’s vital not to allow potato spuds to be exposed to sunlight, as this also causes them to&nbsp;turn green and produce solanine, a chemical that gives off a bitter taste and is toxic. Do the hilling in the morning, when plants are at their tallest. (During the heat of the day, plants start drooping.) Just draw up the soil with a hoe every time the stems get to around 6 to 8 inches (15 to 20 cm) tall so that just the very tops are left poking out. Continue doing this in stages until you can no longer draw up any more soil, or the foliage closes over in between the rows.&nbsp;<br><br>If you’re growing your potatoes in a smaller raised bed, it may be easier to simply top up with organic matter around the whole&nbsp;area.</p><figure role=\"group\">\n<img alt=\"potato hills in the garden\" data-entity-type=\"file\" data-entity-uuid=\"e46b0c61-5d57-4b71-9b75-2b53719dd6cd\" height=\"1386\" src=\"https://www.almanac.com/sites/default/files/images/potato%20plants%20Avalon_Studio%20GettyImages.jpg\" width=\"2048\" loading=\"lazy\">\n<figcaption><em>Hilling keeps potatoes from getting sunburned, which can cause them to turn green and produce a bitter, toxic chemical.&nbsp;</em><br><em>Credit: Avalon Studio/Getty.</em></figcaption>\n</figure>\n<h3>Protect Your Potatoes From&nbsp;Frost</h3><p>Potatoes aren’t fussy vegetables, which makes them a fabulous choice for first-time growers. They do well in most soils and almost always produce plenty to hunt for at harvest time. That said, you can do a few things to elevate your&nbsp;crop.</p><p>Late frosts can damage the young foliage—something to watch out for with early starts. Frost-bitten plants usually have enough energy to shake off any damage, but it can set plants back nonetheless. So if a frost is forecast and potatoes stand to get clobbered, do whatever you can to protect them. Cover the area in a few layers of warming fleece or row cover fabric, cover clusters of shoots with pots, or draw up the soil to bury the young&nbsp;shoots.</p><p>Note: In cool growing seasons, potato vines may sport berries. The berries are the fruit. Cut one open and see how it resembles its cousin, the tomato. <strong>Potato&nbsp;berries are poisonous&nbsp;and inedible.</strong> Plus, their seeds will not produce potato plants that resemble the parent. Discard&nbsp;them.</p><p>Practice yearly <a href=\"https://www.almanac.com/crop-rotation-101-tips-vegetable-gardens\">crop rotation</a>&nbsp;with potatoes in order to avoid pests and&nbsp;diseases.</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"plain-text block block-layout-builder block-field-blocknodeplantfield__recommended block--field-blocknodeplantfield__recommended flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field__recommended field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Types</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            \n        <p>Despite the limited options in the grocery store, gardeners know there&#8217;s much more to potatoes than the traditional Idaho white potato. There are over 100 types of potatoes, varying in skin color, flesh color, and size from large to fingerling! Floury types are perfect for roasting or mashing, while firm, waxy potatoes are superb boiled or as salad potatoes. You can learn all about potato varieties in the section&nbsp;below.</p><p>There are three classifications for potatoes based on when you harvest (vs. when you plant). If you harvest for storage, be sure to choose the right&nbsp;type:</p><ol><li><strong>Early-season potatoes: </strong>first to be planted in early spring. Grow quickly (60 to 80 days), ready to harvest by early summer, tender flesh, thinner skin, store up to a few&nbsp;weeks.</li><li><span style=\"box-sizing:border-box;margin:0;padding:0;text-align:left;\"><strong>Mid-season potatoes (aka second early potatoes or “earlies”)</strong>: mature in 80 to 100 days, typically lifted up from the second half of summer, store up to a&nbsp;month.</span></li><li><strong>Late crops:</strong> mature in 100 to 130 days, best for storing, lasting 2 to 3 months in the right conditions; planted in August and harvested in&nbsp;fall.</li></ol><p>Also, decide on the texture and flavor of your potatoes, and how you&#8217;d like to eat&nbsp;them:</p><ul><li><strong>Dry-fleshed, mealy potatoes </strong>are fantastic for baking, frying, and mashing. Russets and long white potatoes are a favorite for mashed potatoes, easily absorbing the butter and sour cream while maintaining that light and fluffy&nbsp;texture.</li><li><strong>Moist, waxy, round potatoes</strong> are great in soups, curries, frittatas, and salads because they don&#8217;t fall apart when cooked. You can pan-fry leftover boiled potatoes. When you mash waxy potatoes, they can become&nbsp;sticky.</li><li><strong>Red-skinned potatoes</strong> are often used for boiling or for potato&nbsp;salads.&nbsp;</li></ul><p>Some popular potato varieties, such as ‘Yukon Gold’, fall somewhere in between truly waxy and&nbsp;mealy.</p><p>There are over 100 potato plant varieties! Go beyond the Idaho potato to explore more exotic and delicious options. <a href=\"https://www.almanac.com/video/choosing-best-potato-varieties-grow\">See our article on choosing the best potato varieties</a>!</p><p><strong>Early&nbsp;Varieties:</strong></p><ul><li><strong>‘Irish Cobbler’</strong>: tan skin, irregular shape (great heirloom potato for delicious mashed&nbsp;potatoes!)</li><li><strong>‘Red Norland&#8217;</strong>: deep red skin, sweet, delicate flavor, great in potato salads or&nbsp;boiled</li><li><strong>‘Mountain Rose&#8217;</strong>: red skin and pink flesh, resistant to some&nbsp;viruses</li></ul><p><strong>Mid-Season&nbsp;Varieties</strong></p><ul><li><strong>‘Yukon Gold’:</strong> popular, tan skin and buttery-yellow flesh, mid to large&nbsp;size</li><li><strong>‘Red Pontiac&#8217;</strong>: red skin, deep eyes (easiest and most adaptable red potato there is to&nbsp;grow)</li><li><strong>‘Viking’</strong>: red skin, very&nbsp;productive</li><li><strong>‘Chieftan’</strong>: red skin, resistant to potato scab, stores&nbsp;well</li></ul><p><strong>Late&nbsp;Varieties</strong></p><ul><li><strong>‘Katahdin&#8217;</strong>: tan skin, resistant to some&nbsp;viruses</li><li><strong>‘Kennebec&#8217;</strong>: tan skin, resistant to some viruses and late&nbsp;blight</li><li><strong>‘Elba’</strong>: tan skin, large round tubers, resistant to blight and potato&nbsp;scab</li><li><a href=\"https://www.almanac.com/blog/gardening-blog/plant-easy-grow-early-spring-heirloom-all-blue-potatoes\">All Blue&nbsp;Potatoes</a></li><li><strong>‘Fingerling Salad&#8217;</strong> potatoes</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-harvest block--field-blocknodeplantfield-harvest flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-harvest field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Harvesting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n        <p id=\"harvesting\">Harvesting potatoes is fun! It’s like unearthing nature’s treasures. Harvest potatoes on dry days. Dig up gently, being careful not to puncture the tubers. Avoid cutting or bruising potato skin. The soil should not be compacted, so digging should be easy. Potatoes can tolerate light frost, but when the first <em>hard</em> frost is expected, it’s time to get out the shovels and start digging&nbsp;potatoes.</p><p>Harvesting at the right stage keeps tubers from sitting too long—upping the chances of a slug or disease attack, particularly for main crop&nbsp;spuds.</p><p>Earlies are the first to be lifted, usually while the plants are still in flower. Your tubers should be about the size of a hen’s egg or a touch bigger, but it’s up to you how big you want them. Use a fork and work your way in from the edge of the plant, taking care to avoid stabbing into the potatoes themselves. Once you’ve loosened the plants, you can lift them to expose most of the spuds, but be sure to dig around in the soil for any you’ve&nbsp;missed!</p><p>Dig up main crop spuds once the foliage is dying back towards the end of the growing season. I find it easier to cut back the foliage before digging up the potatoes on a dry day. Leave the potatoes on the soil surface for a few hours so the skin can dry off a bit. Don’t leave them there any longer, or they may start to turn&nbsp;green.&nbsp;</p><p><strong>Extra tips for knowing when and how to dig up&nbsp;potatoes:</strong></p><ul><li>Toughen up potatoes for storage before harvest by not watering them much after&nbsp;mid-August.</li><li>Dig up a test hill to see how mature the potatoes are. The skins of mature potatoes are thick and firmly attached to the flesh. If the skins are thin and rub off easily, your potatoes are still too new and should be left in the ground for a few more&nbsp;days.</li><li>If the soil is very wet, let the potatoes air-dry as much as possible before putting them in bags or&nbsp;baskets.</li><li>Small green spots can be trimmed off, but throw the potato out if there is significant&nbsp;greening.</li><li>Only store potatoes that are free of bruises, disease, or damage, as you don’t want problems in storage, and check on stored potatoes every few weeks and remove any that are starting to&nbsp;spoil.</li></ul><h3>How to Cure&nbsp;Potatoes</h3><ul><li>Once they’ve dried off, pack them up into breathable sacks or just sturdy cardboard boxes to store somewhere dark, cool but frost-free (45° to 60°F / 7° to 15°C) for up to 2 weeks. This allows the potato skin to cure and thus keep&nbsp;longer.</li><li>Brush off any clinging soil; do not wash the potatoes until ready to eat; washing will shorten their&nbsp;life.</li></ul><h3 id=\"storing\">How to Store&nbsp;Potatoes</h3><p>If you are harvesting potatoes to eat within a few days, storage is not an issue. You can store anywhere.&nbsp;<br><br>To store potatoes for keeping, however, you need <strong>a&nbsp;dark, cool (38° to 40°F) place</strong>; if it’s too warm, potatoes will sprout and be susceptible to disease. Also, it needs to be somewhat <strong>humid; </strong>potatoes are 80% water, so if it’s too dry, potatoes wither and dry&nbsp;out.&nbsp;</p><p>If you happen to have a damp cellar, you’re all set! Otherwise, consider an extra refrigerator set a few degrees higher than normal with tubers in dark-colored plastic bags that are perforated (with many holes cut in the side) for air movement. Avoid all light to prevent greening. Or, consider an unheated entrance, spare room, closet, attic, cabinet, or insulated garage. To elevate humidity, you could place large pans of water in front of the air&nbsp;source.&nbsp;</p><p>Even after harvest, potatoes still use oxygen and give off carbon dioxide, so they must have fresh air and ventilation. Never put potatoes in airtight containers. Use perforated bags, as mentioned above. Do not store potatoes with apples; the fruit’s ethylene gas causes&nbsp;spoilage.</p><p>Find more tips on <a href=\"https://www.almanac.com/getting-potatoes-ready-root-cellar\">getting potatoes ready for the root cellar</a>.&nbsp;</p><figure role=\"group\">\n<img alt=\"Potatoes freshly dug from the garden\" height=\"479\" src=\"/sites/default/files/users/AlmanacStaffArchive/potatoes-harvested_full_width.jpg\" width=\"720\" loading=\"lazy\">\n<figcaption><em>The edible part of the potato is the underground tuber, an enlarged storage portion of the potato plant. Once the&nbsp;plants are 6 to 8 inches tall or around 5 to 7 weeks after planting, the tuber&nbsp;develops from underground stems called stolons.</em></figcaption>\n</figure>\n</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n<div class=\"recommender-title block block-block-content block-block-contente8acfdbd-8aa8-4a11-9e44-f56cad64ee7a gardening-recommendations print-no\">\n  \n      <h2 class=\"block__title category-heading\">Gardening Products</h2>\n    \n\n  <div class=\"block__content\">\n    <div class=\"gardening-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"49397b29-784d-45ad-ba5f-2ca9659c9feb\">\n    <script type=\"text/html\">\n       var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\" style=\"width: 32%\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div></p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-pests block--field-blocknodeplantfield-pests flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-pests field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Pests/Diseases</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            \n        <p><strong>The most common potato disease is scab</strong>, which causes rough, scabby patches on the skin. These can be peeled off along with the skin, so it’s not all bad. But scabby potatoes ain’t half ugly! So avoid scab in the first place by watering to keep the soil consistently moist at the critical time when tubers are developing—basically once the foliage has started to bush out. Adding compost or other organic matter to the soil before planting should help improve water retention, too. It’s also worth seeking out scab-resistant&nbsp;varieties.&nbsp;</p><p><strong>Potato blight, or late blight, is a little trickier to dodge</strong>. It strikes after a period of warm, wet weather, seemingly out of the blue. Blight causes dark patches on the leaves as it takes hold—then it spreads with devastating speed, killing off your entire crop. There are a few blight-resistant varieties, but the choice is very limited. The good news is that early varieties are usually harvested before the blight arrives later in summer. Check regularly, and if you do spot the tell-tale signs of blight, act fast to cut back the foliage before it spreads to the potatoes belowground—then harvest them as soon as&nbsp;possible.</p><div class=\"plant-table\"><h3 class=\"text-align-center\" id=\"pests\">Potato Pests and&nbsp;Diseases</h3><table class=\"table\"><thead><tr><th>Pest/Disease</th><th>Type</th><th>Symptoms</th><th>Control/Prevention</th></tr></thead><tbody><tr><th><a href=\"https://www.almanac.com/pest/aphids\">Aphids</a></th><td>Insect</td><td>Misshapen/yellow leaves; sticky “honeydew” (excrement); sooty, black mold</td><td>Grow companion plants; knock off with water spray; apply insecticidal soap; put banana or orange peels around plants; wipe leaves with a 1 to 2 percent solution of dish soap (no additives) and water every 2 to 3 days for 2 weeks; add native plants to invite beneficial insects</td></tr><tr><th>Blight (early)</th><td>Virus</td><td>Leaves, beginning with lower ones, develop dark, concentric spots, often with yellow outer ring, and eventually die; tubers/stems also may be affected</td><td>Destroy infected plants; choose resistant varieties; maintain proper soil fertility; ensure good air circulation; avoid overhead watering; water in morning; disinfect tools; rotate crops</td></tr><tr><th><a href=\"https://www.almanac.com/pest/late-blight-disease-tomatoes-and-potatoes-plants\">Blight (late)</a></th><td>Virus</td><td>Small, greenish gray, water-soaked spots on leaves that enlarge and turn brown, sometimes with yellow halo; white, fuzzy growth on leaf undersides; stems also affected; tubers develop reddish brown dry rot</td><td>Destroy infected plants; choose resistant varieties and certified, disease-free seed potatoes; ensure good air circulation; avoid overhead watering; remove plant debris; rotate crops</td></tr><tr><th><a href=\"https://www.almanac.com/pest/colorado-potato-beetles\">Colorado potato beetles</a></th><td>Insect</td><td>Yellow-orange eggs laid in clusters on leaf undersides; larvae and adults chew holes in foliage</td><td>Handpick; use straw mulch; weed; use row covers; destroy crop residue; rotate crops.&nbsp;In the nymph state, they can be controlled with <a href=\"https://www.almanac.com/what-diatomaceous-earth\">diatomaceous earth</a> (food grade). If they continue to be a problem, a few sprays of spinosad, an organic pesticide, will get rid of the beetles. Always use products at dawn or dusk to avoid harming beneficial insects.</td></tr><tr><th><a href=\"https://www.almanac.com/pest/flea-beetles\">Flea beetles</a></th><td>Insect</td><td>Tiny black beetles that jump when spooked. Numerous tiny holes in leaves; clusters of holes, as if leaf was hit by shotgun</td><td>Use row covers; mulch heavily; add native plants to invite beneficial insects</td></tr><tr><th><a href=\"https://www.almanac.com/pest/leafhoppers\">Leafhoppers</a></th><td>Insect</td><td>White shed skins on leaf undersides (from nymph molting); stippling (many tiny spots) on leaves; “hopperburn” (leaves yellow/brown, curled, or stunted); reduced yield</td><td>Knock nymphs off leaf undersides with strong spray of water; use row covers; monitor adults with yellow sticky traps; weed; destroy crop residue</td></tr><tr><th><a href=\"https://www.vegetables.cornell.edu/pest-management/disease-factsheets/potato-scab/\" target=\"_blank\">Potato scab</a></th><td>Bacteria</td><td>Brown, rough, corky spots that can be shallow/raised/sunken</td><td>Choose resistant varieties and certified disease-free potato seed; maintain soil pH between 5.0 and 5.2; dust seed potatoes with sulfur before planting; use pine needle mulch; keep soil moist after tubers start to form; do not use manure; rotate crops</td></tr><tr><th><a href=\"https://www.almanac.com/pest/tomato-hornworms\">Tomato hornworms</a></th><td>Insect</td><td>Chewed leaves (initially toward top of plant); rapid defoliation; black/green excrement</td><td>Handpick (leave larvae that have white, rice-like cocoons, which house braconid wasp parasites); till soil in fall and spring; weed; add native plants to invite beneficial insects; grow dill as a trap crop or basil/marigolds as repellents; spray <em>Bacillus thuringiensis </em>(Bt)</td></tr><tr><th><a href=\"https://www.almanac.com/pest/whiteflies\">Whiteflies</a></th><td>Insect</td><td>Sticky “honeydew” (excrement); sooty, black mold; yellow/silver areas on leaves; wilted/stunted plants; distortion; adults fly if disturbed; some species transmit viruses</td><td>Remove infested leaves/plants; use handheld vacuum to remove pests; spray water on leaf undersides in morning/evening to knock off pests; monitor adults with yellow sticky traps; spray with insecticidal soap; invite beneficial insects and hummingbirds with native plants; weed; use reflective mulch</td></tr><tr><th>Wireworms</th><td>Insect</td><td>Seedlings severed; stunting/wilting; roots eaten; tubers/bulbs bored</td><td>Trap by digging 2- to 4-inch-deep holes every 3 to 10 feet, fill with mix of germinating beans/corn/peas or potato sections as bait, cover with soil or a board, in 1 week uncover and kill collected wireworms; provide good drainage; remove plant debris; rotate crops</td></tr></tbody></table><h2 class=\"field__label\" id=\"faq\"><span class=\"caps\">FAQ</span></h2><h4>How Long Do Potatoes Take to&nbsp;Grow?</h4><p>The length of time that it takes potatoes to grow to maturity will largely depend on the variety of potato that you are growing. Generally speaking, it takes 90 to 120 days for potatoes to grow. Some varieties, however, like the ‘Yukon Gold’, can be ready to harvest in as little as 70&nbsp;days.</p><h4>What is a Potato&nbsp;Eye?</h4><p>A potato’s “eyes” can’t see much! These protrusions on the potato are actually the sprouts or buds of new plants. Each potato eye is capable of growing into a new potato&nbsp;plant.</p><figure role=\"group\">\n<img alt=\"red potatoes with sprouted potato eyes\" data-entity-type=\"file\" data-entity-uuid=\"57049dd7-b159-4ad7-adaa-488205b1ed27\" height=\"1152\" src=\"https://www.almanac.com/sites/default/files/users/The%20Editors/potato-eye-paul-hein.jpg\" width=\"2048\" loading=\"lazy\">\n<figcaption>The “eyes” of a potato are the sprouts that will grow in a new plant.<br>Photo: Paul Hein</figcaption>\n</figure>\n<h4>How Can I Tell if My Potatoes are&nbsp;Growing?</h4><p>It can be difficult to tell if your potato plant is growing potatoes because, frankly, all the fun is happening underground! When it comes to growing potatoes, patience is key. Within several weeks of planting your potatoes, you should see sprouts emerging from the ground. At this point, the potato plant will begin to form leaves rapidly, and eventually, potato flowers will appear. The flowers on a potato plant are the best indicator that your plant is indeed producing&nbsp;potatoes.</p><h4>How Should I Cut Potatoes for&nbsp;Planting?</h4><p>When planting, you can increase your crop by cutting your larger seed potatoes (make sure that they are at least the size of a golf ball). Use a clean, sharp knife to cut the seed potato, leaving at least two eyes on each section. Some of the bigger seed potatoes can even be cut into three pieces! Then, allow the pieces to “cure” by leaving them in a cool room for several days, forming a scab over the cut end. Curing the seed potatoes will help to prevent root&nbsp;rot.</p><h4>Why Are My Potatoes&nbsp;Green?</h4><p>A potato can turn green when exposed to light (such as under a grocery store’s lighting), especially at certain temperatures. The greening appears as the potato increases its production of harmless chlorophyll (which helps the plant to make food) but also, independently, a natural nerve toxin called solanine, a glycoalkaloid, which serves as the plant’s defense against insects, animals, etc. Usually in the potato, the solanine extends no deeper than about 1/8 inch from the surface. (It is present in all parts of a potato plant, including leaves and&nbsp;stems.)</p><h4>Can I Eat Green&nbsp;Potatoes?</h4><p>According to the <a href=\"https://www.canr.msu.edu/news/is_it_safe_to_eat_a_green_potato\" target=\"_blank\">Cooperative Extension</a>, if the potato has only small areas of green, then you can use the potato with little risk. But if there is a lot of green, do not eat it. Also, toss it if there is a bitter taste. They also recommend not feeding green potatoes, even after they are trimmed, to children, as they may be more susceptible to solanine. (And do not feed to dogs or other pets.) Cooking will not eliminate the&nbsp;solanine.</p></div></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-wit-and-wisdom block--field-blocknodeplantfield-wit-and-wisdom flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-wit-and-wisdom field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Wit and Wisdom</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                  \n        <p><em>What I say is that if a man really likes potatoes, he must be a pretty decent sort of fellow.</em><br>–<span class=\"caps\">A. A.</span> Milne, English writer&nbsp;(1882–1956)</p><p>Folklore offers many “best days” for planting&nbsp;potatoes:</p><ul><li>Old-timers in New England planted their potato crops when they saw dandelions blooming in the open&nbsp;fields.</li><li>The Pennsylvania Dutch considered St. Gertrude’s Day (March 17, aka <a href=\"https://www.almanac.com/content/st-patricks-day\">St. Patrick’s Day</a>) to be their official potato-planting&nbsp;day.</li><li>Many Christian farmers believed that Good Friday&nbsp;was the best day to plant potatoes because the devil holds no power over them at this&nbsp;time.</li></ul><p>Did you know:&nbsp;Potato promoter Antoine Parmentier convinced Marie Antoinette to wear potato blossoms in her&nbsp;hair.</p><p>Grated potatoes are said to <a href=\"https://www.almanac.com/content/natural-remedies-sunburn-treatment\">soothe sunburnt skin</a> as well as <a href=\"https://www.almanac.com/burned-bitten-or-bruised-try-these-surprising-kitchen-cures\">help to remove&nbsp;splinters.</a></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-recipes block--field-blocknodeplantfield-recipes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-recipes field--type-entity-reference field--label-above\">\n    <div class=\"field__label\">Recipes</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/recipe/german-style-potato-salad\" hreflang=\"und\">German-Style Potato Salad</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/scalloped-potatoes\" hreflang=\"und\">Scalloped Potatoes</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/roasted-garlic-mashed-potatoes\" hreflang=\"und\">Roasted Garlic Mashed Potatoes</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/potato-pancakes\" hreflang=\"und\">Potato Pancakes</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/aroostook-potato-and-broccoli-soup\" hreflang=\"und\">Aroostook Potato and Broccoli Soup</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/potato-foil-packs\" hreflang=\"und\">Potato Foil Packs</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/martha-washingtons-potato-rolls\" hreflang=\"und\">Martha Washington&#039;s Potato Rolls</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-cooking-notes block--field-blocknodeplantfield-cooking-notes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-cooking-notes field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Cooking Notes</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                          \n        <p>Potatoes can be prepared in many ways: boiled, mashed, cut into pieces and roasted, french-fried, scalloped, made into dumplings or pancakes, grated into hash browns, and even brewed as&nbsp;alcoholic&nbsp;beverages.</p><p>Most potato dishes are served hot, but some are first cooked, then served cold, notably potato salad and potato&nbsp;chips.</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-topics block--field-blocknodeplantfield-topics flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n      <div class=\"field field--name-field-topics field--type-entity-reference field--label-hidden field__items\">\n              <div class=\"field__item\"><a href=\"/topics/gardening/edible-gardening/vegetables\" hreflang=\"en\">Vegetables</a></div>\n          </div>\n  \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block--author-bio block-views block-views-blockauthor-bio-block-1 block--views-blockauthor-bio-block-1 flex flex-col\">\n  \n      <div class=\"block__title block-title block-title--views-blockauthor-bio-block-1 w-full\">\n      About The Author\n    </div>\n    \n\n            <div class=\"block__content author-bio-content\">\n                <div class=\"author-bio-main\">\n                                                              \n                                            <div class=\"author-picture-wrapper\">\n                  <img src=\"/sites/default/files/pictures/2024-10/IMG_0365.jpeg\" alt=\"Catherine Boeckmann\" class=\"author-picture\">\n                </div>\n              \n                            <div class=\"author-info-section\">\n                                \n                    <h2 class=\"author-name\">Catherine Boeckmann</h2>\n\n                \n                                                  <h3 class=\"author-job-title\">Executive Digital Editor and Master Gardener</h3>\n                \n                                                                                                            <div class=\"author-bio\">Catherine Boeckmann is the Executive Digital Editor of Almanac.com, the website companion of The Old Farmer&#039;s Almanac. She covers gardening, plants, pest control, soil composition, seasonal and moon c...</div>\n                                  \n                                                  <div class=\"author-link-wrapper\">\n                    <a href=\"/author/catherine-boeckmann\" class=\"author-link\">\n                      Read More from Catherine Boeckmann\n                    </a>\n                  </div>\n                \n                                \n                                              </div>\n                              </div>\n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-guides block-guides-toc-block block--guides-toc-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-1 block--views-blockmore-like-this-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-1 font-normal mt-0\">\n      More Like This\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-204673c6a3e3fb6fd502a7c8fdfde03d0507f994336701b34749555fbd121c75\">\n  \n  \n  \n\n  \n  \n  \n\n  \n\n\n<!-- Check if there are multiple rows -->\n  <!-- Multiple rows - wrap each in grid tile -->\n  <div class=\"grid gap-6 auto-rows-auto grid-cols-1 md:grid-cols-3 mb-2\">\n                                        <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/parsnips\">\n\n\n\n<article data-history-node-id=\"188814\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 188814\n    Current path: /plant/potatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/parsnips-MartinaUnbehauen-SS.jpeg?itok=BTUfEuv7\" width=\"650\" height=\"366\" alt=\"clean parsnips on paper\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/parsnips\" hreflang=\"und\">How to Grow Parsnips: Planting, Growing, and Harvesting Guide</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/sweet-potatoes\">\n\n\n\n<article data-history-node-id=\"125253\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 125253\n    Current path: /plant/potatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/sweet-potatoes_ssbonnietaylorbarry.jpg?itok=eHPeroWZ\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/sweet-potatoes\" hreflang=\"und\">How to Grow Sweet Potatoes: Planting Slips &amp; Harvesting Tips</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/eggplants\">\n\n\n\n<article data-history-node-id=\"121741\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 121741\n    Current path: /plant/potatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/eggplant.jpg?itok=IQLZvJFn\" width=\"650\" height=\"366\" alt=\"harvested purple eggplant in a wooden crate\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/eggplants\" hreflang=\"und\">How to Grow Eggplant (Aubergines): Planting, Growing &amp; Harvesting Tips</a></h3></div>\n            </div>\n                                                                <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/content/starting-seeds-indoors\">\n\n\n\n<article data-history-node-id=\"324301\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 324301\n    Current path: /plant/potatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/starting-seeds-featured-2400px2.jpeg?itok=2tsyOooV\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/content/starting-seeds-indoors\" hreflang=\"und\">Starting Seeds Indoors: How and When to Start Seeds </a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/companion-planting-guide-vegetables\">\n\n\n\n<article data-history-node-id=\"130611\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 130611\n    Current path: /plant/potatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/companion%20planting_1350px.jpg?itok=uPJppFMh\" width=\"650\" height=\"366\" alt=\"companion planting guide for the garden. cucumbers, tomatoes, carrots, lettuce, beets, peppers, cabbage, onions, beans, corn\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/companion-planting-guide-vegetables\" hreflang=\"und\">Companion Planting Chart: Tomatoes, Potatoes, and Veggies!</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/peas\">\n\n\n\n<article data-history-node-id=\"121483\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 121483\n    Current path: /plant/potatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/peas-and-pea-pods.jpg?itok=Lhm3si9l\" width=\"650\" height=\"366\" alt=\"loose peas and a pea pod\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/peas\" hreflang=\"und\">How to Grow Peas: Complete Guide to Planting, Growing, and Harvesting Peas</a></h3></div>\n            </div>\n                              </div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-1 block--views-blockpost-roll-promotion-block-1 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 more-like-this print-no\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"views-element-container block block-views block-views-blockcomment-form-block-1 block--views-blockcomment-form-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockcomment-form-block-1 font-normal mt-0\">\n      Comments\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-2259e1307453870e822f695d66f929e74792245d533c9e592bab2a2b4e81669a\">\n  \n  \n  \n\n  \n  \n  \n\n      <div class=\"views-row\"><div class=\"views-field views-field-nid\"><span class=\"field-content\"><a href=\"/comment/reply/node/90268/comment_node_plant\">Add a Comment</a></span></div></div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n\n<div class=\"views-element-container comment-ajax-wrapper\">\n  \n    \n      <div><div class=\"js-view-dom-id-7bc42bdbfc2fa15e4f722bbd21a2ad7de6692b56db68d0d96510227fa9dcd143\">\n  \n  \n  \n\n  \n  \n  \n\n  <div data-drupal-views-infinite-scroll-content-wrapper class=\"views-infinite-scroll-content-wrapper clearfix\">    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"138456\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Robert Anderson&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sat, 08/09/2025 - 10:58</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"138456\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I thought the planting depth of 2 to 2-1/2 feet was excessive.  Then I did a metric conversion and see that 190 cm is over 6 feet deep.  Sure gave me a chuckle.  I think you mean 15 to 19 cm or 6 to 8 inches. \n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-138456\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"136890\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Ollie Kovaluk&lt;/span&gt;</span>\n        <span class=\"comment-time\">Mon, 02/17/2025 - 09:15</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"136890\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Love Farmers Almanac……my parents always used the Farmers Almanac since 1940s.\r\n\r\nHow do I get rid of potato scabs?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-136890\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"136895\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Tue, 02/18/2025 - 09:03</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"136895\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Hi, Ollie. There are several things you can do: choose resistant varieties (such as 'Chieftan' and 'Elba'); try to maintain soil pH between 5.0 and 5.2 (you can decrease soil pH by adding elemental sulfur); dust seed potatoes with sulfur before planting; use pine needle mulch; keep soil moist after tubers start to form; and do not use manure.</p>\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-136895\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"135529\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Harold Van Beke Jr&lt;/span&gt;</span>\n        <span class=\"comment-time\">Tue, 09/03/2024 - 19:53</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"135529\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      This is my first time planting potatoes I planted at the end of apirl there growing very tall and the white flowers are there when do I harvest them \n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-135529\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"135088\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;John Landry&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sat, 07/27/2024 - 08:27</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"135088\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      My potato plants have grown 2 1/2 to 3 feet tall. I placed the potato seeds to close together when planting. It was kind of fun to see them growing and \r\ntaking over my small raised garden beds.  I will harvest middle to end of August. Looking for a useable crop. [ Skill level - 6 ]  Thanks for all the great information. I hope to use the info in the future. [ THANKS ] John\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-135088\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"133631\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Mary Pelcher&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 04/04/2024 - 11:35</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"133631\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I was not able to harvest my potatoes last summer. Will they report in the spring? Or what should I do for a new crop this year? \n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-133631\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"133643\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Fri, 04/05/2024 - 10:24</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"133643\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Hi, Mary. If you live in a place where the ground does not freeze over in the winter, your potatoes likely continued to grow and will now be crowded and small. When you dig them up, check to make sure they are not green and that the skin is still firm.&nbsp;</p>\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-133643\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"132945\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Kk&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sun, 02/04/2024 - 17:01</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"132945\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I have had a problem with scab. But last year, when I dug my potatoes they were beautiful.  I had moved my potatoes to a totally new location.  After storing in the basement, they are now developing a rough skin that doesn’t look like scab.  The potatoes are solid and beginning to sprout,  but when I peel them they have tiny pepper size dots that I cut out.  I plant red Pontiac potatoes.  What is causing this?  The potatoes show no rot or softness.  I do not use manure but do use leaves that are composted.  I would be grateful for any suggestions.  Thank you                            KK\r\n\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-132945\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"132956\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Mon, 02/05/2024 - 10:51</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"132956\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Hi KK,</p><p>That was a great idea to grow your potatoes in a new location to avoid another issue with scab. Sounds like it led to a successful year and harvest.</p><p>Black spots or dots in potatoes can be attributed to internal bruises caused by the movement of your potatoes after harvest or how they are stored together. It could also be the result of sugar concentrations brought on by a number of pre- or post-harvest conditions. You are doing the right thing by removing the areas, but the condition should be generally harmless.</p>\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-132956\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"131554\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Mark Keith&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 10/05/2023 - 16:28</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"131554\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90268\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n       I plant Russets but my potatoes are very small…why?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-131554\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n</div>\n\n    \n<div class=\"comment-pager-wrapper\">\n  <ul class=\"comment-pagination js-pager__items\" data-drupal-views-infinite-scroll-pager>\n        \n              <li class=\"pager__item\">\n        <span class=\"pager-previous disabled button\">« Previous</span>\n      </li>\n    \n        \n              <li class=\"pager__item\">\n                  <span class=\"current-page button\">1</span>\n              </li>\n          <li class=\"pager__item\">\n                  <a href=\"?page=1\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to page 2\">2</a>\n              </li>\n    \n              <li class=\"pager__item\">\n        <span class=\"pager-ellipsis button\">…</span>\n      </li>\n      <li class=\"pager__item\">\n        <a href=\"?page=9\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to last page\">10</a>\n      </li>\n    \n        <li class=\"pager__item\">\n      <a href=\"?page=1\" class=\"use-ajax button js-pager__item pager-next\" data-drupal-views-infinite-scroll-pager-link title=\"Go to next page\" rel=\"next\">Next »</a>\n    </li>\n  </ul>\n</div>\n\n\n  \n  \n\n  \n  \n</div>\n</div>\n\n  </div>\n\n      </div>\n    \n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"store-logo block block-block-content block-block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 block--block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div style=\"align-items:center;background-color:#005336;display:flex;flex-wrap:wrap;gap:20px;justify-content:space-evenly;margin-bottom:20px;margin-top:40px;padding:10px;width:100%;\"><div style=\"color:#fff;\">📣<strong>The Gardening Club Just Got Better!</strong> 3 Deliveries, 10% Store Discount, and more!</div><div><a class=\"text-button\" href=\"https://store.almanac.com/pages/most-popular-club\" target=\"blank\">Learn More</a></div></div><a href=\"https://store.almanac.com/\" target=\"_blank\"><img src=\"https://www.almanac.com/sites/default/files/promotion/old-farmers-almanac-store-logo-1200px.jpg\" data-entity-uuid=\"c84260b7-88a4-4419-a3ff-3e408f8c6c79\" data-entity-type=\"file\" alt=\"The Old Farmer's Almanac Store\" width=\"600\" height=\"77\" align=\"center\" class=\"align-center\" loading=\"lazy\"></a></p>\n      </div>\n      \n      </div>\n      </div>\n<div class=\"content-recommender print-no block block-block-content block-block-contentfdd6ba48-ec8e-4e76-8008-f0a9ba0e596b listrak-recommendations\">\n  \n    \n\n  <div class=\"block__content\">\n    <div class=\"listrak-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"f5f04466-f923-491d-9354-679d54e32def\">\n    <script type=\"text/html\">\n        var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div>           \n</p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n    </div>\n  </div>\n\n  </div>\n\n  </article>\n\n      </div>\n      </div>\n\n  </div>\n\n    \n  </section>\n\n  </main>\n\n<footer id=\"page-footer\">\n    <div class=\"w-full bg-sand newsletter-signup-footer\">\n    <div class=\"max-w-[85rem] mx-auto md:px-20\">\n\n      <div class=\"flex-nowrap w-full md:w-auto pt-8 text-center md:text-left\">\n        <h4 class=\"text-xl md:text-2xl font-normal font-sans leading-tight text-black mb-2\">Get Almanac's Daily Updates</h4>\n      </div>\n\n      <div class=\"flex flex-col md:flex-row items-center justify-between gap-6 pb-8\">\n                <div class=\"text-center md:text-left flex-1\">\n          <p class=\"text-base md:text-lg text-black\">\n            <span class=\"uppercase font-bold\">BONUS</span>: You'll also receive our free <em>Beginner Gardening Guide!</em>\n          </p>\n        </div>\n\n                <div class=\"flex-grow w-full md:w-auto\">\n          <form class=\"flex flex-col sm:flex-row gap-3 md:gap-4 w-full md:w-auto sm:px-4 p-0\" action=\"/\" method=\"post\">\n            <input\n              type=\"email\"\n              name=\"email\"\n              placeholder=\"Enter your email address\"\n              class=\"flex-1 px-3 py-2 md:px-4 md:py-3 text-gray-900 bg-white focus:outline-none focus:ring-2 focus:ring-brick-red placeholder-gray-500\"\n              required\n            >\n            <button\n              type=\"submit\"\n              class=\"px-4 py-2 md:px-6 md:py-3 bg-brick-red text-white font-bold hover:bg-dark-red focus:outline-none focus:ring-2 focus:ring-brick-red transition-colors whitespace-nowrap\"\n            >\n              Go\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n  </div>\n\n    <div class=\"layout layout--page max-w-[85rem] mx-auto\">\n    <div class=\"container mx-auto pb-12\">\n      \n<div class=\"region region--footer-top footer-top-region\">\n  <div class=\"section--container\">\n    <div class=\"grid grid-cols-1 md:grid-cols-3 gap-8\">\n      <nav  id=\"block-almanac-general\" class=\"block block-menu navigation menu--general\" aria-labelledby=\"block-almanac-general-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-general-menu\">Our Brands</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"https://store.almanac.com/\">The Old Farmer’s Almanac Store</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://newengland.com/\">Yankee Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.familytreemagazine.com/\">Family Tree Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhbr.com/\">NH Business Review</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhmagazine.com/\">New Hampshire Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://yankeecustommarketing.com/\">Yankee Custom Marketing</a>\n              </li>\n      </ul>\n\n  </nav>\n<nav  id=\"block-almanac-resources\" class=\"block block-menu navigation menu--resources\" aria-labelledby=\"block-almanac-resources-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-resources-menu\">Resources</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"/about-us\">About Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/contact\">Contact Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/signup\">Free Daily Newsletter</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/webcam\">Webcam</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediakit\">Advertise with Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediaroom\">Media Relations</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/retail\">Sell the Almanac</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/wheretobuy\">Where to Buy</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/terms-of-use/\">Terms of Use</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/privacy-policy\">Privacy Policy</a>\n              </li>\n      </ul>\n\n  </nav>\n<div class=\"social-menu flex\">\n  \n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n\n    </div>\n  </div>\n</div>\n\n\n      <div class=\"social-menu grid grid-cols-5 gap-8\">\n        \n      </div>\n\n      <div class=\"text-sm text-gray-600 flex justify-between mt-24 mb-12\">\n        <div>\n            © 2025 <a href=\"https://ypi.com/\" target=\"_blank\" class=\"inline\">Yankee Publishing Inc.</a>, An Employee-Owned Company.\n        </div>\n        <div>\n          1121 Main Street | P.O. Box 520 | Dublin, NH 03444\n        </div>\n      </div>\n    </div>\n  </div>\n</footer>\n\n  </div>\n\n\n  <div class=\"region region--page-bottom\">\n    \n  </div>\n\n  \n  <script type=\"application/json\" data-drupal-selector=\"drupal-settings-json\">{\"path\":{\"baseUrl\":\"\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/90268\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"eJxNj1uOwzAIRTdklyVZxCERKjYWxq28-0mbpJof4D4-DigFK2bYRReU2H0K1z3gZQtOHR6XwbKSxT5aU_Nf3IwL2ozH3ClmrW4qIQthdZQnYFuyxzYW4RyylkLVYbXRUB6XjMuML6Y32V1Im1qBWzTcuaKz1rDi7GlUZ4EPJ_WwsTgZZGzfwkmbLlrwt2aV1Cn_T1fuWV9kE7TSkQfh7oZPuHbw2XQ33ib8rvAh7PCdj6LrEDqtxHXjyk6p5-N1OSvxduPp_gHbNY0b\",\"theme\":\"almanac\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:7bc42bdbfc2fa15e4f722bbd21a2ad7de6692b56db68d0d96510227fa9dcd143\":{\"view_name\":\"comments_with_ajax_\",\"view_display_id\":\"block_1\",\"view_args\":\"90268\",\"view_path\":\"\\/node\\/90268\",\"view_base_path\":null,\"view_dom_id\":\"7bc42bdbfc2fa15e4f722bbd21a2ad7de6692b56db68d0d96510227fa9dcd143\",\"pager_element\":0}}},\"almanac\":{\"adExclusions\":{\"fullExclude\":[\"\\/retail\",\"\\/mediakit\",\"\\/club\",\"\\/winter\",\"\\/mediaroom\",\"\\/kids\",\"\\/old-farmers-almanac-promotional-images\"],\"videoOnly\":[\"\\/how-to-kill-poison-ivy\",\"\\/wheretobuy\",\"\\/feminized-seeds\",\"\\/autoflower-seeds\",\"\\/how-to-germinate-cannabis-seeds\"]}},\"user\":{\"uid\":0,\"permissionsHash\":\"a870a3cd03311fe2742a98671d86d33235d0ba55333d275d5575e9fd83f56f7e\"}}</script>\n<script src=\"/core/misc/drupalSettingsLoader.js?v=11.2.4\"></script>\n<script src=\"/themes/almanac/dist/js/scripts.js?t4yh8p\"></script>\n<script src=\"/modules/contrib/views_infinite_scroll/js/infinite-scroll.js?v=11.2.4\"></script>\n\n</body>\n</html>\n",
  "scrapedAt" : "2025-11-02T20:43:16.979139Z",
  "successful" : true,
  "errorMessage" : null
}