{
  "slug" : "tomatoes",
  "source" : "Almanac.com",
  "url" : "https://www.almanac.com/plant/tomatoes",
  "commonName" : "How to Grow Tomatoes: Complete Guide to Planting & Harvesting",
  "description" : null,
  "companionSection" : null,
  "plantingGuide" : "### Planting, Growing, and Harvesting Tomatoes\n\n\n### Planting\nSelect a site with full sun! In northern regions, 8 to 10 hours of direct sunlight are preferred. In southern regions, light afternoon shade (natural or applied, e.g., row covers) will help tomatoes to survive and thrive. Dig the soil to about 1 foot deep and mix in aged manure and/or compost. Give it two weeks to break down before planting. Also, choose a space where tomatoes (and members of their family, especially eggplants, peppers, and potatoes) have not grown in the previous couple of years. See tips on crop rotation. When to Plant Tomatoes Tomatoes are long-season, heat-loving plants that won’t tolerate frost, so wait until the weather has warmed up in the spring. See our Planting Calendar for when to start tomatoes in your location. If you are starting tomatoes from seed, sow indoors 6 weeks before the last expected spring frost date in your area. Sow seeds 1/2-inch deep in small trays. Plant seedlings outdoors about 2 weeks after that date or when temperatures stay in the mid-50 degree range both day and night. See our full guide to starting tomato seeds indoors. If you have a long enough growing season, it is also possible to direct-seed tomatoes in the garden soil (1/2-inch deep)—but not before the soil is at least 55°F. Note that 70°F soil is optimum for maximum germination within 5 days. Hardening Off Tomatoes If you’re buying or growing the start plants, you’ll need to “harden off” the seedlings for a week before transplanting them into the ground. Set them outdoors in the shade for a few hours on the first day. Gradually increase this time each day to include some direct sunlight. Learn more about hardening off seedlings. How to Plant Tomatoes Transplant your seedlings (or your nursery-grown plants) into the ground outdoors after all danger of frost has passed and the soil is at least 60°F. See our Planting Calendar for suggested transplanting dates. Place tomato stakes or cages in the soil when planting. Staking and caging keep developing fruit off the ground (to avoid disease and pests) and also help the plant to stay upright. See instructions on how to build stakes, cages, and tomato supports. Optional: When you transplant tomatoes, add a handful of organic tomato fertilizer or bone meal (a good source of phosphorus) to the planting hole. Do NOT apply high-nitrogen fertilizers such as those recommended for lawns, as this will promote luxurious foliage but can delay flowering and fruiting. When planting seedlings, pinch off a few of the lower leaves. Here are two ways to set seedlings in the soil: Place each root ball deep enough so that the bottom leaves are just above the surface of the soil. Roots will grow all along the plant’s stem underground. Plant seedlings 2 to 3 feet apart. Crowded plants will not get sufficient sun, and the fruit may not ripen. Alternatively, lay long, leggy transplants on their sides in trenches 3 to 4 inches deep. Bury the stems up to the first set of true leaves. Roots will develop along the buried stem. If you plant this way, consider setting four tomato plants in compass-point positions (north, south, east, and west). This formation enables you to fertilize and water the plants in the middle. Remember to allow enough space for the plants to spread out. Water well to reduce shock to the roots. Growing Tomatoes in Containers Use a large pot or container (at least 20 inches in diameter) with drainage holes in the bottom. Use loose, well-draining soil (e.g., at least 12 inches of a good “potting mix” with added organic material). A tray of some sort should be placed under the pot to catch any excess water that drains out the bottom. Choose determinate types, such as bush or dwarf varieties. Many cherry tomatoes grow well in pots. Taller varieties may need to be staked. Plant one tomato plant per pot and give each at least 6 hours of sun per day. Keep soil moist. Containers will dry out more quickly than garden soil, so check daily and provide extra water during heat waves. Learn more about how to grow tomatoes in containers.\n\n### When to Plant Tomatoes\nTomatoes are long-season, heat-loving plants that won’t tolerate frost, so wait until the weather has warmed up in the spring. See our Planting Calendar for when to start tomatoes in your location. If you are starting tomatoes from seed, sow indoors 6 weeks before the last expected spring frost date in your area. Sow seeds 1/2-inch deep in small trays. Plant seedlings outdoors about 2 weeks after that date or when temperatures stay in the mid-50 degree range both day and night. See our full guide to starting tomato seeds indoors.\nIf you have a long enough growing season, it is also possible to direct-seed tomatoes in the garden soil (1/2-inch deep)—but not before the soil is at least 55°F. Note that 70°F soil is optimum for maximum germination within 5 days.\n\n### How to Plant Tomatoes\n- Transplant your seedlings (or your nursery-grown plants) into the ground outdoors after all danger of frost has passed and the soil is at least 60°F. See our Planting Calendar for suggested transplanting dates.\n- Place tomato stakes or cages in the soil when planting. Staking and caging keep developing fruit off the ground (to avoid disease and pests) and also help the plant to stay upright. See instructions on how to build stakes, cages, and tomato supports.\n- Optional: When you transplant tomatoes, add a handful of organic tomato fertilizer or bone meal (a good source of phosphorus) to the planting hole. Do NOT apply high-nitrogen fertilizers such as those recommended for lawns, as this will promote luxurious foliage but can delay flowering and fruiting.\n- When planting seedlings, pinch off a few of the lower leaves. Here are two ways to set seedlings in the soil: Place each root ball deep enough so that the bottom leaves are just above the surface of the soil. Roots will grow all along the plant’s stem underground. Plant seedlings 2 to 3 feet apart. Crowded plants will not get sufficient sun, and the fruit may not ripen. Alternatively, lay long, leggy transplants on their sides in trenches 3 to 4 inches deep. Bury the stems up to the first set of true leaves. Roots will develop along the buried stem. If you plant this way, consider setting four tomato plants in compass-point positions (north, south, east, and west). This formation enables you to fertilize and water the plants in the middle.\n- Place each root ball deep enough so that the bottom leaves are just above the surface of the soil. Roots will grow all along the plant’s stem underground. Plant seedlings 2 to 3 feet apart. Crowded plants will not get sufficient sun, and the fruit may not ripen.\n- Alternatively, lay long, leggy transplants on their sides in trenches 3 to 4 inches deep. Bury the stems up to the first set of true leaves. Roots will develop along the buried stem. If you plant this way, consider setting four tomato plants in compass-point positions (north, south, east, and west). This formation enables you to fertilize and water the plants in the middle.\n- Remember to allow enough space for the plants to spread out.\n- Water well to reduce shock to the roots.\n\n### How to Grow Sweet Corn: Planting, Pollination & Harvesting Tips\n\n\n### Understanding When to Plant Vegetables\n\n\n### How to Grow Cucumber Plants: Easy Guide to Planting & Harvesting\n",
  "careInstructions" : "### Planting, Growing, and Harvesting Tomatoes\n\n\n### Growing Tomatoes in Containers\n- Use a large pot or container (at least 20 inches in diameter) with drainage holes in the bottom.\n- Use loose, well-draining soil (e.g., at least 12 inches of a good “potting mix” with added organic material).\n- A tray of some sort should be placed under the pot to catch any excess water that drains out the bottom.\n- Choose determinate types, such as bush or dwarf varieties. Many cherry tomatoes grow well in pots. Taller varieties may need to be staked.\n- Plant one tomato plant per pot and give each at least 6 hours of sun per day.\n- Keep soil moist. Containers will dry out more quickly than garden soil, so check daily and provide extra water during heat waves.\n- Learn more about how to grow tomatoes in containers.\n\n### Growing\nWatering Tomatoes Water in the early morning so that plants have sufficient moisture to make it through a hot day. Water generously the first few days that the tomato seedlings or transplants are in the ground. Then, water with about 2 inches (about 1.2 gallons) per square foot per week during the growing season. Deep watering encourages a strong root system. Avoid overhead watering and afternoon watering. Water at the base/soil level of a plant to avoid splashing water on the leaves (which invites disease). Mulch the plants 5 weeks after transplanting to retain moisture, keep soil from splashing the lower leaves, and control weeds. Apply 2 to 4 inches of organic mulch, such as straw, hay, or bark chips. To help tomatoes through periods of drought, find some flat rocks and place one next to each plant. The rocks prevent water from evaporating from the soil. Fertilizing Tomatoes You should have already worked compost into the soil before planting and added some bonemeal to the planting hole when transplanting. Side-dress plants, applying liquid seaweed or fish emulsion or an organic fertilizer every 2 weeks, starting when tomatoes are about 1 inch in diameter (some folks say golf ball-size). If you are using an organic granular formula such as Espoma Tomato-Tone (4-7-10 or 3-4-6), pull mulch back a few inches and scratch 2 to 3 tablespoons fertilizer around the drip line of the plant. Water in, and replace mulch. Continue fertilizing tomatoes about every 3 to 4 weeks until frost. Note: Avoid fast-release fertilizers and avoid high-nitrogen fertilizers. As stated, too much nitrogen will result in lush foliage but few flowers and little or no fruit. Pruning Tomatoes If growing vining tomatoes, pinch off suckers (new, tiny stems and leaves between branches and the main stem). This aids air circulation and allows more sunlight into the middle of the plant. Gently tie the stems to stakes with rags, nylon stockings, twine, or soft string. As a plant grows, trim the lower leaves from the bottom 12 inches of the stem. Check out this post for even more tomato tips. Photo by Ozgurdonmaz/Getty Images\n\n### Watering Tomatoes\n- Water in the early morning so that plants have sufficient moisture to make it through a hot day.\n- Water generously the first few days that the tomato seedlings or transplants are in the ground.\n- Then, water with about 2 inches (about 1.2 gallons) per square foot per week during the growing season. Deep watering encourages a strong root system.\n- Avoid overhead watering and afternoon watering. Water at the base/soil level of a plant to avoid splashing water on the leaves (which invites disease).\n- Mulch the plants 5 weeks after transplanting to retain moisture, keep soil from splashing the lower leaves, and control weeds. Apply 2 to 4 inches of organic mulch, such as straw, hay, or bark chips.\n- To help tomatoes through periods of drought, find some flat rocks and place one next to each plant. The rocks prevent water from evaporating from the soil.\n\n### Fertilizing Tomatoes\n- You should have already worked compost into the soil before planting and added some bonemeal to the planting hole when transplanting.\n- Side-dress plants, applying liquid seaweed or fish emulsion or an organic fertilizer every 2 weeks, starting when tomatoes are about 1 inch in diameter (some folks say golf ball-size). If you are using an organic granular formula such as Espoma Tomato-Tone (4-7-10 or 3-4-6), pull mulch back a few inches and scratch 2 to 3 tablespoons fertilizer around the drip line of the plant. Water in, and replace mulch.\n- Continue fertilizing tomatoes about every 3 to 4 weeks until frost.\n- Note: Avoid fast-release fertilizers and avoid high-nitrogen fertilizers. As stated, too much nitrogen will result in lush foliage but few flowers and little or no fruit.\n\n### 10 Secrets to Growing Tomatoes (Avoid Pitfalls Now!)\n",
  "harvestInfo" : "### Planting, Growing, and Harvesting Tomatoes\n\n\n### Harvesting\nLeave garden tomatoes on the vine as long as possible. Harvest tomatoes when they are firm and very red, regardless of size, with perhaps some yellow remaining around the stem. Harvest tomatoes of other colors (orange, yellow, purple, or another rainbow shade) when they turn the correct color. If temperatures start to drop and your tomatoes aren’t ripening, use one of these methods: Pull up the entire plant, brush off dirt, remove foliage, and hang the plant upside down in a basement or garage. Place mature, pale green tomatoes, stem up in a paper bag and loosely seal it. Or wrap them in newspaper and place in a cardboard box. Store in a cool (55°F to 70°F), dark place. Cooler temperatures slow ripening; warmth speeds it. Check weekly and remove soft, spotted, diseased, or ripe fruit. Never place tomatoes on a sunny windowsill to ripen. They may rot before they are ripe! Watch this video for tips on how to ripen green tomatoes. You can harvest seeds from some tomato varieties. Learn how here. How to Store Tomatoes Never refrigerate fresh garden tomatoes. Doing so spoils the flavor and texture that give them that garden tomato taste. To freeze, core fresh and unblemished tomatoes and place them whole in freezer bags or containers. Seal, label, and freeze. The skins will slip off when they thaw. See more on properly storing tomatoes and other vegetables.\n\n### How to Grow Sweet Corn: Planting, Pollination & Harvesting Tips\n\n\n### How to Grow Cucumber Plants: Easy Guide to Planting & Harvesting\n",
  "pestsAndDiseases" : "### Pests/Diseases\nTomato Problems If no flowers form, plants may not be getting enough sun or water. Too little of either can stop flowering. If plants are producing abundant flowers but no fruit, it could be due to insufficient light, inadequate watering or irregular watering schedule, extreme temperatures (above 75°F during the night and 90°F during the day), or insufficient pollination by bees. If flowers form but drop off the plant, this is due to high daytime temperatures (over 90°F). Provide shade during the hottest part of the day by using row covers or shade cloth. Low humidity can also affect pollination. The ideal is 40 to 70 percent. If humidity is low, mist the plant to help pollen to stick. Tomato Pests Tomatoes are susceptible to insect pests. To avoid overpopulation of insect pests, follow these basic tips: Monitor tomato plants daily, checking under leaves, checking fruit, and checking near the soil. To dislodge many pests like Aphids, spray plants with a good jet stream from the hose. Handpick bigger insects like Tomato Hornworms with gloves on, dropping them into a bucket of soapy water. Apply insecticidal soap directly to the insect on the plant. This works for smaller pests, such as aphids and spider mites. Apply horticultural oils or sprays diluted in water. Neem oil sprays block an insect’s air holes. If you choose as a last resort to use insecticides like Sevin, keep in mind that you may be killing beneficial insects as well. When it comes to tomato diseases and other problems, most of the work is in prevention. Here are some tips to avoid tomato diseases: Plant disease-resistant tomato varieties. Tomato disease-resistant codes are listed on seed or seedling packets (example: F = Fusarium Wilt). Rotate crops at least every 3 years in the same spot. Avoid planting other members of Solanaceous/nightshade family in the same area as well. This includes potato, pepper, and eggplant. Ensure well-draining soil. Always mix in compost or organic matter. Water consistently! Do not overwater or underwater. Uneven watering may cause a condition called blossom end rot. Destroy infected plants. Unfortunately, you often need to remove and discard infected plants, or the disease will overwinter. Do NOT put them in your compost pile. Solarize the soil. If the problem is really bad, you can treat your soil by covering it with plastic during the hottest part of the summer for 6 to 8 weeks; the sun will destroy the bacteria. Tomato Diseases Blossom-End Rot causes the bottom side of the tomato to develop dark, sunken spots due to a calcium imbalance due to uneven watering. See the link for remedies and prevention. Early Blight is a fungal disease that causes leaves to drop. In July, the risks of blight increase, due to the combination of high humidity and warm days and nights. It starts with dark, concentric spots (brown to black), about 1/2-inch in diameter, on the lower leaves and stems. If you catch it early and destroy infected leaves, your plant may survive. The best defense for outdoor tomatoes is good ventilation and stripping off the lower leaves as the fruits develop. This also helps the ripening process, as tomatoes have maximum exposure to the sun. Late Blight is a fungal disease that causes grey, moldy spots on leaves and fruit, which later turn brown. The disease is spread and supported by persistent damp weather. Unfortunately, once your tomato has late blight, there’s really no solution. See our blog on “Avoid Blight With the Right Tomato.” Mosaic Virus creates distorted leaves and causes young growth to be narrow and twisted, and the leaves become mottled with yellow. Unfortunately, infected plants should be destroyed (but don’t put them in your compost pile). Fusarium Wilt starts with yellowing and wilting on one side of the plant and moves up the plant as the fungus spreads. Unfortunately, once this disease strikes, the plant needs to be destroyed. Powdery Mildew is a fungal disease that leaves white spots or a dusting of white on the leaves. It can be managed. See the link to learn more. Cracking: When fruit growth is too rapid, the skin will crack. This usually occurs due to uneven watering or uneven moisture from weather conditions, such as (very rainy periods mixed with dry periods). Keep moisture levels constant with consistent watering and mulching. See more information about Tomato Diseases and Disorders.\n\n### Tomato Problems\nIf no flowers form, plants may not be getting enough sun or water. Too little of either can stop flowering.\nIf plants are producing abundant flowers but no fruit, it could be due to insufficient light, inadequate watering or irregular watering schedule, extreme temperatures (above 75°F during the night and 90°F during the day), or insufficient pollination by bees.\nIf flowers form but drop off the plant, this is due to high daytime temperatures (over 90°F). Provide shade during the hottest part of the day by using row covers or shade cloth.\nLow humidity can also affect pollination. The ideal is 40 to 70 percent. If humidity is low, mist the plant to help pollen to stick.\n\n### Tomato Pests\nTomatoes are susceptible to insect pests. To avoid overpopulation of insect pests, follow these basic tips:\n- Monitor tomato plants daily, checking under leaves, checking fruit, and checking near the soil.\n- To dislodge many pests like Aphids, spray plants with a good jet stream from the hose.\n- Handpick bigger insects like Tomato Hornworms with gloves on, dropping them into a bucket of soapy water.\n- Apply insecticidal soap directly to the insect on the plant. This works for smaller pests, such as aphids and spider mites.\n- Apply horticultural oils or sprays diluted in water. Neem oil sprays block an insect’s air holes.\n- If you choose as a last resort to use insecticides like Sevin, keep in mind that you may be killing beneficial insects as well.\nWhen it comes to tomato diseases and other problems, most of the work is in prevention. Here are some tips to avoid tomato diseases:\n- Plant disease-resistant tomato varieties. Tomato disease-resistant codes are listed on seed or seedling packets (example: F = Fusarium Wilt).\n- Rotate crops at least every 3 years in the same spot. Avoid planting other members of Solanaceous/nightshade family in the same area as well. This includes potato, pepper, and eggplant.\n- Ensure well-draining soil. Always mix in compost or organic matter.\n- Water consistently! Do not overwater or underwater. Uneven watering may cause a condition called blossom end rot.\n- Destroy infected plants. Unfortunately, you often need to remove and discard infected plants, or the disease will overwinter. Do NOT put them in your compost pile.\n- Solarize the soil. If the problem is really bad, you can treat your soil by covering it with plastic during the hottest part of the summer for 6 to 8 weeks; the sun will destroy the bacteria.\n\n### Tomato Diseases\n- Blossom-End Rot causes the bottom side of the tomato to develop dark, sunken spots due to a calcium imbalance due to uneven watering. See the link for remedies and prevention.\n- Early Blight is a fungal disease that causes leaves to drop. In July, the risks of blight increase, due to the combination of high humidity and warm days and nights. It starts with dark, concentric spots (brown to black), about 1/2-inch in diameter, on the lower leaves and stems. If you catch it early and destroy infected leaves, your plant may survive. The best defense for outdoor tomatoes is good ventilation and stripping off the lower leaves as the fruits develop. This also helps the ripening process, as tomatoes have maximum exposure to the sun.\n- Late Blight is a fungal disease that causes grey, moldy spots on leaves and fruit, which later turn brown. The disease is spread and supported by persistent damp weather. Unfortunately, once your tomato has late blight, there’s really no solution. See our blog on “Avoid Blight With the Right Tomato.”\n- Mosaic Virus creates distorted leaves and causes young growth to be narrow and twisted, and the leaves become mottled with yellow. Unfortunately, infected plants should be destroyed (but don’t put them in your compost pile).\n- Fusarium Wilt starts with yellowing and wilting on one side of the plant and moves up the plant as the fungus spreads. Unfortunately, once this disease strikes, the plant needs to be destroyed.\n- Powdery Mildew is a fungal disease that leaves white spots or a dusting of white on the leaves. It can be managed. See the link to learn more.\n- Cracking: When fruit growth is too rapid, the skin will crack. This usually occurs due to uneven watering or uneven moisture from weather conditions, such as (very rainy periods mixed with dry periods). Keep moisture levels constant with consistent watering and mulching.\nSee more information about Tomato Diseases and Disorders.",
  "rawHtml" : "<!DOCTYPE html>\n<html lang=\"en\" dir=\"ltr\" prefix=\"og: https://ogp.me/ns#\" class=\"h-full bg-background\">\n  <head>\n    <meta charset=\"UTF-8\" />\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n    <meta name=\"p:domain_verify\" content=\"f46e5dfff350743298ae1e5af21e8dd1\"/>\n    <meta name=\"msvalidate.01\" content=\"3B427AB94F44374B431B678687BA15C2\" />\n\n    <meta name=\"apple-mobile-web-app-title\" content=\"Almanac\" />\n    <meta name=\"theme-color\" content=\"#455775\" />\n    <meta name=\"msapplication-navbutton-color\" content=\"#455775\" />\n    <meta name=\"apple-mobile-web-app-status-bar-style\" content=\"#455775\" />\n\n    <title>Growing Tomato Plants: Planting, Growing, and Harvesting Tomatoes Information | The Old Farmer&#039;s Almanac</title>\n    <meta charset=\"utf-8\" />\n<meta name=\"description\" content=\"Learn how to grow tomatoes like a pro! Discover the best time to plant, how to care for tomato plants, and tips for a juicy harvest in your garden.\" />\n<link rel=\"canonical\" href=\"https://www.almanac.com/plant/tomatoes\" />\n<meta name=\"robots\" content=\"index, follow\" />\n<link rel=\"icon\" href=\"/themes/almanaco/images/favicon.ico\" />\n<link rel=\"mask-icon\" href=\"/themes/almanaco/images/safari-pinned-tab.svg\" />\n<link rel=\"icon\" sizes=\"16x16\" href=\"/themes/almanaco/images/favicon-16x16.png\" />\n<link rel=\"icon\" sizes=\"32x32\" href=\"/themes/almanaco/images/favicon-32x32.png\" />\n<link rel=\"icon\" sizes=\"192x192\" href=\"/themes/almanaco/images/android-chrome-192x192.png\" />\n<link rel=\"apple-touch-icon\" href=\"/themes/almanaco/images/apple-touch-icon-60x60.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"76x76\" href=\"/themes/almanaco/images/apple-touch-icon-76x76.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"120x120\" href=\"/themes/almanaco/images/apple-touch-icon-120x120.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"152x152\" href=\"/themes/almanaco/images/apple-touch-icon-152x152.png\" />\n<meta property=\"og:site_name\" content=\"Almanac.com\" />\n<meta property=\"og:type\" content=\"article\" />\n<meta property=\"og:url\" content=\"https://www.almanac.com/plant/tomatoes\" />\n<meta property=\"og:title\" content=\"How to Grow Tomatoes: Complete Guide to Planting &amp; Harvesting\" />\n<meta property=\"og:description\" content=\"Learn how to grow tomatoes like a pro! Discover the best time to plant, how to care for tomato plants, and tips for a juicy harvest in your garden.\" />\n<meta property=\"og:image\" content=\"https://www.almanac.com/sites/default/files/styles/large/public/image_nodes/tomatoes_helios4eos_gettyimages-edit.jpg?itok=8ZQuxZzX\" />\n<meta property=\"og:image:type\" content=\"image/jpeg\" />\n<meta property=\"og:image:width\" content=\"1205\" />\n<meta property=\"og:image:height\" content=\"800\" />\n<meta property=\"og:image:alt\" content=\"The Old Farmer&#039;s Almanac\" />\n<meta property=\"fb:admins\" content=\"100002198720176,500927460,687947151,1068201072\" />\n<meta property=\"fb:app_id\" content=\"180003315384377\" />\n<meta name=\"twitter:card\" content=\"summary_large_image\" />\n<meta name=\"twitter:title\" content=\"How to Grow Tomatoes: Complete Guide to Planting &amp; Harvesting\" />\n<meta name=\"twitter:site\" content=\"@almanac\" />\n<meta name=\"Generator\" content=\"Drupal 11 (https://www.drupal.org)\" />\n<meta name=\"MobileOptimized\" content=\"width\" />\n<meta name=\"HandheldFriendly\" content=\"true\" />\n<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n<script>var ct_check_js_val = '8898c94f21d3ba0d17f2a06ffca1aa79';var drupal_ac_antibot_cookie_value = 'ca23a11e05e559b3cac9756b0aad182179cd21c898c5ed451f98170264753af2';var ct_use_cookies = 1;var ct_use_alt_cookies = 0;var ct_capture_buffer = 0;</script>\n<script type=\"application/ld+json\">{\n    \"@context\": \"https://schema.org\",\n    \"@graph\": [\n        {\n            \"@type\": \"Article\",\n            \"@id\": \"https://www.almanac.com/plant/tomatoes\",\n            \"name\": \"How to Grow Tomatoes: Complete Guide to Planting \\u0026 Harvesting\",\n            \"headline\": \"How to Grow Tomatoes: Complete Guide to Planting \\u0026 Harvesting\",\n            \"description\": \"Learn how to grow tomatoes like a pro! Discover the best time to plant, how to care for tomato plants, and tips for a juicy harvest in your garden.\",\n            \"datePublished\": \"2025-05-14T09:00:00-0400\",\n            \"dateModified\": \"2025-08-01T14:11:10-0400\",\n            \"isAccessibleForFree\": \"True\",\n            \"author\": {\n                \"@type\": \"Person\",\n                \"@id\": \"https://www.almanac.com/user/170691\",\n                \"name\": \"Catherine Boeckmann\",\n                \"url\": \"https://www.almanac.com/user/170691\"\n            },\n            \"publisher\": {\n                \"@type\": \"NewsMediaOrganization\",\n                \"@id\": \"https://www.almanac.com\",\n                \"name\": \"The Old Farmer\\u0027s Almanac\",\n                \"url\": \"https://www.almanac.com\",\n                \"logo\": {\n                    \"@type\": \"ImageObject\",\n                    \"representativeOfPage\": \"True\",\n                    \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\",\n                    \"width\": \"308\",\n                    \"height\": \"108\"\n                }\n            }\n        },\n        {\n            \"@type\": \"NewsMediaOrganization\",\n            \"additionalType\": \"Organization\",\n            \"@id\": \"https://www.almanac.com/\",\n            \"description\": \"The Old Farmer’s Almanac is your trusted source for long range weather forecasts, moon phases, full moon dates and times, gardening tips, sunrise and sunset times, Best Days, tide charts, home remedies, folklore, and more.\",\n            \"sameAs\": \"https://en.wikipedia.org/wiki/Old_Farmer%27s_Almanac\",\n            \"name\": \"The Old Farmer\\u0027s Almanac\",\n            \"url\": \"https://www.almanac.com/\",\n            \"telephone\": \"1-800-ALMANAC\",\n            \"contactPoint\": {\n                \"@type\": \"ContactPoint\",\n                \"telephone\": \"+1-800-256-2622\",\n                \"email\": \"support@almanac.com\",\n                \"url\": \"https://www.almanac.com/\",\n                \"contactType\": \"customer service\",\n                \"contactOption\": \"TollFree\",\n                \"productSupported\": \"The Old Farmer\\u0027s Almanac\"\n            },\n            \"logo\": {\n                \"@type\": \"ImageObject\",\n                \"representativeOfPage\": \"True\",\n                \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\"\n            }\n        }\n    ]\n}</script>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n    \n\n        \n\n    <link rel=\"preconnect\" href=\"https://fonts.googleapis.com\" crossorigin />\n  <link rel=\"preconnect\" href=\"https://fonts.gstatic.com\" crossorigin />\n  <link rel=\"preload\" as=\"style\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n\n    <link rel=\"modulepreload\" href=\"/themes/almanac/dist/js/scripts.js\">\n\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" media=\"print\" onload=\"this.media='all'\" />\n\n    <noscript>\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n  </noscript>\n\n        <style>\n      body {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n        margin: 0;\n        background-color: #ffffff;\n      }\n      h1, h2, h3, h4, h5 {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n      }\n      a {\n        color: #595974;\n        text-decoration: none;\n      }\n      a:hover {\n        color: #ad2a24;\n      }\n    </style>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n  <script>window.freestar = { config: { enabled_slots: [] } };</script>\n\n    \n\n                                                                                                                  \n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  window.raptivetarget = {\n    tags: [],\n    category: \"\",\n    postType: \"plant\",\n    postId: 90258,\n    special: true\n  };\n\n  if (window.console && window.console.log) {\n    console.log('Raptive targeting configured:', window.raptivetarget);\n  }\n</script>\n\n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  (function(w, d) {\n    // Debug: Log that we're initializing AdThrive in head\n    if (w.console && w.console.log) {\n      w.console.log('Raptive: Initializing AdThrive script in head for path:', w.location.pathname);\n    }\n\n    w.adthrive = w.adthrive || {};\n    w.adthrive.cmd = w.adthrive.cmd || [];\n    w.adthrive.plugin = 'adthrive-ads-manual';\n    w.adthrive.host = 'ads.adthrive.com';\n\n    var s = d.createElement('script');\n    s.async = true;\n    s.setAttribute('referrerpolicy', 'no-referrer-when-downgrade');\n    s.src = 'https://' + w.adthrive.host + '/sites/6810e43f9a254b456fd9027c/ads.min.js?referrer=' + w.encodeURIComponent(w.location.href) + '&cb=' + (Math.floor(Math.random() * 100) + 1);\n\n    // Debug: Log script loading\n    s.onload = function() {\n      if (w.console && w.console.log) {\n        w.console.log('Raptive: AdThrive script loaded successfully');\n      }\n    };\n    s.onerror = function() {\n      if (w.console && w.console.error) {\n        w.console.error('Raptive: Failed to load AdThrive script');\n      }\n    };\n\n    var n = d.getElementsByTagName('script')[0];\n    n.parentNode.insertBefore(s, n);\n  })(window, document);\n</script>\n\n  \n</head>\n<body class=\"page-not-front page-type-content content-type-plant\">\n  <div class=\"region region--page-top\">\n    \n  </div>\n\n    <div class=\"dialog-off-canvas-main-canvas\" data-off-canvas-main-canvas>\n    <header id=\"page--header\" class=\"section--fullwidth\">\n  \n  \n\n    <section class=\"region--global-header flex flex-col sm:flex-row justify-between border-t-brick-red border-t-4 mb-8 text-sm px-4 shadow-sm\">\n  <div class=\"social-menu flex justify-center sm:justify-start\">\n\n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n<div class=\"global-menu flex justify-center sm:justify-end\">\n<a\n  href=\"/signup\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Get Almanac&#039;s Daily Updates\n</a>\n<a\n  href=\"/weather/longrange\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Extended Forecasts\n</a>\n<a\n  href=\"/wheretobuy\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Where to Buy\n</a>\n<a\n  href=\"/contact\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Contact Us\n</a>\n\n</div>\n\n</section>\n\n\n    \n\n<nav aria-label=\"Global\" class=\"nav section--container mb-4\">\n  \n    <div class=\"nav--logo\">\n    <a href=\"/\">\n      <span class=\"sr-only\">Almanac</span>\n      <img src=\"/themes/almanac/logo.svg\" alt=\"Almanac Logo\" width=\"309\" height=\"74\" class=\"no-bg\">\n    </a>\n    <a class=\"calendar no-underline\" href=\"/calendar/today\">\n      Thursday, October 30, 2025\n    </a>\n  </div>\n\n    <div class=\"nav--menu\">\n    <div class=\"flex flex-wrap md:justify-start md:flex-nowrap z-50 w-full transition-all duration-300\" data-nav-container>\n  <nav class=\"flex relative max-w-[85rem] w-full mx-auto md:flex md:items-center md:justify-between md:gap-3 py-2 px-4 sm:px-6 lg:px-8 transition-all duration-300\" data-nav>\n\n        <div class=\"nav-logo transition-all duration-300 flex flex-shrink-0\" data-nav-logo>\n      <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n        <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n      </a>\n    </div>\n\n        <div class=\"nav-breadcrumb transition-all duration-300 flex-1 flex justify-center min-w-0 invisible lg:visible\" data-nav-breadcrumb>\n      <nav class=\"breadcrumb\" role=\"navigation\" aria-label=\"Breadcrumb\">\n        <ol class=\"flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse min-w-28\">\n                                                                               <li class=\"inline-flex items-center\">\n                                      <a href=\"/gardening\" class=\"no-underline uppercase font-sans text-xs text-gray-600 hover:text-brick-red\">Gardening</a>\n                                  </li>\n                                                         <li class=\"inline-flex items-center\">\n                                      <span class=\"uppercase font-sans text-xs text-gray-800\">Growing Guides</span>\n                                  </li>\n                                            </ol>\n      </nav>\n    </div>\n\n        <div class=\"flex items-center gap-x-1 flex-shrink-0\">\n            <button type=\"button\" class=\"menu-toggle md:hidden relative size-9 flex justify-center items-center font-medium text-[12px] border border-gray-200 text-gray-800 hover:bg-gray-100 focus:outline-none focus:bg-gray-100 disabled:opacity-50 disabled:pointer-events-none transition-all duration-300\" data-nav-toggle>\n        <svg class=\"menu-open-icon size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <line x1=\"3\" x2=\"21\" y1=\"6\" y2=\"6\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"12\" y2=\"12\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"18\" y2=\"18\"/>\n        </svg>\n        <svg class=\"menu-close-icon hidden size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <path d=\"M18 6 6 18\"/>\n          <path d=\"m6 6 12 12\"/>\n        </svg>\n        <span class=\"sr-only\">Toggle navigation</span>\n      </button>\n      \n            <div class=\"hidden md:flex items-center gap-x-1\">\n                                          <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Gardening\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/gardening\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        All Gardening \n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/planting-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Planting Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/frostdates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Frost Dates\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/growing-guides\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Growing Guides\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/pests-and-diseases\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Pests and Problems\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Calculators and Tools\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://gardenplanner.almanac.com/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Planner\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Weather\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Weather Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/fall-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Forecast 2025\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Thanksgiving Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Winter Forecast 2025-2026\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/longrange\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        60-Day Long-Range Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        5-Day Forecast\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Moon &amp; Sun\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/astronomy\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Astronomy Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/full-moon-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Harvest Moon!\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moon Phase Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/full\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Next Full Moon\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/sun-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Sunrise and Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moonrise &amp; Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        More Astronomy Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/meteor-shower-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Meteor Showers\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/first-day-seasons\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Seasons\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Calendar\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        2025 Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Holidays and Events\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/calendar/tools\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Calendar Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/bestdays/timetable\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Best Days Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/best-fishing-days\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fishing Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/monthly-horoscope-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Horoscope\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Mercury Retrograde Dates\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Food\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/cooking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Find A Recipe\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        When to Harvest\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/cooking/preserving-food\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Canning and Pickling\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Grilling Recipes\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Baking\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Store\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"https://store.almanac.com/garden/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Garden\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Weather\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Moon &amp; Sun\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Calendars\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Food\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                              \n                <div class=\"menu-item relative mt-1\" data-nav-search>\n          <form class=\"menu-item-form\" action=\"/search/site\" method=\"get\">\n            <input\n              name=\"search_api_fulltext\"\n              type=\"text\"\n              class=\"h-10 px-5 pr-10 w-12 md:w-12 transition-all duration-300\"\n              placeholder=\"Search...\"\n            />\n            <button type=\"submit\" class=\"absolute right-0 top-0 fill-black transition-all duration-300\">\n              <svg class=\"h-5 w-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n              </svg>\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n\n        <div id=\"menu-mobile\" class=\"mobile-menu\" data-nav-menu>\n      <div class=\"mobile-menu-content\">\n        <div class=\"mobile-menu-header\">\n          <div class=\"mobile-menu-logo\">\n            <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n              <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n            </a>\n          </div>\n          <button type=\"button\" class=\"mobile-menu-close\" aria-label=\"Close menu\">\n            <svg class=\"size-6\" xmlns=\"http://www.w3.org/2000/svg\" fill=\"none\" viewBox=\"0 0 24 24\" stroke=\"currentColor\">\n              <path stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" d=\"M6 18L18 6M6 6l12 12\" />\n            </svg>\n          </button>\n        </div>\n\n        <nav class=\"mobile-menu-nav\">\n                                                  <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Gardening\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/gardening\" class=\"mobile-menu-link\">\n                      All Gardening \n                    </a>\n                                      <a href=\"/gardening/planting-calendar\" class=\"mobile-menu-link\">\n                      Planting Calendar\n                    </a>\n                                      <a href=\"/gardening/frostdates\" class=\"mobile-menu-link\">\n                      Fall Frost Dates\n                    </a>\n                                      <a href=\"/gardening/growing-guides\" class=\"mobile-menu-link\">\n                      Growing Guides\n                    </a>\n                                      <a href=\"/gardening/pests-and-diseases\" class=\"mobile-menu-link\">\n                      Pests and Problems\n                    </a>\n                                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"mobile-menu-link\">\n                      Garden Calculators and Tools\n                    </a>\n                                      <a href=\"https://gardenplanner.almanac.com/\" class=\"mobile-menu-link\">\n                      Garden Planner\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Weather\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/weather\" class=\"mobile-menu-link\">\n                      Weather Overview\n                    </a>\n                                      <a href=\"/fall-weather-forecast\" class=\"mobile-menu-link\">\n                      Fall Forecast 2025\n                    </a>\n                                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"mobile-menu-link\">\n                      Thanksgiving Forecast\n                    </a>\n                                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"mobile-menu-link\">\n                      Winter Forecast 2025-2026\n                    </a>\n                                      <a href=\"/weather/longrange\" class=\"mobile-menu-link\">\n                      60-Day Long-Range Forecast\n                    </a>\n                                      <a href=\"/weather/forecast\" class=\"mobile-menu-link\">\n                      5-Day Forecast\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Moon &amp; Sun\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/astronomy\" class=\"mobile-menu-link\">\n                      Astronomy Overview\n                    </a>\n                                      <a href=\"/content/full-moon-october\" class=\"mobile-menu-link\">\n                      OCT Harvest Moon!\n                    </a>\n                                      <a href=\"/astronomy/moon/calendar\" class=\"mobile-menu-link\">\n                      Moon Phase Calendar\n                    </a>\n                                      <a href=\"/astronomy/moon/full\" class=\"mobile-menu-link\">\n                      Next Full Moon\n                    </a>\n                                      <a href=\"/astronomy/sun-rise-and-set\" class=\"mobile-menu-link\">\n                      Sunrise and Set Times\n                    </a>\n                                      <a href=\"/astronomy/moon-rise-and-set\" class=\"mobile-menu-link\">\n                      Moonrise &amp; Set Times\n                    </a>\n                                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"mobile-menu-link\">\n                      More Astronomy Calculators\n                    </a>\n                                      <a href=\"/content/meteor-shower-calendar\" class=\"mobile-menu-link\">\n                      Meteor Showers\n                    </a>\n                                      <a href=\"/content/first-day-seasons\" class=\"mobile-menu-link\">\n                      Seasons\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Calendar\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/calendar\" class=\"mobile-menu-link\">\n                      2025 Calendar\n                    </a>\n                                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"mobile-menu-link\">\n                      Holidays and Events\n                    </a>\n                                      <a href=\"/topics/calendar/tools\" class=\"mobile-menu-link\">\n                      Calendar Calculators\n                    </a>\n                                      <a href=\"/bestdays/timetable\" class=\"mobile-menu-link\">\n                      Best Days Calendar\n                    </a>\n                                      <a href=\"/best-fishing-days\" class=\"mobile-menu-link\">\n                      Fishing Calendar\n                    </a>\n                                      <a href=\"/monthly-horoscope-october\" class=\"mobile-menu-link\">\n                      OCT Horoscope\n                    </a>\n                                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"mobile-menu-link\">\n                      Mercury Retrograde Dates\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Food\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/cooking\" class=\"mobile-menu-link\">\n                      Find A Recipe\n                    </a>\n                                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"mobile-menu-link\">\n                      When to Harvest\n                    </a>\n                                      <a href=\"/cooking/preserving-food\" class=\"mobile-menu-link\">\n                      Canning and Pickling\n                    </a>\n                                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"mobile-menu-link\">\n                      Grilling Recipes\n                    </a>\n                                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"mobile-menu-link\">\n                      Baking\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Store\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"https://store.almanac.com/garden/\" class=\"mobile-menu-link\">\n                      Shop Garden\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"mobile-menu-link\">\n                      Shop Weather\n                    </a>\n                                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"mobile-menu-link\">\n                      Shop Moon &amp; Sun\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"mobile-menu-link\">\n                      Shop Calendars\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"mobile-menu-link\">\n                      Shop Food\n                    </a>\n                                  </div>\n              </div>\n                      \n                    <div class=\"mobile-menu-search\">\n            <form class=\"search-form\" action=\"/search/site\" method=\"get\">\n              <input\n                name=\"search_api_fulltext\"\n                type=\"text\"\n                class=\"search-input\"\n                placeholder=\"Search...\"\n              />\n              <button type=\"submit\" class=\"search-button\">\n                <svg class=\"size-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                  <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n                </svg>\n              </button>\n            </form>\n          </div>\n        </nav>\n      </div>\n    </div>\n      </nav>\n</div>\n<!-- Nav spacer to prevent layout shift when sticky nav appears -->\n<div class=\"nav-spacer\" aria-hidden=\"true\" style=\"height:0;\"></div>\n\n  </div>\n\n</nav>\n\n\n  </header>\n\n<main id=\"content\" class=\"section--container\">\n    <div>\n    \n\n<div id=\"block-almanac-breadcrumbs\" class=\"block block-system block-system-breadcrumb-block block--system-breadcrumb-block flex flex-col w-full\">\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n          <nav role=\"navigation\" aria-labelledby=\"system-breadcrumb\">\n    <h2 id=\"system-breadcrumb\" class=\"visually-hidden\">Breadcrumb</h2>\n    <ol>\n          <li>\n                  <a href=\"/\">Home</a>\n              </li>\n          <li>\n                  <a href=\"/gardening\">Gardening</a>\n              </li>\n          <li>\n                  <a href=\"/gardening/growing-guides\">Growing Guides</a>\n              </li>\n        </ol>\n  </nav>\n\n      </div>\n      </div>\n\n  </div>\n\n  \n\n  <section class=\"layout layout--onecol\">\n    \n      <div>\n    \n\n<div id=\"block-almanac-page-title\" class=\"block block-core block-page-title-block block--page-title-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n<h1 class=\"page-title\">      <span class=\"field field--name-title field--type-string field--label-hidden\">How to Grow Tomatoes: Complete Guide to Planting &amp; Harvesting</span>\n  </h1>\n\n      </div>\n      </div>\n\n\n<div id=\"block-almanac-content\" class=\"block block-system block-system-main-block block--system-main-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n\n<article data-history-node-id=\"90258\" class=\"node node--type-plant node--promoted node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: true\n    Is front: false\n    View mode: full\n    Node type: plant\n    Node ID: 90258\n    Current path: /plant/tomatoes\n    -->\n\n                  \n                    \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n      <div class=\"layout layout--twocol-section layout--twocol-section--75-25 plant-info\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-imageprimary block--field-blocknodeplantfield-imageprimary flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-imageprimary field--type-entity-reference field--label-hidden field__item\">\n\n\n\n<article data-history-node-id=\"127111\" class=\"node node--type-image node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: full\n    Node type: image\n    Node ID: 127111\n    Current path: /plant/tomatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/or/public/image_nodes/tomatoes_helios4eos_gettyimages-edit.jpg?itok=AFHF0CtR\" width=\"1186\" height=\"667\" alt=\"red tomatoes ripening on the vine in the garden\" class=\"image-style-or\" />\n\n\n</div>\n          </div>\n  \n  <div class=\"field field--name-field-credit field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Photo Credit</div>\n              <div class=\"field__item\">Helios4Eos/Getty Images</div>\n          </div>\n\n  </div>\n\n  </article>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"botanical-name block block-layout-builder block-field-blocknodeplantfield-botanicalname block--field-blocknodeplantfield-botanicalname flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-botanicalname field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Botanical Name</div>\n              <div class=\"field__item\">Solanum lycopersicum</div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-plant-type-term block--field-blocknodeplantfield-plant-type-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-plant-type-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Plant Type</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/type/vegetables\" hreflang=\"en\">Vegetables</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-sun-exposure-term block--field-blocknodeplantfield-sun-exposure-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-sun-exposure-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Sun Exposure</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/sun/full-sun\" hreflang=\"en\">Full Sun</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-soil-ph-term block--field-blocknodeplantfield-soil-ph-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-soil-ph-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Soil pH</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/ph/acidic\" hreflang=\"en\">Acidic</a></div>\n          <div class=\"field__item\"><a href=\"/plants/ph/slightly-acidic-neutral\" hreflang=\"en\">Slightly Acidic to Neutral</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-bloom-time-term block--field-blocknodeplantfield-bloom-time-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-bloom-time-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Bloom Time</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/blooms/summer\" hreflang=\"en\">Summer</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-flower-color-term block--field-blocknodeplantfield-flower-color-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-flower-color-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Flower Color</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/color/yellow\" hreflang=\"en\">Yellow</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-subhead block--field-blocknodeplantfield-subhead flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-subhead field--type-string field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Subhead</div>\n              <div class=\"field__item\"><h2>Planting, Growing, and Harvesting Tomatoes</h2>\n</div>\n          </div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33\">\n\n          <div  class=\"layout__region layout__region--first\">\n        <div class=\"author-line-block\">\n        <div class=\"author-line\">\n      <span class=\"author-label\">Written By:</span>\n      <span class=\"author-name\"><a href=\"/author/catherine-boeckmann\" hreflang=\"en\">Catherine Boeckmann</a></span>\n                                <span class=\"author-title\">Executive Digital Editor and Master Gardener</span>\n                  </div>\n  \n    </div>\n\n\n<div class=\"date_line block block-layout-builder block-field-blocknodeplantchanged block--field-blocknodeplantchanged flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-changed field--type-changed field--label-hidden field__item\"><time datetime=\"2025-08-01T14:11:10-04:00\" class=\"datetime\">August 1, 2025</time>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n      </div>\n    \n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"newsletter-incontent block block-listrak block-listraksubscribe-block block--listraksubscribe-block flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--listraksubscribe-block font-normal mt-0\">\n      Sign up for daily gardening advice and tips\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n<form class=\"listrak-form-subscribe\" data-drupal-selector=\"listrak-form-subscribe\" action=\"/plant/tomatoes\" method=\"post\" id=\"listrak-form-subscribe\" accept-charset=\"UTF-8\">\n  <div class=\"js-form-item form-item js-form-type-email form-item-email js-form-item-email form-no-label\">\n      <label for=\"edit-email\" class=\"visually-hidden js-form-required form-required\">Email Address</label>\n          <input placeholder=\"Enter your email address\" data-drupal-selector=\"edit-email\" type=\"email\" id=\"edit-email\" name=\"email\" value=\"\" size=\"60\" maxlength=\"254\" class=\"form-email required\" required=\"required\" />\n\n        </div>\n  <input data-drupal-selector=\"edit-submit\" type=\"submit\" id=\"edit-submit\" name=\"op\" value=\"Sign Up\" class=\"button button--primary js-form-submit form-submit\" />\n  <input autocomplete=\"off\" data-drupal-selector=\"form-m5jhi6a4vlfd2wsqcyxqwnjyb8sjtnyozm1vn9wpgfm\" type=\"hidden\" name=\"form_build_id\" value=\"form-m5jhI6a4vLFd2WsqcYXqWNjYb8sJtnYozM1vN9wpGFM\" />\n  <input data-drupal-selector=\"edit-listrak-form-subscribe\" type=\"hidden\" name=\"form_id\" value=\"listrak_form_subscribe\" />\n\n</form>\n\n\n\n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-2 block--views-blockpost-roll-promotion-block-2 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-body block--field-blocknodeplantfield-body flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-body field--type-text-long field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              \n        <p>Let’s be honest: store-bought tomatoes just can’t compete with the sun-ripened sweetness of one plucked from your own garden. Whether you’re dreaming of salsa, sauce, or that perfect <span class=\"caps\">BLT</span>, growing tomatoes is the garden goal of summer. From tiny seeds to tangy fruits, we’ll walk you through every step to tomato glory. Get ready to dig in, your sandwich will thank&nbsp;you!</p><h2>About Tomato&nbsp;Plants</h2><p><strong>Tomato plants are tender, warm-season crops</strong>&nbsp;that love the sun and cannot bear frost.&nbsp;It&#8217;s important not to put plants in the ground too early. In most regions, the soil is not warm enough to plant tomatoes outdoors until late spring and early summer, except in Zone 10, where they are a fall and winter crop. <a href=\"https://www.almanac.com/gardening/planting-calendar\">See when to start tomatoes for your location</a>.</p><p><a class=\"text-button\" href=\"https://amzn.to/3ECpMrs\" target=\"_blank\" rel=\"nofollow\">Buy Seeds&nbsp;Now</a></p><p><strong>Tomatoes take 60 days to more than 100 days to harvest</strong>, depending on the variety (see more about varieties below).&nbsp;Due to their relatively long growing season requirements (and late planting date), gardeners either 1) plant small starter plants from a reputable nursery or 2) start tomato seeds indoors to get a head start.&nbsp;<br><br>Now, let&#8217;s dig into the complete guide to growing&nbsp;tomatoes!</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Mn22mBl5sDs?si=oQzCu0QAvQoCFMk_\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"></iframe></p>\n      </div>\n      \n      </div>\n      </div>\n\n\n<div class=\"block block-block-content block-block-content33eb2cdc-6c15-47b4-81a6-ec4e221dd038 block--block-content33eb2cdc-6c15-47b4-81a6-ec4e221dd038 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div style=\"margin-top: 20px\"><!-- code from Primis - Trouble Free Tomatoes.mp4 - almanac.com incontent to float -->\n<script type=\"text/javascript\" language=\"javascript\" src=\"https://live.primis.tech/live/liveView.php?s=116233&vp_content=embed506082hpsoyj\"></script>\n<!-- code from Primis -->\n</div>\n</p>\n      </div>\n      \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-2 block--views-blockmore-like-this-block-2 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-2 font-normal mt-0\">\n      Read Next\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-ade905f73848052b1a02937151d5a1e01acb0ff590ca04f36c37da9f712cd87d\">\n  \n  \n  \n\n  \n  \n  \n\n  <div class=\"item-list\">\n  \n  <ul>\n\n          <li><div class=\"views-field views-field-title\"><a href=\"/content/starting-seeds-indoors\" hreflang=\"und\">Starting Seeds Indoors: How and When to Start Seeds </a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/video/growing-tomatoes-choosing-and-starting-best-tomato-varieties\" hreflang=\"und\">Choosing Tomato Varieties for Your Garden</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/10-secrets-growing-tomatoes\" hreflang=\"und\">10 Secrets to Growing Tomatoes (Avoid Pitfalls Now!)</a></div></li>\n    \n  </ul>\n\n</div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-planting block--field-blocknodeplantfield-planting flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-planting field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Planting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                \n        <p>Select a site with full sun! In northern regions,&nbsp;8 to 10 hours of direct sunlight are preferred. In southern regions, light afternoon shade (natural or applied, e.g., row covers) will help tomatoes to survive and thrive. Dig the soil to about 1 foot deep and mix in aged manure and/or compost. Give it two weeks to break down before&nbsp;planting.</p><p>Also, choose a&nbsp;space where tomatoes (and members of their family, especially eggplants, peppers, and potatoes) have not grown in the previous couple of years. See tips on <a href=\"https://www.almanac.com/video/how-rotate-your-vegetable-crops\">crop rotation</a>.</p><h3>When to Plant&nbsp;Tomatoes</h3><p>Tomatoes are long-season, heat-loving plants that won’t tolerate frost, so wait until the weather has warmed up in the spring. See our <a href=\"https://www.almanac.com/gardening/planting-calendar\">Planting Calendar</a> for when to start tomatoes in your location.<br><br>If you are starting tomatoes from seed, sow&nbsp;indoors 6 weeks before the <a href=\"https://www.almanac.com/gardening/frostdates\">last expected spring frost date</a>&nbsp;in your area. Sow seeds 1/2-inch deep in small trays. Plant seedlings outdoors about 2 weeks after that date or when temperatures stay in the mid-50 degree range both day and night.&nbsp;<a href=\"https://www.almanac.com/starting-tomato-seeds-indoors\">See our full guide to starting tomato seeds indoors</a>.</p><p>If you have a long enough growing season, it is also possible to direct-seed tomatoes in the garden soil (1/2-inch deep)—but not before the soil is at least&nbsp;55°F. Note that 70°F soil is optimum for maximum germination within 5&nbsp;days.&nbsp;</p><h3>Hardening Off&nbsp;Tomatoes</h3><p>If you’re buying or growing the start plants, you’ll need to “harden off” the seedlings for a week before transplanting them into the ground. Set them outdoors in the shade for a few hours on the first day. Gradually increase this time each day to include some direct sunlight.&nbsp;<a href=\"https://www.almanac.com/video/how-harden-plants\">Learn more about hardening off seedlings</a>.</p><p><img src=\"/sites/default/files/users/The%20Editors/tomato-seedlings_full_width.jpg\" alt=\"Tomato seedlings\" width=\"720\" height=\"450\" loading=\"lazy\"></p><h3>How to Plant&nbsp;Tomatoes</h3><ul><li>Transplant your seedlings (or your nursery-grown plants) into the ground outdoors after all danger of frost has passed and the soil is at least 60°F. See our <a href=\"https://www.almanac.com/gardening/planting-calendar\">Planting Calendar</a> for suggested transplanting&nbsp;dates.</li><li>Place tomato stakes or cages in the soil when planting. Staking and caging keep developing fruit off the ground (to avoid disease and pests) and also help the plant to stay upright.&nbsp;<a href=\"https://www.almanac.com/video/how-make-tomato-cages-and-tomato-stakes\">See&nbsp;instructions on how to build stakes, cages, and tomato supports</a>.</li><li><strong>Optional: </strong>When you transplant tomatoes, add a handful of organic tomato fertilizer or bone meal (a good source of phosphorus)&nbsp;to the planting hole. Do <span class=\"caps\">NOT</span> apply high-nitrogen fertilizers such as those recommended for lawns, as this will promote luxurious foliage but can delay flowering and&nbsp;fruiting.</li><li>When planting seedlings, pinch off a few of the lower leaves. Here are two ways to set seedlings in the soil:<ol><li>Place each root ball deep enough so that the bottom leaves are just above the surface of the soil. Roots will grow all along the plant’s stem underground. Plant seedlings 2 to 3 feet apart. Crowded plants will not get sufficient sun, and the fruit may not&nbsp;ripen.</li><li>Alternatively, lay long, leggy transplants on their sides in trenches 3 to 4 inches deep. Bury the stems up to the first set of true leaves. Roots will develop along the buried stem. If you plant this way, consider setting four tomato plants in compass-point positions (north, south, east, and west). This formation enables you to fertilize and water the plants in the&nbsp;middle.</li></ol></li><li>Remember to allow enough space for the plants to spread&nbsp;out.</li><li>Water well to reduce shock to the&nbsp;roots.</li></ul><p><a href=\"https://gardenplanner.almanac.com/\"><img src=\"/sites/default/files/users/Almanac%20Staff/growveg_tomatoes.jpeg\" alt=\"Spacing for Tomatoes\" width=\"720\" height=\"238\" loading=\"lazy\"></a></p><h3>Growing Tomatoes in&nbsp;Containers</h3><ul><li>Use a large pot or container (at least 20 inches in diameter) with drainage holes in the&nbsp;bottom.</li><li>Use loose, well-draining soil (e.g., at least 12 inches of a good “potting mix” with added organic&nbsp;material).</li><li>A tray of some sort should be placed under the pot to catch any excess water that drains out the&nbsp;bottom.</li><li>Choose determinate types, such as bush or dwarf varieties. Many cherry tomatoes grow well in pots.&nbsp;Taller varieties may need to be&nbsp;staked.</li><li>Plant one tomato plant per pot and give each at least 6 hours of sun per&nbsp;day.</li><li>Keep soil moist. Containers will dry out more quickly than garden soil, so check daily and provide extra water during heat&nbsp;waves.</li><li>Learn more about<a href=\"https://www.almanac.com/growing-tomatoes-pots\"> how to grow tomatoes in&nbsp;containers.</a></li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-care block--field-blocknodeplantfield-care flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-care field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Growing</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <h3>Watering&nbsp;Tomatoes</h3><ul><li>Water in the early morning so that plants have sufficient moisture to make it through a hot&nbsp;day.</li><li>Water generously the first few days that the tomato seedlings or transplants are in the&nbsp;ground.</li><li>Then, water with about 2 inches (about 1.2 gallons) per square foot per week during the growing season. Deep watering encourages a strong root&nbsp;system.</li><li>Avoid overhead watering and afternoon watering. Water at the base/soil level of a plant to avoid splashing water on the leaves (which invites&nbsp;disease).</li><li><a href=\"https://www.almanac.com/types-mulch-advantages-and-disadvantages-mulching\">Mulch </a>the plants 5 weeks after transplanting to retain moisture, keep soil from splashing the lower leaves, and control weeds.&nbsp;Apply 2 to 4 inches of organic mulch, such as straw, hay, or bark&nbsp;chips.</li><li>To help tomatoes through periods of drought, find some flat rocks and place one next to each plant. The rocks prevent water from evaporating from the&nbsp;soil.</li></ul><h3>Fertilizing&nbsp;Tomatoes</h3><ul><li>You should have already worked compost into the soil before planting and added some bonemeal to the planting hole when&nbsp;transplanting.</li><li>Side-dress plants, applying liquid seaweed or fish emulsion or an <a href=\"https://amzn.to/3EU0zZC\" target=\"_blank\">organic fertilizer</a> every 2 weeks, starting when tomatoes are about 1 inch in diameter (some folks say golf ball-size). If you are using an organic granular formula such as Espoma Tomato-Tone (4-7-10 or 3-4-6), pull mulch back a few inches and scratch 2 to 3 tablespoons fertilizer around the drip line of the plant. Water in, and replace&nbsp;mulch.</li><li>Continue fertilizing tomatoes about every 3 to 4 weeks until&nbsp;frost.</li><li>Note: Avoid fast-release fertilizers and avoid high-nitrogen fertilizers. As stated, too much nitrogen will result in lush foliage but few flowers and little or no&nbsp;fruit.</li></ul><h3>Pruning&nbsp;Tomatoes</h3><ul><li>If growing vining tomatoes, pinch off suckers (new, tiny stems and leaves between branches and the main stem). This aids air circulation and allows more sunlight into the middle of the&nbsp;plant.</li><li>Gently tie the stems to stakes with rags, nylon stockings, twine, or soft&nbsp;string.</li><li>As a plant grows, trim the lower leaves from the bottom 12 inches of the&nbsp;stem.</li></ul><h4><span style=\"color:rgb(49, 54, 55);font-family:Lora, georgia, serif;font-size:1.125rem;font-weight:normal;\">Check out </span><a style=\"font-family:Lora, georgia, serif;font-size:1.125rem;font-weight:normal;\" href=\"https://www.almanac.com/blog/gardening-blog/tomato-tips\">this post for even more tomato tips</a><span style=\"color:rgb(49, 54, 55);font-family:Lora, georgia, serif;font-size:1.125rem;font-weight:normal;\">.</span></h4><figure role=\"group\">\n<img alt=\"Tomatoes\" height=\"529\" src=\"/sites/default/files/users/The%20Editors/tomatoes_ozgurdonmaz_gettyimages-edit_full_width.jpeg\" width=\"720\" loading=\"lazy\">\n<figcaption>Photo by Ozgurdonmaz/Getty Images</figcaption>\n</figure>\n</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield__recommended block--field-blocknodeplantfield__recommended flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field__recommended field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Types</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      \n        <p>The first job is deciding what to grow, and with at least 10,000 different varieties of tomato, there’s certainly plenty to choose from, including cherry tomatoes, paste types, varieties with standard round fruits, and chunky beefsteak&nbsp;tomatoes.</p><p>Whatever you grow, they’ll fall into one of two categories: ‘bush’ tomatoes, sometimes called determinate tomatoes, which grow to around 3 feet (1m) tall, and ‘vining’ tomatoes, also called indeterminate or ‘cordon’ tomatoes, which continue growing to produce fruits on one long stem. <a href=\"https://www.almanac.com/determinate-vs-indeterminate-tomatoes-key-differences\">Learn more about the difference between determinate and indeterminate tomatoes</a>.</p><p>Do you only have a hanging basket? Hey, that’s no problem—there are compact tomatoes for this situation,&nbsp;too.</p><ul><li><strong>Determinate tomatoes</strong>, better known as bush varieties, grow 2 to 3 feet tall. These varieties tend to provide numerous ripe tomatoes at one time. They do not put on much leaf growth after setting fruit and tend to fruit for a (relatively) brief period of time.&nbsp;They are generally productive earlier than the vining varieties and not in the latter part of the growing season. Determinate tomatoes do not require staking or caging. These plants are ideal for containers and small spaces. Most paste tomatoes are determinate, which works well for making sauce and canning. Because they produce determinate tomatoes at the same time, they are a good selection for canning. &nbsp;<br>&nbsp;</li><li><strong>Indeterminate tomatoes</strong>, better known as vining varieties, produce the largest types of mid- to late-season slicing tomatoes all summer and until the first frost. Because indeterminates experience more leaf growth, their production tends to be spread more evenly throughout the season. Indeterminate tomatoes need staking. They are ideal in large gardeners. Most beefsteak and cherry tomatoes are&nbsp;indeterminate.</li></ul><figure role=\"group\">\n<img alt=\"green zebra tomatoes\" height=\"554\" src=\"/sites/default/files/users/The%20Editors/green_zebra_tomatoes_v_zaitsev_gettyimages_full_width.jpg\" width=\"720\" loading=\"lazy\">\n<figcaption><em>Tomatoes aren’t only red! The flavorful heirloom ‘Green Zebra’ is featured here, a high-yielding indeterminate plant. Credit: <span class=\"caps\">VZ</span>aitsev/GettyImages</em></figcaption>\n</figure>\n<p>Tomatoes come in a wide range of flavors, colors, and sizes. The choice also depends on how you use this versatile fruit in the kitchen. Cherry tomatoes are great for salads. Beefsteaks are great for&nbsp;sandwiches.&nbsp;</p><p>Romas are not usually eaten fresh out of hand but are perfect for sauces and ketchup. <a href=\"https://www.almanac.com/plant/roma-tomatoes\">See our separate Guide to Growing Roma Tomatoes</a>.</p><p>Also, tomatoes can be susceptible to <a href=\"https://www.almanac.com/gardening/pests-and-diseases\">pests and diseases</a>. To avoid problems, choose disease-resistant cultivars whenever possible.&nbsp;<br><br><strong>Early Varieties</strong> (fewer than 70 days to harvest)<br>Early-maturing cultivars such as ‘Early Girl’ may be slightly less flavorful but will produce fruit 2 to 3 weeks earlier than mid or late-season&nbsp;cultivars.&nbsp;</p><ul><li>‘Early Cascade’: indeterminate trailing plant, fruit in clusters;&nbsp;disease-resistant</li><li>‘Early Girl’<strong>:</strong> indeterminate, meaty fruit; produces through the&nbsp;summer</li></ul><p><strong>Mid-season Varieties</strong> (70 to 80 days to&nbsp;harvest)</p><ul><li>‘Floramerica’: determinate; disease-resistant; firm, deep red flesh, strong&nbsp;plant</li><li>‘Fantastic’: indeterminate; disease- and crack-resistant; meaty, rich flavor, heavy&nbsp;yields</li></ul><p><strong>Late-season Varieties </strong>(80 days or more to&nbsp;harvest)</p><ul><li>‘Amish Paste’: indeterminate; heirloom; large plum tomatoes, acorn-shaped fruit; juicy, excellent for&nbsp;sauce.</li><li>‘Brandywine’: indeterminate; heirloom; beefsteak with perfect acid-sweet combination; many variants are&nbsp;available</li><li>‘Tomato, Roma <span class=\"caps\">VF</span>’: determinate; compact Roma tomatoes; resistant to wilts. Meaty interiors and few seeds; heavy-yielding; good for paste and&nbsp;canning.</li></ul><figure role=\"group\">\n<img alt=\"roma tomatoes\" height=\"480\" src=\"/sites/default/files/users/The%20Editors/roma_tomatoes_ben185_getty_images_full_width.jpg\" width=\"720\" loading=\"lazy\">\n<figcaption><em>Roma tomatoes.&nbsp;</em><br><em>Credit: Ben185/Getty</em></figcaption>\n</figure>\n<p><a href=\"https://amzn.to/44euB4R\" target=\"_blank\"><strong>Cherry&nbsp;Tomatoes&nbsp;</strong></a></p><ul><li>‘Sun Gold’: 57 days to maturity; indeterminate; resistant to Fusarium wilt and tobacco mosaic virus; bright tangerine-orange color on grapelike trusses;&nbsp;intensely sweet&nbsp;taste</li><li>‘Matt’s Wild Cherry’: indeterminate, disease-resistant (including&nbsp;blight)</li><li>‘Yellow Mini (<span class=\"caps\">F1</span>)’:&nbsp;57 days to maturity; indeterminate; sweet, juicy favor; compared with other cherry tomatoes, Yellow Mini resists the splitting that is caused by too much rain or inconsistent watering; high resistance to tobacco mosaic&nbsp;virus.</li></ul><figure role=\"group\">\n<img alt=\"yellow cherry tomatoes\" height=\"478\" src=\"/sites/default/files/users/The%20Editors/yellow_tomato_johnnyseeds_0_full_width.jpg\" width=\"720\" loading=\"lazy\">\n<figcaption><em>Cherry tomatoes</em> (‘Yellow Mini <span class=\"caps\">F1</span>’).&nbsp;<br><em>Credit: </em><a href=\"https://www.johnnyseeds.com/vegetables/tomatoes/yellow-mini-f1-tomato-seed-2770.html\" target=\"_blank\"><em>Johnny Seeds</em></a><em>.</em></figcaption>\n</figure>\n<p><strong>Large&nbsp;Tomatoes</strong></p><ul><li>Beefsteak, Beefmaster, Ponderosa, and Oxheart are noted for their large fruit. However, these larger fruited types often are more susceptible to diseases and skin&nbsp;cracking.</li></ul><figure role=\"group\">\n<img alt=\"black krim heirloom beefsteak tomato\" height=\"507\" src=\"/sites/default/files/users/The%20Editors/black-krim-label_mighty_mato_full_width.jpg\" width=\"720\" loading=\"lazy\">\n<figcaption><em>&nbsp;Black Krim heirloom beefsteak tomato. 80 days; indeterminate; wonderfully rich flavor.&nbsp;</em><br><em>Credit:&nbsp;</em><a href=\"https://parkseed.com/black-krim-tomato-seeds/p/52756-PK-P1/\" target=\"_blank\"><em>Park Seed</em></a><em>.</em></figcaption>\n</figure>\n<p><br><a href=\"https://www.almanac.com/video/growing-tomatoes-choosing-and-starting-best-tomato-varieties\">Learn how to choose tomato varieties</a>.</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-harvest block--field-blocknodeplantfield-harvest flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-harvest field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Harvesting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                              \n        <ul><li>Leave garden tomatoes on the vine as long as&nbsp;possible.</li><li>Harvest tomatoes when they are firm and very red,&nbsp;regardless of size, with perhaps some yellow remaining around the stem. Harvest tomatoes of other colors (orange, yellow, purple, or another rainbow shade) when they turn the correct&nbsp;color.</li><li>If temperatures start to drop and your tomatoes aren&#8217;t ripening, use one of these methods:<ol><li>Pull up the entire plant, brush off dirt, remove foliage, and hang the plant upside down in a basement or&nbsp;garage.</li><li>Place mature, pale green tomatoes, stem up in a paper bag and loosely seal it. Or wrap them in newspaper and place in a cardboard box. Store in a cool (55°F to 70°F), dark place. Cooler temperatures slow ripening; warmth speeds it. Check weekly and remove soft, spotted, diseased, or ripe&nbsp;fruit.</li></ol></li><li>Never place tomatoes on a sunny windowsill to ripen. They may rot before they are&nbsp;ripe!</li><li>Watch <a href=\"https://www.almanac.com/video/how-ripen-green-tomatoes\">this video for tips on how to ripen green tomatoes</a>.</li><li>You can harvest seeds from some tomato varieties. <a href=\"https://www.almanac.com/video/how-save-your-tomato-seeds-successfully\">Learn how here</a>.</li></ul><h3>How to Store&nbsp;Tomatoes</h3><ul><li>Never refrigerate fresh garden tomatoes. Doing so spoils the flavor and texture that give them that garden tomato&nbsp;taste.</li><li>To freeze, core fresh and unblemished tomatoes and place them whole in freezer bags or containers. Seal, label, and freeze. The skins will slip off when they&nbsp;thaw.</li></ul><p>See more on properly <a href=\"https://www.almanac.com/content/storing-vegetables-fruits-and-herbs\">storing tomatoes and other vegetables</a>.</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n<div class=\"recommender-title block block-block-content block-block-contente8acfdbd-8aa8-4a11-9e44-f56cad64ee7a gardening-recommendations print-no\">\n  \n      <h2 class=\"block__title category-heading\">Gardening Products</h2>\n    \n\n  <div class=\"block__content\">\n    <div class=\"gardening-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"49397b29-784d-45ad-ba5f-2ca9659c9feb\">\n    <script type=\"text/html\">\n       var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\" style=\"width: 32%\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div></p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-wit-and-wisdom block--field-blocknodeplantfield-wit-and-wisdom flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-wit-and-wisdom field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Wit and Wisdom</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <ul><li>The tomato originated in South America. Spanish explorers brought the seed from the “New World” to&nbsp;Europe.</li><li>Initially, tomatoes were thought to be poisonous and only grown in the 19th century as an ornamental plant called “The Apple of Paradise” in Germany and “The Apple of Love” in&nbsp;France.</li><li>The mistaken idea that tomatoes were poisonous probably arose because the plant belongs to the Nightshade family, of which some species are truly&nbsp;poisonous.</li><li>In 1781, there is a record of Thomas Jefferson, an experimental farmer, raising tomatoes for his&nbsp;guests!</li><li>People have argued for quite a long time about <a href=\"https://www.almanac.com/blog/gardening-blog/tomatoes-fruit-or-vegetable\">whether tomatoes are fruits or vegetables</a>!</li><li>Ease a headache by drinking tomato juice blended with fresh&nbsp;basil.</li><li>The various varieties of tomatoes range from as large as grapefruits to as small as&nbsp;marbles.</li><li>Compact tomato plants may be referred to as “dwarf,” “micro,” or&nbsp;“patio.”</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-pests block--field-blocknodeplantfield-pests flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-pests field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Pests/Diseases</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                \n        <h3>Tomato&nbsp;Problems</h3><p>If no flowers form, plants may not be getting enough sun or water. Too little of either can stop&nbsp;flowering.</p><p>If plants are producing abundant flowers but no fruit, it could be due to insufficient light, inadequate watering or irregular watering schedule, extreme temperatures (above 75°F during the night and 90°F during the day), or insufficient pollination by&nbsp;bees.</p><p>If flowers form but drop off the plant, this is due to high daytime temperatures (over 90°F). Provide shade during the hottest part of the day by using row covers or shade&nbsp;cloth.</p><p>Low humidity can also affect pollination. The ideal is 40 to 70 percent. If humidity is low, mist the plant to help pollen to&nbsp;stick.</p><h3>Tomato&nbsp;Pests</h3><p>Tomatoes are susceptible to insect pests. To avoid overpopulation of insect pests, follow these basic&nbsp;tips:</p><ol><li>Monitor tomato plants daily, checking under leaves, checking fruit, and checking near the&nbsp;soil.</li><li>To dislodge many pests like <a href=\"/content/aphids\">Aphids</a>, spray plants with a good jet stream from the&nbsp;hose.</li><li>Handpick bigger insects like&nbsp;<a href=\"https://www.almanac.com/content/tomato-hornworms\">Tomato Hornworms</a> with gloves on, dropping them into a bucket of soapy&nbsp;water.</li><li>Apply insecticidal soap directly to the insect on the plant. This works for smaller pests, such as aphids and spider&nbsp;mites.</li><li>Apply horticultural oils or sprays diluted in water. Neem oil sprays block an insect’s air&nbsp;holes.</li><li>If you choose as a last resort to use insecticides like Sevin, keep in mind that you may be killing beneficial insects as&nbsp;well.</li></ol><p>When it comes to tomato diseases and other problems, most of the work is in prevention. Here are some tips to avoid tomato&nbsp;diseases:</p><ol><li>Plant disease-resistant tomato varieties.&nbsp;Tomato disease-resistant codes are listed on seed or seedling packets (example:&nbsp;F = Fusarium&nbsp;Wilt).</li><li>Rotate crops at least every 3 years in the same spot. Avoid planting other members of Solanaceous/nightshade family in the same area as well. This includes potato, pepper, and&nbsp;eggplant.</li><li>Ensure well-draining soil. Always mix in compost or organic&nbsp;matter.</li><li>Water consistently! Do not overwater or underwater. Uneven watering may cause a condition called blossom end&nbsp;rot.</li><li>Destroy infected plants. Unfortunately, you often need to remove and discard infected plants, or the disease will overwinter. Do <span class=\"caps\">NOT</span> put them in your compost&nbsp;pile.</li><li>Solarize the soil. If the problem is really bad, you can treat your soil by covering it with plastic during the hottest part of the summer for 6 to 8 weeks; the sun will destroy the&nbsp;bacteria.</li></ol><h3>Tomato&nbsp;Diseases</h3><ul><li><a href=\"https://www.almanac.com/content/blossom-end-rot\">Blossom-End Rot</a>&nbsp;causes the bottom side of the tomato to develop dark, sunken spots due to a calcium imbalance due to uneven watering. See the link for remedies and&nbsp;prevention.</li><li><strong>Early Blight</strong> is a fungal disease that causes leaves to drop.&nbsp;In July, the risks of blight increase, due to the combination of high humidity and warm days and nights. It starts with dark, concentric spots (brown to black), about 1/2-inch in diameter, on the lower leaves and stems. If you catch it early and destroy infected leaves, your plant may survive. The best defense for outdoor tomatoes is good ventilation and stripping off the lower leaves as the fruits develop. This also helps the ripening process, as tomatoes have maximum exposure to the&nbsp;sun.</li><li><strong>Late Blight</strong> is a fungal disease that causes grey, moldy spots on leaves and fruit, which later turn brown. The disease is spread and supported by persistent damp weather. Unfortunately, once your tomato has late blight, there&#8217;s really no solution.&nbsp;<a href=\"https://www.almanac.com/avoid-blight-right-tomato\">See our blog on “Avoid Blight With the Right Tomato</a>.”</li><li><a href=\"https://www.almanac.com/content/mosaic-viruses\"><strong>Mosaic Virus</strong></a><strong> </strong>creates distorted leaves and causes young growth to be narrow and twisted, and the leaves become mottled with yellow. Unfortunately, infected plants should be destroyed (but don&#8217;t put them in your compost&nbsp;pile).</li><li><strong>Fusarium Wilt</strong> starts with yellowing and wilting on one side of the plant and moves up the plant as the fungus spreads. Unfortunately, once this disease strikes, the plant needs to be&nbsp;destroyed.</li><li><a href=\"https://www.almanac.com/pest/powdery-mildew\"><strong>Powdery Mildew</strong></a>&nbsp;is a fungal disease that leaves white spots or a dusting of white on the leaves. It can be managed. See the link to learn&nbsp;more.</li><li><strong>Cracking:</strong> When fruit growth is too rapid, the skin will crack. This usually occurs due to uneven watering or uneven moisture from weather conditions, such as (very rainy periods mixed with dry periods).&nbsp;Keep moisture levels constant with consistent watering and&nbsp;mulching.</li></ul><p><a href=\"https://www.almanac.com/tomato-diseases-and-disorders\">See more information about Tomato Diseases and Disorders</a>.</p><div class=\"youtube-container\">&nbsp;</div></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-recipes block--field-blocknodeplantfield-recipes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-recipes field--type-entity-reference field--label-above\">\n    <div class=\"field__label\">Recipes</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/recipe/spinach-stuffed-tomatoes\" hreflang=\"und\">Spinach-Stuffed Tomatoes</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/tomato-herb-bread\" hreflang=\"und\">Tomato Herb Bread</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/skillet-chicken-fresh-tomatoes\" hreflang=\"und\">Skillet Chicken With Fresh Tomatoes</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/chicken-stuffed-tomatoes\" hreflang=\"und\">Chicken-Stuffed Tomatoes</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/fresh-tomato-tart\" hreflang=\"und\">Fresh Tomato Tart</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/cherry-tomato-and-beet-crostini\" hreflang=\"und\">Cherry Tomato and Beet Crostini</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/fresh-tomato-and-zucchini-au-gratin\" hreflang=\"und\">Fresh Tomato and Zucchini Au Gratin</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-cooking-notes block--field-blocknodeplantfield-cooking-notes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-cooking-notes field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Cooking Notes</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <ul><li>Tomatoes are nutritious and low in calories. One medium-sized tomato provides 57% of the recommended daily allotment (<span class=\"caps\">RDA</span>) of vitamin C, 25% of vitamin A, and 8% of iron, yet it has only 35&nbsp;calories.</li><li>Preserve your harvest to enjoy all year long by <a href=\"https://www.almanac.com/how-to-can-tomatoes\">canning tomatoes</a> or <a href=\"https://www.almanac.com/drying-basil-tomatoes-and-paprika\">drying tomatoes</a>.</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-topics block--field-blocknodeplantfield-topics flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n      <div class=\"field field--name-field-topics field--type-entity-reference field--label-hidden field__items\">\n              <div class=\"field__item\"><a href=\"/topics/gardening/edible-gardening/vegetables\" hreflang=\"en\">Vegetables</a></div>\n          </div>\n  \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block--author-bio block-views block-views-blockauthor-bio-block-1 block--views-blockauthor-bio-block-1 flex flex-col\">\n  \n      <div class=\"block__title block-title block-title--views-blockauthor-bio-block-1 w-full\">\n      About The Author\n    </div>\n    \n\n            <div class=\"block__content author-bio-content\">\n                <div class=\"author-bio-main\">\n                                                              \n                                            <div class=\"author-picture-wrapper\">\n                  <img src=\"/sites/default/files/pictures/2024-10/IMG_0365.jpeg\" alt=\"Catherine Boeckmann\" class=\"author-picture\">\n                </div>\n              \n                            <div class=\"author-info-section\">\n                                \n                    <h2 class=\"author-name\">Catherine Boeckmann</h2>\n\n                \n                                                  <h3 class=\"author-job-title\">Executive Digital Editor and Master Gardener</h3>\n                \n                                                                                                            <div class=\"author-bio\">Catherine Boeckmann is the Executive Digital Editor of Almanac.com, the website companion of The Old Farmer&#039;s Almanac. She covers gardening, plants, pest control, soil composition, seasonal and moon c...</div>\n                                  \n                                                  <div class=\"author-link-wrapper\">\n                    <a href=\"/author/catherine-boeckmann\" class=\"author-link\">\n                      Read More from Catherine Boeckmann\n                    </a>\n                  </div>\n                \n                                \n                                              </div>\n                              </div>\n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-guides block-guides-toc-block block--guides-toc-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n      </div>\n      </div>\n\n\n<div class=\"sticky-right-sidebar-50 block block-block-content block-block-content8181050b-721f-4611-a9f5-ccc1317801e7 block--block-content8181050b-721f-4611-a9f5-ccc1317801e7 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                        \n        <div class=\"ad-wrapper\"><div id=\"FreeStarVideoAdContainer\"><div id=\"freestar-video-parent\"><div id=\"freestar-video-child\">&nbsp;</div></div></div><p><span class=\"advertisement-label\"><span class=\"caps\">ADVERTISEMENT</span></span></p></div></p>\n      </div>\n      \n      </div>\n      </div>\n\n\n<div class=\"sticky-right-sidebar-50 block block-block-content block-block-contentea8499cd-5842-4051-95e9-1f008b985a55 block--block-contentea8499cd-5842-4051-95e9-1f008b985a55 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div class=\"ad-wrapper\"><!-- Tag ID: almanac_sidebar_right_2 -->\n<div align=\"center\" data-freestar-ad=\"__300x250 __300x250\" id=\"almanac_sidebar_right_2\"><script data-cfasync=\"false\" type=\"text/javascript\">\n    freestar.config.enabled_slots.push({ placementName: \"almanac_sidebar_right_2\", slotId: \"almanac_sidebar_right_2\" });\n</script></div>\n<span class=\"advertisement-label\">Advertisement</span>\n</div>\n\n\n</p>\n      </div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-1 block--views-blockmore-like-this-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-1 font-normal mt-0\">\n      More Like This\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-9b29e14cf92cc5dcd2552d509e054373cce40ec242c4983522cfc27b20b267bf\">\n  \n  \n  \n\n  \n  \n  \n\n  \n\n\n<!-- Check if there are multiple rows -->\n  <!-- Multiple rows - wrap each in grid tile -->\n  <div class=\"grid gap-6 auto-rows-auto grid-cols-1 md:grid-cols-3 mb-2\">\n                                        <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/content/starting-seeds-indoors\">\n\n\n\n<article data-history-node-id=\"324301\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 324301\n    Current path: /plant/tomatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/starting-seeds-featured-2400px2.jpeg?itok=2tsyOooV\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/content/starting-seeds-indoors\" hreflang=\"und\">Starting Seeds Indoors: How and When to Start Seeds </a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"><a href=\"/video/growing-tomatoes-choosing-and-starting-best-tomato-varieties\"><img src=\"/sites/default/files/styles/or/public/youtube/rZgtvtDlxd4.jpg?itok=qcSiS72L\" width=\"1186\" height=\"667\" alt=\"Embedded thumbnail for Choosing Tomato Varieties for Your Garden\" loading=\"lazy\" class=\"image-style-or\" />\n\n\n</a></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/video/growing-tomatoes-choosing-and-starting-best-tomato-varieties\" hreflang=\"und\">Choosing Tomato Varieties for Your Garden</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/10-secrets-growing-tomatoes\">\n\n\n\n<article data-history-node-id=\"107729\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 107729\n    Current path: /plant/tomatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/tomatoes%20Helios4Eos%20GettyImages.jpg?itok=lZW_pGQ5\" width=\"650\" height=\"366\" alt=\"tomatoes growing in the garden\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/10-secrets-growing-tomatoes\" hreflang=\"und\">10 Secrets to Growing Tomatoes (Avoid Pitfalls Now!)</a></h3></div>\n            </div>\n                                                                <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/corn\">\n\n\n\n<article data-history-node-id=\"126843\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 126843\n    Current path: /plant/tomatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/corn-1605664_1920.jpg?itok=S-vDnSL6\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/corn\" hreflang=\"und\">How to Grow Sweet Corn: Planting, Pollination &amp; Harvesting Tips</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/understanding-when-plant-vegetables\">\n\n\n\n<article data-history-node-id=\"129507\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 129507\n    Current path: /plant/tomatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/vegetables_anabgd-getty.jpg?itok=_ZIgI16_\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/understanding-when-plant-vegetables\" hreflang=\"und\">Understanding When to Plant Vegetables</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/cucumbers\">\n\n\n\n<article data-history-node-id=\"121301\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 121301\n    Current path: /plant/tomatoes\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/growing%20cucumbers.jpg?itok=fdpqqlFB\" width=\"650\" height=\"366\" alt=\"cucumbers growing on the vine\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/cucumbers\" hreflang=\"und\">How to Grow Cucumber Plants: Easy Guide to Planting &amp; Harvesting</a></h3></div>\n            </div>\n                              </div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-1 block--views-blockpost-roll-promotion-block-1 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"ad-wrapper print-no block block-block-content block-block-content358b8bea-553b-4b9b-9dc8-676e09aeaa95 block--block-content358b8bea-553b-4b9b-9dc8-676e09aeaa95 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                              \n        <!-- Tag ID: almanac_billboard_btf -->\n<div align=\"center\" data-freestar-ad=\"__300x250 __970x250\" id=\"almanac_billboard_btf\"><script data-cfasync=\"false\" type=\"text/javascript\">\n    freestar.config.enabled_slots.push({ placementName: \"almanac_billboard_btf\", slotId: \"almanac_billboard_btf\" });\n  </script></div>\n\n<p><span class=\"advertisement-label\"><span class=\"caps\">ADVERTISEMENT</span></span></p>\n      </div>\n      \n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 more-like-this print-no\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"views-element-container block block-views block-views-blockcomment-form-block-1 block--views-blockcomment-form-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockcomment-form-block-1 font-normal mt-0\">\n      Comments\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-40e22a1976ba537273d0cea3cd253d5754f844cdb7324aff25578a8313846c78\">\n  \n  \n  \n\n  \n  \n  \n\n      <div class=\"views-row\"><div class=\"views-field views-field-nid\"><span class=\"field-content\"><a href=\"/comment/reply/node/90258/comment_node_plant\">Add a Comment</a></span></div></div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n\n<div class=\"views-element-container comment-ajax-wrapper\">\n  \n    \n      <div><div class=\"js-view-dom-id-b2ff1465470b32cf6b3f39ed7a8dbdb0426db95073a9c008ca33e7ce868f6f44\">\n  \n  \n  \n\n  \n  \n  \n\n  <div data-drupal-views-infinite-scroll-content-wrapper class=\"views-infinite-scroll-content-wrapper clearfix\">    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"138504\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Jackie&lt;/span&gt;</span>\n        <span class=\"comment-time\">Wed, 08/13/2025 - 15:11</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"138504\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      We have generally hot, dry summers. Its nearing mid August and we are expecting an unusual big rain event. My tomatoes are still mostly green aside from my cherry Tom's. Should I put a plastic tent over them to prevent them from splitting? Thanks.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-138504\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"137035\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Georgis&lt;/span&gt;</span>\n        <span class=\"comment-time\">Wed, 03/05/2025 - 08:20</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"137035\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I've tried Early Girls a few times, as an attempt to get some tomatoes sooner than the big beefsteaks my spouse prefers. Every time, I get a couple of branches that produce cherry tomatoes! and once the cherry-sized tomatoes start up, the rest of the plant doesn't work as hard. I give up, I'm going to stick with beefsteak types. \r\nOh, and paste/Romas - these are great to have in the freezer. Core them and freeze them whole, take out of the bag when you need them, hold under running water and the peel slips right off. Then straight into the pot, mash 'em up later. \n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-137035\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"130423\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Donna Sanders&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sun, 07/09/2023 - 13:33</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"130423\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      What caused leaf curl at new growth on top of my tomato plants?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-130423\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"125595\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Bst&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sun, 08/21/2022 - 06:41</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"125595\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      You're missing \"Ramapo\".  A classic Jersey tomato with that great old time flavor that was reintroduced by Rutgers University a few years ago.  I've grown them in NH for 3 years now.  They're a heavy producer, large size great for slicing.  Gardening and growing tomatoes for well over 50 years, Ramapo is the best I have ever run across.  Beats anything out there!\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-125595\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"123545\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Thomas Cameron&lt;/span&gt;</span>\n        <span class=\"comment-time\">Tue, 04/19/2022 - 22:06</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"123545\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I have started 3 tomato plants in containers inside my house. They are now 18\" in height but have very few branches. Is this normal?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-123545\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"124972\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Wed, 07/13/2022 - 16:01</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"124972\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Tomatoes are sun and heat lovers. They need at least 8 hours of direct sunlight per day PLUS a surrounding temperature of around 70 degrees Fahrenheit or higher.</p>\r\n\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-124972\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"124527\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Benard Odaro&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sun, 06/19/2022 - 03:12</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"124527\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      The tomatoes may fail to produce more branches while growing tall due to lack of enough sunlight. Adequate sunlight is very useful for it's growth.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-124527\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"123324\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Danielle&lt;/span&gt;</span>\n        <span class=\"comment-time\">Fri, 04/01/2022 - 12:33</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"123324\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      My big new tomatoes (still green) are getting holes (bugs) can I save them, I don't see any bugs, very frustrating \n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-123324\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"123549\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Wed, 04/20/2022 - 10:13</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"123549\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Hi Danielle, We are sorry to hear about the issues with your tomato crop. It must be quite frustrating, especially since you can not see what is causing the holes. Some of the more common pests are the tomato fruitworm and tomato hornworm. Whatever is creating the holes in your tomatoes is likely causing damage and promoting decay to the inside of the fruit as well. It is best to get rid of the severely affected tomatoes and then keep a watchful eye for pests in an attempt to salvage what remains of your crop.</p>\r\n\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-123549\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"122067\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Cheryel Lemley-Mcroy&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sat, 01/22/2022 - 14:37</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"122067\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90258\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I sliced open an over ripe tomato and it was filled with sprouted seeds. I scooped them out and put them in an inch of potting soil. I now have a forest of 2 inch tall seedlings. Will they produce the same kind of tomatoes as the tomato they came in?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-122067\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n</div>\n\n    \n<div class=\"comment-pager-wrapper\">\n  <ul class=\"comment-pagination js-pager__items\" data-drupal-views-infinite-scroll-pager>\n        \n              <li class=\"pager__item\">\n        <span class=\"pager-previous disabled button\">« Previous</span>\n      </li>\n    \n        \n              <li class=\"pager__item\">\n                  <span class=\"current-page button\">1</span>\n              </li>\n          <li class=\"pager__item\">\n                  <a href=\"?page=1\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to page 2\">2</a>\n              </li>\n    \n              <li class=\"pager__item\">\n        <span class=\"pager-ellipsis button\">…</span>\n      </li>\n      <li class=\"pager__item\">\n        <a href=\"?page=9\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to last page\">10</a>\n      </li>\n    \n        <li class=\"pager__item\">\n      <a href=\"?page=1\" class=\"use-ajax button js-pager__item pager-next\" data-drupal-views-infinite-scroll-pager-link title=\"Go to next page\" rel=\"next\">Next »</a>\n    </li>\n  </ul>\n</div>\n\n\n  \n  \n\n  \n  \n</div>\n</div>\n\n  </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"sticky-right-sidebar block block-block-content block-block-contentca267f9f-ce0a-4d2d-a568-8a90f3bce8eb block--block-contentca267f9f-ce0a-4d2d-a568-8a90f3bce8eb flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                        \n        <div class=\"ad-wrapper\"><div class=\"text-align-center\" data-freestar-ad=\"__300x250 __300x250\" id=\"almanac_sidebar_right_3\"><script data-cfasync=\"false\" type=\"text/javascript\">\n        freestar.config.enabled_slots.push({ placementName: \"almanac_sidebar_right_3\", slotId: \"almanac_sidebar_right_3\" });\n      </script></div><p><span class=\"advertisement-label\"><span class=\"caps\">ADVERTISEMENT</span></span></p></div></p>\n      </div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"store-logo block block-block-content block-block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 block--block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div style=\"align-items:center;background-color:#005336;display:flex;flex-wrap:wrap;gap:20px;justify-content:space-evenly;margin-bottom:20px;margin-top:40px;padding:10px;width:100%;\"><div style=\"color:#fff;\">📣<strong>The Gardening Club Just Got Better!</strong> 3 Deliveries, 10% Store Discount, and more!</div><div><a class=\"text-button\" href=\"https://store.almanac.com/pages/most-popular-club\" target=\"blank\">Learn More</a></div></div><a href=\"https://store.almanac.com/\" target=\"_blank\"><img src=\"https://www.almanac.com/sites/default/files/promotion/old-farmers-almanac-store-logo-1200px.jpg\" data-entity-uuid=\"c84260b7-88a4-4419-a3ff-3e408f8c6c79\" data-entity-type=\"file\" alt=\"The Old Farmer's Almanac Store\" width=\"600\" height=\"77\" align=\"center\" class=\"align-center\" loading=\"lazy\"></a></p>\n      </div>\n      \n      </div>\n      </div>\n<div class=\"content-recommender print-no block block-block-content block-block-contentfdd6ba48-ec8e-4e76-8008-f0a9ba0e596b listrak-recommendations\">\n  \n    \n\n  <div class=\"block__content\">\n    <div class=\"listrak-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"f5f04466-f923-491d-9354-679d54e32def\">\n    <script type=\"text/html\">\n        var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div>           \n</p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n    </div>\n  </div>\n\n  </div>\n\n  </article>\n\n      </div>\n      </div>\n\n  </div>\n\n    \n  </section>\n\n  </main>\n\n<footer id=\"page-footer\">\n    <div class=\"w-full bg-sand newsletter-signup-footer\">\n    <div class=\"max-w-[85rem] mx-auto md:px-20\">\n\n      <div class=\"flex-nowrap w-full md:w-auto pt-8 text-center md:text-left\">\n        <h4 class=\"text-xl md:text-2xl font-normal font-sans leading-tight text-black mb-2\">Get Almanac's Daily Updates</h4>\n      </div>\n\n      <div class=\"flex flex-col md:flex-row items-center justify-between gap-6 pb-8\">\n                <div class=\"text-center md:text-left flex-1\">\n          <p class=\"text-base md:text-lg text-black\">\n            <span class=\"uppercase font-bold\">BONUS</span>: You'll also receive our free <em>Beginner Gardening Guide!</em>\n          </p>\n        </div>\n\n                <div class=\"flex-grow w-full md:w-auto\">\n          <form class=\"flex flex-col sm:flex-row gap-3 md:gap-4 w-full md:w-auto sm:px-4 p-0\" action=\"/\" method=\"post\">\n            <input\n              type=\"email\"\n              name=\"email\"\n              placeholder=\"Enter your email address\"\n              class=\"flex-1 px-3 py-2 md:px-4 md:py-3 text-gray-900 bg-white focus:outline-none focus:ring-2 focus:ring-brick-red placeholder-gray-500\"\n              required\n            >\n            <button\n              type=\"submit\"\n              class=\"px-4 py-2 md:px-6 md:py-3 bg-brick-red text-white font-bold hover:bg-dark-red focus:outline-none focus:ring-2 focus:ring-brick-red transition-colors whitespace-nowrap\"\n            >\n              Go\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n  </div>\n\n    <div class=\"layout layout--page max-w-[85rem] mx-auto\">\n    <div class=\"container mx-auto pb-12\">\n      \n<div class=\"region region--footer-top footer-top-region\">\n  <div class=\"section--container\">\n    <div class=\"grid grid-cols-1 md:grid-cols-3 gap-8\">\n      <nav  id=\"block-almanac-general\" class=\"block block-menu navigation menu--general\" aria-labelledby=\"block-almanac-general-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-general-menu\">Our Brands</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"https://store.almanac.com/\">The Old Farmer’s Almanac Store</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://newengland.com/\">Yankee Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.familytreemagazine.com/\">Family Tree Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhbr.com/\">NH Business Review</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhmagazine.com/\">New Hampshire Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://yankeecustommarketing.com/\">Yankee Custom Marketing</a>\n              </li>\n      </ul>\n\n  </nav>\n<nav  id=\"block-almanac-resources\" class=\"block block-menu navigation menu--resources\" aria-labelledby=\"block-almanac-resources-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-resources-menu\">Resources</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"/about-us\">About Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/contact\">Contact Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/signup\">Free Daily Newsletter</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/webcam\">Webcam</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediakit\">Advertise with Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediaroom\">Media Relations</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/retail\">Sell the Almanac</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/wheretobuy\">Where to Buy</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/terms-of-use/\">Terms of Use</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/privacy-policy\">Privacy Policy</a>\n              </li>\n      </ul>\n\n  </nav>\n<div class=\"social-menu flex\">\n  \n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n\n    </div>\n  </div>\n</div>\n\n\n      <div class=\"social-menu grid grid-cols-5 gap-8\">\n        \n      </div>\n\n      <div class=\"text-sm text-gray-600 flex justify-between mt-24 mb-12\">\n        <div>\n            © 2025 <a href=\"https://ypi.com/\" target=\"_blank\" class=\"inline\">Yankee Publishing Inc.</a>, An Employee-Owned Company.\n        </div>\n        <div>\n          1121 Main Street | P.O. Box 520 | Dublin, NH 03444\n        </div>\n      </div>\n    </div>\n  </div>\n</footer>\n\n  </div>\n\n\n  <div class=\"region region--page-bottom\">\n    \n  </div>\n\n  \n  <script type=\"application/json\" data-drupal-selector=\"drupal-settings-json\">{\"path\":{\"baseUrl\":\"\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/90258\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"eJxNj1uOwzAIRTdklyVZxCERKjYWxq28-0mbpJof4D4-DigFK2bYRReU2H0K1z3gZQtOHR6XwbKSxT5aU_Nf3IwL2ozH3ClmrW4qIQthdZQnYFuyxzYW4RyylkLVYbXRUB6XjMuML6Y32V1Im1qBWzTcuaKz1rDi7GlUZ4EPJ_WwsTgZZGzfwkmbLlrwt2aV1Cn_T1fuWV9kE7TSkQfh7oZPuHbw2XQ33ib8rvAh7PCdj6LrEDqtxHXjyk6p5-N1OSvxduPp_gHbNY0b\",\"theme\":\"almanac\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:b2ff1465470b32cf6b3f39ed7a8dbdb0426db95073a9c008ca33e7ce868f6f44\":{\"view_name\":\"comments_with_ajax_\",\"view_display_id\":\"block_1\",\"view_args\":\"90258\",\"view_path\":\"\\/node\\/90258\",\"view_base_path\":null,\"view_dom_id\":\"b2ff1465470b32cf6b3f39ed7a8dbdb0426db95073a9c008ca33e7ce868f6f44\",\"pager_element\":0}}},\"almanac\":{\"adExclusions\":{\"fullExclude\":[\"\\/retail\",\"\\/mediakit\",\"\\/club\",\"\\/winter\",\"\\/mediaroom\",\"\\/kids\",\"\\/old-farmers-almanac-promotional-images\"],\"videoOnly\":[\"\\/how-to-kill-poison-ivy\",\"\\/wheretobuy\",\"\\/feminized-seeds\",\"\\/autoflower-seeds\",\"\\/how-to-germinate-cannabis-seeds\"]}},\"user\":{\"uid\":0,\"permissionsHash\":\"a870a3cd03311fe2742a98671d86d33235d0ba55333d275d5575e9fd83f56f7e\"}}</script>\n<script src=\"/core/misc/drupalSettingsLoader.js?v=11.2.4\"></script>\n<script src=\"/themes/almanac/dist/js/scripts.js?t4yh8p\"></script>\n<script src=\"/modules/contrib/views_infinite_scroll/js/infinite-scroll.js?v=11.2.4\"></script>\n\n</body>\n</html>\n",
  "scrapedAt" : "2025-10-30T21:24:05.509613Z",
  "successful" : true,
  "errorMessage" : null
}