{
  "slug" : "zucchini",
  "source" : "Almanac.com",
  "url" : "https://www.almanac.com/plant/zucchini",
  "commonName" : "How to Grow Zucchini & Summer Squash: Planting, Care & Harvest Tips",
  "description" : null,
  "companionSection" : null,
  "plantingGuide" : "### Planting, Growing, and Harvesting Zucchini & Summer Squash\n\n\n### Planting\nZucchini are members of the squash family, so they need to be bathed in warmth and sunshine to thrive. Shelter them from strong winds, too, so bees and other insects can go about pollinating the flowers in peace. Pick a location with full sun, shelter from the wind for good pollination, and soil that is moist (not soggy) and well-draining. Squash also produces nicely if well-fed. Mix aged manure and/or compost into the soil before planting. Learn more about preparing soil for planting. Their robust growth and big leaves make them hungry feeders. Add plenty of garden compost or well-rotted manure to the soil before planting. In fact, you can even plant zucchini on top of a compost heap—if you won’t be needing it till fall, that is. Or prepare planting pockets: a few weeks before planting, dig out a hole, fill it with compost, then return some of the soil, along with a handful of organic fertilizer. The nutrient-rich filling will prove a veritable feast for the plants growing in it! When to Plant Zucchini Wait to plant seeds or transplants in the ground until the soil is at least 65° to 70°F. This may be mid-spring for some regions, but often, it’s fine to plant by late spring. (Don’t start too early, as the seeds will not germinate in the cold, and you’ll do the plant no favors.) Direct-sow seeds (i.e., directly into the ground) when all danger of frost has passed, and the air and soil are at least 60ºF. See your last frost date. If you wish to start seeds indoors, start seeds in peat pots 2 to 4 weeks before your last spring frost; note that squash seedlings do not always transplant well; handle the roots gently. Fill pots or plug trays with potting mix and sow one seed per pot or plug on its edge. They will germinate quickest with a little warmth, but so long as you can guarantee a frost-free environment, they’ll eventually push through. Warm the soil with black plastic and mulch once the soil has been prepared in early spring. Do not rush to plant zucchini. Consider planting a few seeds in midsummer to avoid problems from squash vine borers and other early-season pests and diseases. How to Plant Zucchini Direct sow seeds in level ground 1 inch deep and 2 to 3 inches apart. Or, sow 3 or 4 seeds close together in small mounds (or hills; the soil is warmer off the ground) in rows 3 to 6 feet apart. If necessary, use row covers, or plastic milk jugs, or cold frame protection in cold climates for the first few weeks of spring. Thoroughly water after planting. Adding a layer on top of mulch (such as garden compost) to lock in soil moisture. You can also sow into seed flats or trays to separate out and pot on after germination. Do this as soon after germination, as you’re able to handle the seedlings before the roots become entangled. Fill your pots and, holding the seedling by its leave, not the stem, feed in the potting mix around the sides. Firm in and water. See our video showing how to grow the perfect zucchini every time!\n\n### When to Plant Zucchini\n- Wait to plant seeds or transplants in the ground until the soil is at least 65° to 70°F. This may be mid-spring for some regions, but often, it’s fine to plant by late spring. (Don’t start too early, as the seeds will not germinate in the cold, and you’ll do the plant no favors.)\n- Direct-sow seeds (i.e., directly into the ground) when all danger of frost has passed, and the air and soil are at least 60ºF. See your last frost date.\n- If you wish to start seeds indoors, start seeds in peat pots 2 to 4 weeks before your last spring frost; note that squash seedlings do not always transplant well; handle the roots gently. Fill pots or plug trays with potting mix and sow one seed per pot or plug on its edge. They will germinate quickest with a little warmth, but so long as you can guarantee a frost-free environment, they’ll eventually push through.\n- Warm the soil with black plastic and mulch once the soil has been prepared in early spring.\n- Do not rush to plant zucchini. Consider planting a few seeds in midsummer to avoid problems from squash vine borers and other early-season pests and diseases.\n\n### How to Plant Zucchini\n- Direct sow seeds in level ground 1 inch deep and 2 to 3 inches apart.\n- Or, sow 3 or 4 seeds close together in small mounds (or hills; the soil is warmer off the ground) in rows 3 to 6 feet apart.\n- If necessary, use row covers, or plastic milk jugs, or cold frame protection in cold climates for the first few weeks of spring.\n- Thoroughly water after planting.\n- Adding a layer on top of mulch (such as garden compost) to lock in soil moisture.\n- You can also sow into seed flats or trays to separate out and pot on after germination. Do this as soon after germination, as you’re able to handle the seedlings before the roots become entangled. Fill your pots and, holding the seedling by its leave, not the stem, feed in the potting mix around the sides. Firm in and water.\nSee our video showing how to grow the perfect zucchini every time!\n\n### How to Grow Cucumber Plants: Easy Guide to Planting & Harvesting\n",
  "careInstructions" : "### Planting, Growing, and Harvesting Zucchini & Summer Squash\n\n\n### Growing\nMulch to discourage weeds, retain moisture, and protect shallow roots. Zucchini thrive in moist soil. Water thoroughly, frequently, and consistently, with at least 1 inch per week. Water diligently when fruit form and throughout their growth cycle. The soil needs to be moist 4 inches down, so long soakings are best. Misshapen squash results from inadequate water or fertilization. Keep your zucchini well-watered, and top up mulches occasionally to help lock in soil moisture for longer. Plants tend to produce only male flowers at first, and pollination can also be slow to start, particularly in cool or damp weather. Remove any weeds that manage to poke through. To keep plants tidy, cut off any dead or shriveling weeds. Top up mulches, using organic matter, such as garden compost, to help roots stay cool and moist. When the first blooms appear, side-dress with a balanced fertilizer. Poor pollination by bees can be an issue. If not pollinated, squash flowers will not bear fruit or will only bear small fruit. Most squash plants produce both male (these appear first, on long thin stalks) and female flowers (these have an immature fruit behind them). To fruit, pollen from the male flowers must be transferred to the female flowers by bees—or by the gardener. Pollinate the female flowers manually with a cotton swab or add plants that attract bees near the squash. Growing Zucchini and Summer Squash in Containers The ever-increasing numbers of compact varieties suited for containers provide options for any taste and space. Bush plants are generally better suited to containers, but in a large pot with space to spread, vining squashes can produce a successful harvest. Prepare a 5-gallon or 14-inch-diameter pot with rich potting mix for each variety of squash that you want to grow. When the soil temperature reaches around 70°F, or 2 weeks after the last frost date, direct-sow two seeds of the same variety 1 inch deep into the container and water to dampen. (Transplant homegrown or purchased seedlings if you want to jump-start the growing season.) Following germination, remove the weaker plant by cutting its stem; this is less disturbing to the roots. Water regularly to keep the soil moist. If you’re growing vining squashes, insert a trellis into the container for the plant to climb later. About 6 weeks after the seeds have been planted, apply fertilizer. After the first true leaves appear (those after the initial two), apply a slow-release pellet fertilizer, according to the label’s directions. Follow up with a weekly dose of balanced fertilizer, based on the label’s guidance for the pot size. When watering, avoid getting water on the leaves. Water the soil 1 inch per week directly or set the container in a bucket or tub of water and allow it to be absorbed. As the plants grow, train the vines (if that type) onto a trellis or other support. Use string to gently secure them.\n\n### Growing Zucchini and Summer Squash in Containers\nThe ever-increasing numbers of compact varieties suited for containers provide options for any taste and space. Bush plants are generally better suited to containers, but in a large pot with space to spread, vining squashes can produce a successful harvest.\nPrepare a 5-gallon or 14-inch-diameter pot with rich potting mix for each variety of squash that you want to grow. When the soil temperature reaches around 70°F, or 2 weeks after the last frost date, direct-sow two seeds of the same variety 1 inch deep into the container and water to dampen. (Transplant homegrown or purchased seedlings if you want to jump-start the growing season.) Following germination, remove the weaker plant by cutting its stem; this is less disturbing to the roots. Water regularly to keep the soil moist. If you’re growing vining squashes, insert a trellis into the container for the plant to climb later.\nAbout 6 weeks after the seeds have been planted, apply fertilizer. After the first true leaves appear (those after the initial two), apply a slow-release pellet fertilizer, according to the label’s directions. Follow up with a weekly dose of balanced fertilizer, based on the label’s guidance for the pot size. When watering, avoid getting water on the leaves. Water the soil 1 inch per week directly or set the container in a bucket or tub of water and allow it to be absorbed. As the plants grow, train the vines (if that type) onto a trellis or other support. Use string to gently secure them.\n\n### What Are Gourds? Types, Growing Tips, and Creative Uses\n",
  "harvestInfo" : "### Planting, Growing, and Harvesting Zucchini & Summer Squash\n\n\n### Harvesting\nHarvest summer squash when tender and a bit immature (6 to 8 inches long) for more flavor. Believe us, oversize squash has very little taste. Many people wait too long to harvest. If you have ever had a negative experience with zucchini before, it’s probably because they were left to become bruisers. Most varieties average 60 days to maturity, and are ready as soon as a week after flowering. (Check the seed packet for more exact information.) Cut (do not break) fruit off the vine with a sharp knife, or you risk damaging the soft stem of the plant. Leave at least 1 inch of stem on the fruit. To slow production, harvest fruit when small and/or remove male flowers. If the harvest is interrupted (say, by your vacation), remove large squash on your return to reduce demands on the plants for moisture and nutrients. Complete the harvest before the first fall frost; summer squash is highly susceptible to frost and heat damage. In fact, the flowers make good eating too, typically stuffed or simply battered and then fried. But only pick the male flowers—the ones without a bulge behind them—or else you won’t get any fruit! How to Store Zucchini Fresh summer squash has a relatively short shelf life. Store unwashed zucchini in a plastic or paper bag with one end open to encourage air circulation, and pop them in the refrigerator crisper drawer. They’ll keep for 10 days. Too much zucchini? Freeze it! It will keep for 3 months. See how to blanch and store zucchini in the freezer!\n\n### How to Grow Cucumber Plants: Easy Guide to Planting & Harvesting\n",
  "pestsAndDiseases" : "### Pests/Diseases\nZucchini produces well, but you MUST keep an eye on the plant for pests. If you ignore zucchini, the pests will come, but you must get ahead of them before they arrive. Pests Two troublemakers often pay an unwelcome visit, usually early in the season. Squash bugs feed on sap, weakening plants and threatening fruit production. Protect plants when the bugs are most active, early on in the summer, by using row covers or fleece. Then continue to check for eggs at least twice a week. Rub or scrape off the eggs. Adult bugs can be knocked or shaken off plants into a bucket of soapy water. (If you keep chickens, offer them a treat!) Squash vine borers are found in the eastern half of North America. They burrow into stems, causing them to rot and foliage to wilt. They are most active earlier in the summer. Row covers can help keep them off, or wrap stems in foil to prevent eggs from being laid at the base of plants. It’s possible to cut the grubs out by making vertical cuts into the stem using a sharp knife. Once you’re done, bury the stem with moist soil to encourage new roots. Here’s a helpful squash borer tip from reader James W: “No prevention is perfect. What I do is to start another zucchini indoors for planting after July 1st in Zone 5. The squash borer has completed her egg laying by then, and the rest of the summer is uneventful, to the zuke at least.” Diseases As far as diseases go, powdery mildew can be an issue on the leaves later in the season. It’s a common fungal disease that forms a white powdery coating on both sides of leaves. Usually, growth stalls. A common reason for powdery mildew is irregular watering, so stay consistent. If plants do become infected, remove affected leaves immediately. A great way to prevent powdery mildew altogether is to mist leaves with a solution that is 1/3 milk and 2/3 water. Spray the milky mixture onto all surfaces—early, on a dry and sunny day. Repeat every 10 to 14 days throughout the growing season. Blossom-end rot is an occasional issue as well. If the blossom ends of your squash turn black and rot, then your squash have blossom-end rot. This condition is caused by uneven soil moisture levels, often by wide fluctuations between wet and dry soil. Uneven watering affects the calcium levels of the fruit. To correct the problem, water deeply and apply a thick mulch over the soil surface to keep evaporation at a minimum. Keep the soil evenly moist like a wrung-out sponge, not wet and not completely dried out. Watch this excellent video for tips and tricks to sidestep common squash problems so there’s no barrier to your successful harvest!",
  "rawHtml" : "<!DOCTYPE html>\n<html lang=\"en\" dir=\"ltr\" prefix=\"og: https://ogp.me/ns#\" class=\"h-full bg-background\">\n  <head>\n    <meta charset=\"UTF-8\" />\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n    <meta name=\"p:domain_verify\" content=\"f46e5dfff350743298ae1e5af21e8dd1\"/>\n    <meta name=\"msvalidate.01\" content=\"3B427AB94F44374B431B678687BA15C2\" />\n\n    <meta name=\"apple-mobile-web-app-title\" content=\"Almanac\" />\n    <meta name=\"theme-color\" content=\"#455775\" />\n    <meta name=\"msapplication-navbutton-color\" content=\"#455775\" />\n    <meta name=\"apple-mobile-web-app-status-bar-style\" content=\"#455775\" />\n\n    <title>Growing Zucchini: How to Plant, Grow, and Harvest Zucchini &amp; Summer Squash | The Old Farmer&#039;s Almanac</title>\n    <meta charset=\"utf-8\" />\n<meta name=\"description\" content=\"Discover how to grow zucchini and summer squash like a pro! Learn planting, watering, pest prevention, and harvesting techniques to enjoy a bountiful squash harvest all summer long.\" />\n<link rel=\"canonical\" href=\"https://www.almanac.com/plant/zucchini\" />\n<meta name=\"robots\" content=\"index, follow\" />\n<link rel=\"icon\" href=\"/themes/almanaco/images/favicon.ico\" />\n<link rel=\"mask-icon\" href=\"/themes/almanaco/images/safari-pinned-tab.svg\" />\n<link rel=\"icon\" sizes=\"16x16\" href=\"/themes/almanaco/images/favicon-16x16.png\" />\n<link rel=\"icon\" sizes=\"32x32\" href=\"/themes/almanaco/images/favicon-32x32.png\" />\n<link rel=\"icon\" sizes=\"192x192\" href=\"/themes/almanaco/images/android-chrome-192x192.png\" />\n<link rel=\"apple-touch-icon\" href=\"/themes/almanaco/images/apple-touch-icon-60x60.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"76x76\" href=\"/themes/almanaco/images/apple-touch-icon-76x76.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"120x120\" href=\"/themes/almanaco/images/apple-touch-icon-120x120.png\" />\n<link rel=\"apple-touch-icon\" sizes=\"152x152\" href=\"/themes/almanaco/images/apple-touch-icon-152x152.png\" />\n<meta property=\"og:site_name\" content=\"Almanac.com\" />\n<meta property=\"og:type\" content=\"article\" />\n<meta property=\"og:url\" content=\"https://www.almanac.com/plant/zucchini\" />\n<meta property=\"og:title\" content=\"How to Grow Zucchini &amp; Summer Squash: Planting, Care &amp; Harvest Tips\" />\n<meta property=\"og:description\" content=\"Discover how to grow zucchini and summer squash like a pro! Learn planting, watering, pest prevention, and harvesting techniques to enjoy a bountiful squash harvest all summer long.\" />\n<meta property=\"og:image\" content=\"https://www.almanac.com/sites/default/files/styles/large/public/image_nodes/zucchini_sanny11_gettyimages_0.jpg?itok=xbseGbsl\" />\n<meta property=\"og:image:type\" content=\"image/jpeg\" />\n<meta property=\"og:image:width\" content=\"1205\" />\n<meta property=\"og:image:height\" content=\"800\" />\n<meta property=\"og:image:alt\" content=\"The Old Farmer&#039;s Almanac\" />\n<meta property=\"fb:admins\" content=\"100002198720176,500927460,687947151,1068201072\" />\n<meta property=\"fb:app_id\" content=\"180003315384377\" />\n<meta name=\"twitter:card\" content=\"summary_large_image\" />\n<meta name=\"twitter:title\" content=\"How to Grow Zucchini &amp; Summer Squash: Planting, Care &amp; Harvest Tips\" />\n<meta name=\"twitter:site\" content=\"@almanac\" />\n<meta name=\"Generator\" content=\"Drupal 11 (https://www.drupal.org)\" />\n<meta name=\"MobileOptimized\" content=\"width\" />\n<meta name=\"HandheldFriendly\" content=\"true\" />\n<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n<script>var ct_check_js_val = '8898c94f21d3ba0d17f2a06ffca1aa79';var drupal_ac_antibot_cookie_value = 'ca23a11e05e559b3cac9756b0aad182179cd21c898c5ed451f98170264753af2';var ct_use_cookies = 1;var ct_use_alt_cookies = 0;var ct_capture_buffer = 0;</script>\n<script type=\"application/ld+json\">{\n    \"@context\": \"https://schema.org\",\n    \"@graph\": [\n        {\n            \"@type\": \"Article\",\n            \"@id\": \"https://www.almanac.com/plant/zucchini\",\n            \"name\": \"How to Grow Zucchini \\u0026 Summer Squash: Planting, Care \\u0026 Harvest Tips\",\n            \"headline\": \"How to Grow Zucchini \\u0026 Summer Squash: Planting, Care \\u0026 Harvest Tips\",\n            \"description\": \"Discover how to grow zucchini and summer squash like a pro! Learn planting, watering, pest prevention, and harvesting techniques to enjoy a bountiful squash harvest all summer long.\",\n            \"datePublished\": \"2025-05-14T09:00:00-0400\",\n            \"dateModified\": \"2025-09-02T10:13:54-0400\",\n            \"isAccessibleForFree\": \"True\",\n            \"author\": {\n                \"@type\": \"Person\",\n                \"@id\": \"https://www.almanac.com/user/170691\",\n                \"name\": \"Catherine Boeckmann\",\n                \"url\": \"https://www.almanac.com/user/170691\"\n            },\n            \"publisher\": {\n                \"@type\": \"NewsMediaOrganization\",\n                \"@id\": \"https://www.almanac.com\",\n                \"name\": \"The Old Farmer\\u0027s Almanac\",\n                \"url\": \"https://www.almanac.com\",\n                \"logo\": {\n                    \"@type\": \"ImageObject\",\n                    \"representativeOfPage\": \"True\",\n                    \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\",\n                    \"width\": \"308\",\n                    \"height\": \"108\"\n                }\n            }\n        },\n        {\n            \"@type\": \"NewsMediaOrganization\",\n            \"additionalType\": \"Organization\",\n            \"@id\": \"https://www.almanac.com/\",\n            \"description\": \"The Old Farmer’s Almanac is your trusted source for long range weather forecasts, moon phases, full moon dates and times, gardening tips, sunrise and sunset times, Best Days, tide charts, home remedies, folklore, and more.\",\n            \"sameAs\": \"https://en.wikipedia.org/wiki/Old_Farmer%27s_Almanac\",\n            \"name\": \"The Old Farmer\\u0027s Almanac\",\n            \"url\": \"https://www.almanac.com/\",\n            \"telephone\": \"1-800-ALMANAC\",\n            \"contactPoint\": {\n                \"@type\": \"ContactPoint\",\n                \"telephone\": \"+1-800-256-2622\",\n                \"email\": \"support@almanac.com\",\n                \"url\": \"https://www.almanac.com/\",\n                \"contactType\": \"customer service\",\n                \"contactOption\": \"TollFree\",\n                \"productSupported\": \"The Old Farmer\\u0027s Almanac\"\n            },\n            \"logo\": {\n                \"@type\": \"ImageObject\",\n                \"representativeOfPage\": \"True\",\n                \"url\": \"https://www.almanac.com/themes/almanaco/logo.svg\"\n            }\n        }\n    ]\n}</script>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n    \n\n        \n\n    <link rel=\"preconnect\" href=\"https://fonts.googleapis.com\" crossorigin />\n  <link rel=\"preconnect\" href=\"https://fonts.gstatic.com\" crossorigin />\n  <link rel=\"preload\" as=\"style\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n\n    <link rel=\"modulepreload\" href=\"/themes/almanac/dist/js/scripts.js\">\n\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" media=\"print\" onload=\"this.media='all'\" />\n\n    <noscript>\n    <link rel=\"stylesheet\" href=\"https://fonts.googleapis.com/css2?family=Source+Serif+4:wght@400;600&family=Roboto+Condensed:wght@400;700&family=Lexend+Peta:wght@400&display=swap\" />\n  </noscript>\n\n        <style>\n      body {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n        margin: 0;\n        background-color: #ffffff;\n      }\n      h1, h2, h3, h4, h5 {\n        font-family: 'Source Serif 4', Georgia, serif;\n        color: #181616;\n      }\n      a {\n        color: #595974;\n        text-decoration: none;\n      }\n      a:hover {\n        color: #ad2a24;\n      }\n    </style>\n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/themes/almanac/dist/css/style.css?t4yh8p\" />\n\n  <script>window.freestar = { config: { enabled_slots: [] } };</script>\n\n    \n\n                                                                                                                  \n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  window.raptivetarget = {\n    tags: [],\n    category: \"\",\n    postType: \"plant\",\n    postId: 90299,\n    special: true\n  };\n\n  if (window.console && window.console.log) {\n    console.log('Raptive targeting configured:', window.raptivetarget);\n  }\n</script>\n\n<script data-no-optimize=\"1\" data-cfasync=\"false\">\n  (function(w, d) {\n    // Debug: Log that we're initializing AdThrive in head\n    if (w.console && w.console.log) {\n      w.console.log('Raptive: Initializing AdThrive script in head for path:', w.location.pathname);\n    }\n\n    w.adthrive = w.adthrive || {};\n    w.adthrive.cmd = w.adthrive.cmd || [];\n    w.adthrive.plugin = 'adthrive-ads-manual';\n    w.adthrive.host = 'ads.adthrive.com';\n\n    var s = d.createElement('script');\n    s.async = true;\n    s.setAttribute('referrerpolicy', 'no-referrer-when-downgrade');\n    s.src = 'https://' + w.adthrive.host + '/sites/6810e43f9a254b456fd9027c/ads.min.js?referrer=' + w.encodeURIComponent(w.location.href) + '&cb=' + (Math.floor(Math.random() * 100) + 1);\n\n    // Debug: Log script loading\n    s.onload = function() {\n      if (w.console && w.console.log) {\n        w.console.log('Raptive: AdThrive script loaded successfully');\n      }\n    };\n    s.onerror = function() {\n      if (w.console && w.console.error) {\n        w.console.error('Raptive: Failed to load AdThrive script');\n      }\n    };\n\n    var n = d.getElementsByTagName('script')[0];\n    n.parentNode.insertBefore(s, n);\n  })(window, document);\n</script>\n\n  \n</head>\n<body class=\"page-not-front page-type-content content-type-plant\">\n  <div class=\"region region--page-top\">\n    \n  </div>\n\n    <div class=\"dialog-off-canvas-main-canvas\" data-off-canvas-main-canvas>\n    <header id=\"page--header\" class=\"section--fullwidth\">\n  \n  <div id=\"region--store_banner\">\n  \n\n<div id=\"block-almanac-storesalebanner\" class=\"block block-block-content block-block-content9bb2b53c-bf24-46a9-96e3-8b872395f31e block--block-content9bb2b53c-bf24-46a9-96e3-8b872395f31e flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div class=\"text-align-center\" style=\"background-color:#ad2a24;padding-bottom:5px;padding-top:5px;width:100%;\"><div style=\"display:flex;justify-content:center;\"><a style=\"color:#fff;font-size:18px;\" href=\"https://store.almanac.com/pages/black-friday-cyber-monday?utm_campaign=OFA-Store-BlackFriday&amp;utm_content=top-banner\" target=\"_blank\">Shop Our Black Friday Sale at The Almanac Store →</a></div></div></p>\n      </div>\n      \n      </div>\n      </div>\n\n</div>\n\n\n    <section class=\"region--global-header flex flex-col sm:flex-row justify-between border-t-brick-red border-t-4 mb-8 text-sm px-4 shadow-sm\">\n  <div class=\"social-menu flex justify-center sm:justify-start\">\n\n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n<div class=\"global-menu flex justify-center sm:justify-end\">\n<a\n  href=\"/signup\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Get Almanac&#039;s Daily Updates\n</a>\n<a\n  href=\"/weather/longrange\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Extended Forecasts\n</a>\n<a\n  href=\"/wheretobuy\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Where to Buy\n</a>\n<a\n  href=\"/contact\"\n  class=\"global-menu-item p-2 pt-3  no-underline transition-colors duration-200 text-xs sm:text-sm\"\n>Contact Us\n</a>\n\n</div>\n\n</section>\n\n\n    \n\n<nav aria-label=\"Global\" class=\"nav section--container mb-4\">\n  \n    <div class=\"nav--logo\">\n    <a href=\"/\">\n      <span class=\"sr-only\">Almanac</span>\n      <img src=\"/themes/almanac/logo.svg\" alt=\"Almanac Logo\" width=\"309\" height=\"74\" class=\"no-bg\">\n    </a>\n    <a class=\"calendar no-underline\" href=\"/calendar/today\">\n      Sunday, November 2, 2025\n    </a>\n  </div>\n\n    <div class=\"nav--menu\">\n    <div class=\"flex flex-wrap md:justify-start md:flex-nowrap z-50 w-full transition-all duration-300\" data-nav-container>\n  <nav class=\"flex relative max-w-[85rem] w-full mx-auto md:flex md:items-center md:justify-between md:gap-3 py-2 px-4 sm:px-6 lg:px-8 transition-all duration-300\" data-nav>\n\n        <div class=\"nav-logo transition-all duration-300 flex flex-shrink-0\" data-nav-logo>\n      <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n        <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n      </a>\n    </div>\n\n        <div class=\"nav-breadcrumb transition-all duration-300 flex-1 flex justify-center min-w-0 invisible lg:visible\" data-nav-breadcrumb>\n      <nav class=\"breadcrumb\" role=\"navigation\" aria-label=\"Breadcrumb\">\n        <ol class=\"flex items-center space-x-1 md:space-x-2 rtl:space-x-reverse min-w-28\">\n                                                                               <li class=\"inline-flex items-center\">\n                                      <a href=\"/gardening\" class=\"no-underline uppercase font-sans text-xs text-gray-600 hover:text-brick-red\">Gardening</a>\n                                  </li>\n                                                         <li class=\"inline-flex items-center\">\n                                      <span class=\"uppercase font-sans text-xs text-gray-800\">Growing Guides</span>\n                                  </li>\n                                            </ol>\n      </nav>\n    </div>\n\n        <div class=\"flex items-center gap-x-1 flex-shrink-0\">\n            <button type=\"button\" class=\"menu-toggle md:hidden relative size-9 flex justify-center items-center font-medium text-[12px] border border-gray-200 text-gray-800 hover:bg-gray-100 focus:outline-none focus:bg-gray-100 disabled:opacity-50 disabled:pointer-events-none transition-all duration-300\" data-nav-toggle>\n        <svg class=\"menu-open-icon size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <line x1=\"3\" x2=\"21\" y1=\"6\" y2=\"6\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"12\" y2=\"12\"/>\n          <line x1=\"3\" x2=\"21\" y1=\"18\" y2=\"18\"/>\n        </svg>\n        <svg class=\"menu-close-icon hidden size-4\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n          <path d=\"M18 6 6 18\"/>\n          <path d=\"m6 6 12 12\"/>\n        </svg>\n        <span class=\"sr-only\">Toggle navigation</span>\n      </button>\n      \n            <div class=\"hidden md:flex items-center gap-x-1\">\n                                          <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Gardening\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/gardening\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        All Gardening \n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/planting-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Planting Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/frostdates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Frost Dates\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/growing-guides\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Growing Guides\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/gardening/pests-and-diseases\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Pests and Problems\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Calculators and Tools\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://gardenplanner.almanac.com/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Garden Planner\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Weather\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Weather Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/fall-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fall Forecast 2025\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Thanksgiving Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Winter Forecast 2025-2026\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/longrange\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        60-Day Long-Range Forecast\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/weather/forecast\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        5-Day Forecast\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Moon &amp; Sun\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/astronomy\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Astronomy Overview\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/full-moon-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Harvest Moon!\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moon Phase Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon/full\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Next Full Moon\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/sun-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Sunrise and Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/astronomy/moon-rise-and-set\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Moonrise &amp; Set Times\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        More Astronomy Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/meteor-shower-calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Meteor Showers\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/content/first-day-seasons\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Seasons\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Calendar\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/calendar\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        2025 Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Holidays and Events\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/calendar/tools\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Calendar Calculators\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/bestdays/timetable\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Best Days Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/best-fishing-days\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Fishing Calendar\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/monthly-horoscope-october\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        OCT Horoscope\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Mercury Retrograde Dates\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Food\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"/cooking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Find A Recipe\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        When to Harvest\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/cooking/preserving-food\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Canning and Pickling\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Grilling Recipes\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Baking\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                                                                <div class=\"menu-dropdown\">\n              <button type=\"button\" class=\"pr-2 menu-dropdown-toggle flex items-center text-sm text-gray-800 focus:outline-none focus:text-black focus:underline focus:underline-offset-4 hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red transition-all duration-300\" data-nav-item>\n                Store\n                <svg class=\"menu-dropdown-icon size-4 transition duration-300 ml-2\" xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                  <path d=\"m6 9 6 6 6-6\"/>\n                </svg>\n              </button>\n              <div class=\"menu-dropdown-menu hidden transition-opacity duration-150 opacity-0 absolute bg-white shadow-md rounded-md mt-1 z-50\">\n                <ul class=\"p-2 space-y-2\">\n                                      <li>\n                      <a href=\"https://store.almanac.com/garden/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Garden\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Weather\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Moon &amp; Sun\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Calendars\n                      </a>\n                    </li>\n                                      <li>\n                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"dropdown-item block px-4 py-2 text-sm text-gray-800  hover:text-black hover:underline hover:underline-offset-4 hover:decoration-brick-red no-underline\">\n                        Shop Food\n                      </a>\n                    </li>\n                                  </ul>\n              </div>\n            </div>\n                              \n                <div class=\"menu-item relative mt-1\" data-nav-search>\n          <form class=\"menu-item-form\" action=\"/search/site\" method=\"get\">\n            <input\n              name=\"search_api_fulltext\"\n              type=\"text\"\n              class=\"h-10 px-5 pr-10 w-12 md:w-12 transition-all duration-300\"\n              placeholder=\"Search...\"\n            />\n            <button type=\"submit\" class=\"absolute right-0 top-0 fill-black transition-all duration-300\">\n              <svg class=\"h-5 w-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n              </svg>\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n\n        <div id=\"menu-mobile\" class=\"mobile-menu\" data-nav-menu>\n      <div class=\"mobile-menu-content\">\n        <div class=\"mobile-menu-header\">\n          <div class=\"mobile-menu-logo\">\n            <a href=\"/\" class=\"flex-none focus:outline-none focus:opacity-80\">\n              <img src=\"/themes/almanac/images/almanac-logo-sun@0.1x.png\" alt=\"Almanac.com\" class=\"h-8 w-auto\">\n            </a>\n          </div>\n          <button type=\"button\" class=\"mobile-menu-close\" aria-label=\"Close menu\">\n            <svg class=\"size-6\" xmlns=\"http://www.w3.org/2000/svg\" fill=\"none\" viewBox=\"0 0 24 24\" stroke=\"currentColor\">\n              <path stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" d=\"M6 18L18 6M6 6l12 12\" />\n            </svg>\n          </button>\n        </div>\n\n        <nav class=\"mobile-menu-nav\">\n                                                  <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Gardening\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/gardening\" class=\"mobile-menu-link\">\n                      All Gardening \n                    </a>\n                                      <a href=\"/gardening/planting-calendar\" class=\"mobile-menu-link\">\n                      Planting Calendar\n                    </a>\n                                      <a href=\"/gardening/frostdates\" class=\"mobile-menu-link\">\n                      Fall Frost Dates\n                    </a>\n                                      <a href=\"/gardening/growing-guides\" class=\"mobile-menu-link\">\n                      Growing Guides\n                    </a>\n                                      <a href=\"/gardening/pests-and-diseases\" class=\"mobile-menu-link\">\n                      Pests and Problems\n                    </a>\n                                      <a href=\"/garden-calculators-and-tools-plan-your-best-garden\" class=\"mobile-menu-link\">\n                      Garden Calculators and Tools\n                    </a>\n                                      <a href=\"https://gardenplanner.almanac.com/\" class=\"mobile-menu-link\">\n                      Garden Planner\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Weather\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/weather\" class=\"mobile-menu-link\">\n                      Weather Overview\n                    </a>\n                                      <a href=\"/fall-weather-forecast\" class=\"mobile-menu-link\">\n                      Fall Forecast 2025\n                    </a>\n                                      <a href=\"https://www.almanac.com/november-weather-forecast\" class=\"mobile-menu-link\">\n                      Thanksgiving Forecast\n                    </a>\n                                      <a href=\"/winter-extended-forecast-farmers-almanac\" class=\"mobile-menu-link\">\n                      Winter Forecast 2025-2026\n                    </a>\n                                      <a href=\"/weather/longrange\" class=\"mobile-menu-link\">\n                      60-Day Long-Range Forecast\n                    </a>\n                                      <a href=\"/weather/forecast\" class=\"mobile-menu-link\">\n                      5-Day Forecast\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Moon &amp; Sun\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/astronomy\" class=\"mobile-menu-link\">\n                      Astronomy Overview\n                    </a>\n                                      <a href=\"/content/full-moon-october\" class=\"mobile-menu-link\">\n                      OCT Harvest Moon!\n                    </a>\n                                      <a href=\"/astronomy/moon/calendar\" class=\"mobile-menu-link\">\n                      Moon Phase Calendar\n                    </a>\n                                      <a href=\"/astronomy/moon/full\" class=\"mobile-menu-link\">\n                      Next Full Moon\n                    </a>\n                                      <a href=\"/astronomy/sun-rise-and-set\" class=\"mobile-menu-link\">\n                      Sunrise and Set Times\n                    </a>\n                                      <a href=\"/astronomy/moon-rise-and-set\" class=\"mobile-menu-link\">\n                      Moonrise &amp; Set Times\n                    </a>\n                                      <a href=\"https://www.almanac.com/astronomy-calculators-and-tools-explore-night-sky\" class=\"mobile-menu-link\">\n                      More Astronomy Calculators\n                    </a>\n                                      <a href=\"/content/meteor-shower-calendar\" class=\"mobile-menu-link\">\n                      Meteor Showers\n                    </a>\n                                      <a href=\"/content/first-day-seasons\" class=\"mobile-menu-link\">\n                      Seasons\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Calendar\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/calendar\" class=\"mobile-menu-link\">\n                      2025 Calendar\n                    </a>\n                                      <a href=\"https://www.almanac.com/topics/calendar/holidays\" class=\"mobile-menu-link\">\n                      Holidays and Events\n                    </a>\n                                      <a href=\"/topics/calendar/tools\" class=\"mobile-menu-link\">\n                      Calendar Calculators\n                    </a>\n                                      <a href=\"/bestdays/timetable\" class=\"mobile-menu-link\">\n                      Best Days Calendar\n                    </a>\n                                      <a href=\"/best-fishing-days\" class=\"mobile-menu-link\">\n                      Fishing Calendar\n                    </a>\n                                      <a href=\"/monthly-horoscope-october\" class=\"mobile-menu-link\">\n                      OCT Horoscope\n                    </a>\n                                      <a href=\"https://www.almanac.com/content/mercury-retrograde-dates\" class=\"mobile-menu-link\">\n                      Mercury Retrograde Dates\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Food\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"/cooking\" class=\"mobile-menu-link\">\n                      Find A Recipe\n                    </a>\n                                      <a href=\"https://www.almanac.com/when-harvest-vegetables-and-fruit-best-flavor\" class=\"mobile-menu-link\">\n                      When to Harvest\n                    </a>\n                                      <a href=\"/cooking/preserving-food\" class=\"mobile-menu-link\">\n                      Canning and Pickling\n                    </a>\n                                      <a href=\"/easy-grilling-recipes-and-10-tips-grilling-success\" class=\"mobile-menu-link\">\n                      Grilling Recipes\n                    </a>\n                                      <a href=\"/topics/cooking-recipes/method/baking\" class=\"mobile-menu-link\">\n                      Baking\n                    </a>\n                                  </div>\n              </div>\n                                                              <div class=\"mobile-menu-dropdown\">\n                <button type=\"button\" class=\"mobile-menu-dropdown-toggle\">\n                  Store\n                  <svg class=\"mobile-menu-dropdown-icon\" xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\">\n                    <path d=\"m6 9 6 6 6-6\"/>\n                  </svg>\n                </button>\n                <div class=\"mobile-menu-dropdown-content\">\n                                      <a href=\"https://store.almanac.com/garden/\" class=\"mobile-menu-link\">\n                      Shop Garden\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/watching-the-weather\" class=\"mobile-menu-link\">\n                      Shop Weather\n                    </a>\n                                      <a href=\"https://store.almanac.com/moon-sun/\" class=\"mobile-menu-link\">\n                      Shop Moon &amp; Sun\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/calendars\" class=\"mobile-menu-link\">\n                      Shop Calendars\n                    </a>\n                                      <a href=\"https://store.almanac.com/collections/farmers-pantry\" class=\"mobile-menu-link\">\n                      Shop Food\n                    </a>\n                                  </div>\n              </div>\n                      \n                    <div class=\"mobile-menu-search\">\n            <form class=\"search-form\" action=\"/search/site\" method=\"get\">\n              <input\n                name=\"search_api_fulltext\"\n                type=\"text\"\n                class=\"search-input\"\n                placeholder=\"Search...\"\n              />\n              <button type=\"submit\" class=\"search-button\">\n                <svg class=\"size-5\" xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 20 20\">\n                  <path d=\"M12.9 14.32a8 8 0 1 1 1.41-1.41l5.35 5.33-1.42 1.42-5.33-5.34zM8 14A6 6 0 1 0 8 2a6 6 0 0 0 0 12z\"></path>\n                </svg>\n              </button>\n            </form>\n          </div>\n        </nav>\n      </div>\n    </div>\n      </nav>\n</div>\n<!-- Nav spacer to prevent layout shift when sticky nav appears -->\n<div class=\"nav-spacer\" aria-hidden=\"true\" style=\"height:0;\"></div>\n\n  </div>\n\n</nav>\n\n\n  </header>\n\n<main id=\"content\" class=\"section--container\">\n    <div>\n    \n\n<div id=\"block-almanac-breadcrumbs\" class=\"block block-system block-system-breadcrumb-block block--system-breadcrumb-block flex flex-col w-full\">\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n          <nav role=\"navigation\" aria-labelledby=\"system-breadcrumb\">\n    <h2 id=\"system-breadcrumb\" class=\"visually-hidden\">Breadcrumb</h2>\n    <ol>\n          <li>\n                  <a href=\"/\">Home</a>\n              </li>\n          <li>\n                  <a href=\"/gardening\">Gardening</a>\n              </li>\n          <li>\n                  <a href=\"/gardening/growing-guides\">Growing Guides</a>\n              </li>\n        </ol>\n  </nav>\n\n      </div>\n      </div>\n\n  </div>\n\n  \n\n  <section class=\"layout layout--onecol\">\n    \n      <div>\n    \n\n<div id=\"block-almanac-page-title\" class=\"block block-core block-page-title-block block--page-title-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n<h1 class=\"page-title\">      <span class=\"field field--name-title field--type-string field--label-hidden\">How to Grow Zucchini &amp; Summer Squash: Planting, Care &amp; Harvest Tips</span>\n  </h1>\n\n      </div>\n      </div>\n\n\n<div id=\"block-almanac-content\" class=\"block block-system block-system-main-block block--system-main-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n\n<article data-history-node-id=\"90299\" class=\"node node--type-plant node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: true\n    Is front: false\n    View mode: full\n    Node type: plant\n    Node ID: 90299\n    Current path: /plant/zucchini\n    -->\n\n                  \n                    \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n      <div class=\"layout layout--twocol-section layout--twocol-section--75-25 plant-info\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-imageprimary block--field-blocknodeplantfield-imageprimary flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-imageprimary field--type-entity-reference field--label-hidden field__item\">\n\n\n\n<article data-history-node-id=\"125129\" class=\"node node--type-image node--view-mode-full\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: full\n    Node type: image\n    Node ID: 125129\n    Current path: /plant/zucchini\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/or/public/image_nodes/zucchini_sanny11_gettyimages_0.jpg?itok=slAM6jJG\" width=\"1186\" height=\"667\" alt=\"\" class=\"image-style-or\" />\n\n\n</div>\n          </div>\n  \n  <div class=\"field field--name-field-credit field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Photo Credit</div>\n              <div class=\"field__item\">Getty Images</div>\n          </div>\n\n  </div>\n\n  </article>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"botanical-name block block-layout-builder block-field-blocknodeplantfield-botanicalname block--field-blocknodeplantfield-botanicalname flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-botanicalname field--type-string field--label-inline clearfix\">\n    <div class=\"field__label\">Botanical Name</div>\n              <div class=\"field__item\">Cucurbita spp.</div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-plant-type-term block--field-blocknodeplantfield-plant-type-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-plant-type-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Plant Type</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/type/vegetables\" hreflang=\"en\">Vegetables</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-sun-exposure-term block--field-blocknodeplantfield-sun-exposure-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-sun-exposure-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Sun Exposure</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/sun/full-sun\" hreflang=\"en\">Full Sun</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-soil-ph-term block--field-blocknodeplantfield-soil-ph-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-soil-ph-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Soil pH</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/ph/slightly-acidic-neutral\" hreflang=\"en\">Slightly Acidic to Neutral</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-bloom-time-term block--field-blocknodeplantfield-bloom-time-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-bloom-time-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Bloom Time</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/blooms/summer\" hreflang=\"en\">Summer</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-flower-color-term block--field-blocknodeplantfield-flower-color-term flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-flower-color-term field--type-entity-reference field--label-inline clearfix\">\n    <div class=\"field__label\">Flower Color</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/plants/color/orange\" hreflang=\"en\">Orange</a></div>\n          <div class=\"field__item\"><a href=\"/plants/color/yellow\" hreflang=\"en\">Yellow</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-sponsorship-program block--field-blocknodeplantfield-sponsorship-program flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-sponsorship-program field--type-list-string field--label-hidden field__item\">Cummins</div>\n      \n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-subhead block--field-blocknodeplantfield-subhead flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-subhead field--type-string field--label-visually_hidden\">\n    <div class=\"field__label visually-hidden\">Subhead</div>\n              <div class=\"field__item\"><h2>Planting, Growing, and Harvesting Zucchini &amp; Summer Squash</h2>\n</div>\n          </div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33\">\n\n          <div  class=\"layout__region layout__region--first\">\n        <div class=\"author-line-block\">\n        <div class=\"author-line\">\n      <span class=\"author-label\">Written By:</span>\n      <span class=\"author-name\"><a href=\"/author/catherine-boeckmann\" hreflang=\"en\">Catherine Boeckmann</a></span>\n                                <span class=\"author-title\">Executive Digital Editor and Master Gardener</span>\n                  </div>\n  \n    </div>\n\n\n<div class=\"date_line block block-layout-builder block-field-blocknodeplantchanged block--field-blocknodeplantchanged flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-changed field--type-changed field--label-hidden field__item\"><time datetime=\"2025-09-02T10:13:54-04:00\" class=\"datetime\">September 2, 2025</time>\n</div>\n      \n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-almanac-share block-almanac-share-block block--almanac-share-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n<div class=\"mt-8 pt-6\">\n  \n    <div class=\"share-component\"\n       data-share-title=\"How to Grow Zucchini &amp; Summer Squash: Planting, Care &amp; Harvest Tips\"\n       data-share-text=\"Check out this great content from The Old Farmer&#039;s Almanac!\"\n       data-share-url=\"https://www.almanac.com/plant/zucchini\"\n       data-share-hashtags=\"almanac\"\n       data-share-via=\"oldfarmersalmanac\"\n       data-print-service=\"printfriendly\">\n\n    <div class=\"share-component--buttons\">\n            <div class=\"share-toggle-container\">\n                <button type=\"button\" class=\"share-toggle\" aria-label=\"Share this content\">\n          <svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 24 24\" fill=\"currentColor\">\n            <path d=\"M18 16.08c-.76 0-1.44.3-1.96.77L8.91 12.7c.05-.23.09-.46.09-.7s-.04-.47-.09-.7l7.05-4.11c.54.5 1.25.81 2.04.81 1.66 0 3-1.34 3-3s-1.34-3-3-3-3 1.34-3 3c0 .24.04.47.09.7L8.04 9.81C7.5 9.31 6.79 9 6 9c-1.66 0-3 1.34-3 3s1.34 3 3 3c.79 0 1.5-.31 2.04-.81l7.12 4.16c-.05.21-.08.43-.08.65 0 1.61 1.31 2.92 2.92 2.92s2.92-1.31 2.92-2.92-1.31-2.92-2.92-2.92z\"/>\n          </svg>\n          <span>Share</span>\n        </button>\n\n                <div class=\"share-social-buttons\">\n                  </div>\n      </div>\n    </div>\n  </div>\n</div>\n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 content-area\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"newsletter-incontent block block-listrak block-listraksubscribe-block block--listraksubscribe-block flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--listraksubscribe-block font-normal mt-0\">\n      Sign up for daily gardening advice and tips\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n\n<form class=\"listrak-form-subscribe\" data-drupal-selector=\"listrak-form-subscribe\" action=\"/plant/zucchini\" method=\"post\" id=\"listrak-form-subscribe\" accept-charset=\"UTF-8\">\n  <div class=\"js-form-item form-item js-form-type-email form-item-email js-form-item-email form-no-label\">\n      <label for=\"edit-email\" class=\"visually-hidden js-form-required form-required\">Email Address</label>\n          <input placeholder=\"Enter your email address\" data-drupal-selector=\"edit-email\" type=\"email\" id=\"edit-email\" name=\"email\" value=\"\" size=\"60\" maxlength=\"254\" class=\"form-email required\" required=\"required\" />\n\n        </div>\n  <input data-drupal-selector=\"edit-submit\" type=\"submit\" id=\"edit-submit\" name=\"op\" value=\"Sign Up\" class=\"button button--primary js-form-submit form-submit\" />\n  <input autocomplete=\"off\" data-drupal-selector=\"form-di2tadd0bplf-dydmchahcrtyz106ad-vnc9pzuvvm4\" type=\"hidden\" name=\"form_build_id\" value=\"form-Di2taDd0bPlF-DyDMcHAHCrtYz106ad-vNC9pZuVVM4\" />\n  <input data-drupal-selector=\"edit-listrak-form-subscribe\" type=\"hidden\" name=\"form_id\" value=\"listrak_form_subscribe\" />\n\n</form>\n\n\n\n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-2 block--views-blockpost-roll-promotion-block-2 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-body block--field-blocknodeplantfield-body flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-field-body field--type-text-long field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                \n        <p>Ever found a giant zucchini hiding under a leaf like it’s trying to win “Vegetable Hide-and-Seek”? You’re not alone. Zucchini and summer squash are famously productive—and delightfully sneaky! Whether you’re dreaming of crispy sautéed slices or a freezer full of zucchini bread, this guide will walk you through growing these summer staples from seed to squash. Get ready for a harvest that just might overrun your kitchen (in the best&nbsp;way).</p><h2>About&nbsp;Zucchini</h2><p>Note that squash is generally divided into two categories: summer squash (harvested in summer) and <a href=\"https://www.almanac.com/plant/winter-squash\">winter squash</a> (harvested in autumn). The skin of summer squash is edible, unlike the skin of winter squash.&nbsp;<span style=\"background-color:transparent;line-height:20.3999996185303px;\">Most summer squashes now come in bush varieties, which take up&nbsp;less space, whereas winter squashes are&nbsp;vining&nbsp;plants that need more&nbsp;space.&nbsp;</span></p><p>Zucchini are warm-season crops with compact, bushy, or trailing varieties to pick from. Compact types are suitable for containers—indeed, anywhere you don’t have a lot of space—while trailing types may be trained as climbers to grow up supports such as a trellis or wire&nbsp;mesh.</p><p><a class=\"text-button\" href=\"https://amzn.to/42Q71Ji\" target=\"_blank\" rel=\"nofollow\">Buy Seeds&nbsp;Now</a></p><p>Green zucchini are always going to be popular, but try a few of their more charismatic cousins as well, including varieties with yellow fruits, striped or ribbed fruits, and even round&nbsp;fruits.</p><p>This guide focuses on summer squash. Summer squash varieties include&nbsp;<strong>zucchini</strong>, <strong>yellow squash</strong> (straightneck squash), and <a href=\"https://amzn.to/44aihCu\"><strong>crookneck squash</strong></a>. Note:&nbsp;<span style=\"background-color:transparent;line-height:20.3999996185303px;\">All types of summer squash require very similar care, so even though we mainly refer to zucchini on this page, consider it to be applicable to whatever summer squash variety you’re&nbsp;growing!</span></p><p>Zucchini is a vigorous grower.<span style=\"font-size:1.125rem;\"> While each plant will produce several squash during peak season, you’ll typically find that one or two zucchini plants will produce a “bumper” (unusually large) crop,&nbsp;leaving you to give the squash away to neighbors or bake lots of zucchini&nbsp;bread!</span></p><figure role=\"group\">\n<img alt=\"zucchini squash growing in a garden\" data-entity-type=\"file\" data-entity-uuid=\"c7175786-615d-479b-8f51-ad21d34e8f45\" height=\"1333\" src=\"/sites/default/files/images/zucchini%20alvintus%20GettyImages.jpg\" width=\"2000\" loading=\"lazy\">\n<figcaption><em>Image: Alvintus/Getty Images</em></figcaption>\n</figure>\n</p>\n      </div>\n      \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-2 block--views-blockmore-like-this-block-2 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-2 font-normal mt-0\">\n      Read Next\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-97f3c25127871946a062a13f77715e0d0dccfed523ff61c45283932584dd457c\">\n  \n  \n  \n\n  \n  \n  \n\n  <div class=\"item-list\">\n  \n  <ul>\n\n          <li><div class=\"views-field views-field-title\"><a href=\"/plant/cucumbers\" hreflang=\"und\">How to Grow Cucumber Plants: Easy Guide to Planting &amp; Harvesting</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/vertical-garden\" hreflang=\"und\">How to Plan a Vertical Garden: Space-Saving Tips &amp; Design Ideas</a></div></li>\n          <li><div class=\"views-field views-field-title\"><a href=\"/favorite-winter-squash-varieties\" hreflang=\"und\">5 Favorite Winter Squash Varieties for Cooking</a></div></li>\n    \n  </ul>\n\n</div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-planting block--field-blocknodeplantfield-planting flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-planting field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Planting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \n        <p>Zucchini are members of the squash family, so they need to be bathed in warmth and sunshine to thrive. Shelter them from strong winds, too, so bees and other insects can go about pollinating the flowers in&nbsp;peace.</p><p>Pick a location with full sun, shelter from the wind for good pollination, and soil that is moist (not soggy) and well-draining. Squash also produces nicely if well-fed. Mix aged manure and/or compost into the soil before planting.&nbsp;<span style=\"font-size:1.125rem;\">Learn more about </span><a style=\"font-size:1.125rem;\" href=\"https://www.almanac.com/content/preparing-soil-planting\">preparing soil for planting</a><span style=\"font-size:1.125rem;\">.</span></p><p>Their robust growth and big leaves make them hungry feeders. Add plenty of garden compost or well-rotted manure to the soil before planting. In fact, you can even plant zucchini on top of a compost heap—if you won’t be needing it till fall, that&nbsp;is.</p><p>Or prepare planting pockets: a few weeks before planting, dig out a hole, fill it with compost, then return some of the soil, along with a handful of organic fertilizer. The nutrient-rich filling will prove a veritable feast for the plants growing in&nbsp;it!</p><h3>When to Plant&nbsp;Zucchini</h3><ul><li>Wait to plant seeds or transplants in the ground until the soil is at least 65° to 70°F. This may be mid-spring for some regions, but often, it&#8217;s fine to plant by late spring.&nbsp;(Don&#8217;t start too early, as the seeds will not germinate in the cold, and you&#8217;ll do the plant no&nbsp;favors.)</li><li>Direct-sow seeds (i.e., directly into the ground) when all danger of frost has passed, and the air and soil are at least&nbsp;60ºF. See your&nbsp;<a href=\"https://www.almanac.com/gardening/frostdates\">last frost date</a>.</li><li>If you wish to start seeds indoors, start seeds in peat pots 2 to 4 weeks before your last spring frost; note that squash seedlings do not always transplant well; handle the roots gently. Fill pots or plug trays with potting mix and sow one seed per pot or plug on its edge. They will germinate quickest with a little warmth, but so long as you can guarantee a frost-free environment, they’ll eventually push&nbsp;through.</li><li>Warm the soil with black plastic and mulch once the soil has been prepared in early&nbsp;spring.</li><li><span style=\"background-color:transparent;\">Do not rush to plant zucchini. Consider planting a few seeds in midsummer to avoid problems from&nbsp;squash vine borers and other early-season&nbsp;</span><a href=\"https://www.almanac.com/gardening/pests-and-diseases\"><span style=\"background-color:transparent;\">pests and diseases</span></a><span style=\"background-color:transparent;\">.</span></li></ul><h3>How to Plant&nbsp;Zucchini</h3><ul><li>Direct sow seeds in level ground 1 inch deep and 2 to 3 inches&nbsp;apart.</li><li>Or, sow 3 or 4 seeds close together in small mounds (or hills; the soil is warmer off the ground) in rows 3 to 6 feet&nbsp;apart.</li><li>If necessary, use row covers, or plastic milk jugs, or&nbsp;<a href=\"https://www.almanac.com/content/how-build-cold-frame\">cold frame protection</a>&nbsp;in cold climates for the first few weeks of&nbsp;spring.</li><li>Thoroughly water after&nbsp;planting.</li><li>Adding a layer on top of <a href=\"https://www.almanac.com/news/gardening/gardening-advice/types-mulch-advantages-and-disadvantages-mulching\">mulch</a>&nbsp;(such as garden compost) to&nbsp;lock in soil&nbsp;moisture.</li><li>You can also sow into seed flats or trays to separate out and pot on after germination. Do this as soon after germination, as you’re able to handle the seedlings before the roots become entangled. Fill your pots and, holding the seedling by its leave, not the stem, feed in the potting mix around the sides. Firm in and&nbsp;water.</li></ul><p><strong>See our video showing how to grow the perfect zucchini every&nbsp;time!</strong></p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/J5bLTDQK2Bg?si=ysb3nSG2OBgQojFi\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"></iframe> &nbsp;</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-care block--field-blocknodeplantfield-care flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-care field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Growing</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                      \n        <ul><li>Mulch to discourage weeds, retain moisture, and protect shallow&nbsp;roots.</li><li>Zucchini thrive in moist soil. Water thoroughly, frequently, and consistently, with at least 1 inch per week. Water diligently when fruit form and throughout their growth cycle. <span style=\"background-color:transparent;\">The soil needs to be moist 4 inches down, so long soakings are best.&nbsp;</span>Misshapen squash results from inadequate water or&nbsp;fertilization.</li><li>Keep your zucchini well-watered, and top up mulches occasionally to help lock in soil moisture for longer. Plants tend to produce only male flowers at first, and pollination can also be slow to start, particularly in cool or damp&nbsp;weather.</li><li>Remove any weeds that manage to poke through.&nbsp;To keep plants tidy, cut off any dead or shriveling weeds. Top up mulches, using organic matter, such as garden compost, to help roots stay cool and&nbsp;moist.</li><li>When the first blooms appear, side-dress with a balanced&nbsp;fertilizer.</li><li>Poor pollination by bees can be an issue. If not pollinated, squash flowers will not bear fruit or will only bear small fruit. Most squash plants produce both male (these appear first, on long thin stalks) and female flowers (these have an immature fruit behind them). To fruit, pollen from the male flowers must be transferred to the female flowers by bees—or by the gardener. Pollinate the female flowers manually with a cotton swab or add plants that attract bees near the&nbsp;squash.</li></ul><h3>Growing Zucchini and Summer Squash in&nbsp;Containers</h3><p>The ever-increasing numbers of compact varieties suited for containers provide options for any taste and space. Bush plants are generally better suited to containers, but in a large pot with space to spread, vining squashes can produce a successful&nbsp;harvest.</p><p>Prepare a 5-gallon or 14-inch-diameter pot with rich potting mix for each variety of squash that you want to grow. When the soil temperature reaches around 70°F, or 2 weeks after the last frost date, direct-sow two seeds of the same variety 1 inch deep into the container and water to dampen. (Transplant homegrown or purchased seedlings if you want to jump-start the growing season.) Following germination, remove the weaker plant by cutting its stem; this is less disturbing to the roots. Water regularly to keep the soil moist. If you’re growing vining squashes, insert a trellis into the container for the plant to climb&nbsp;later.</p><p>About 6 weeks after the seeds have been planted, apply fertilizer. After the first true leaves appear (those after the initial two), apply a slow-release pellet fertilizer, according to the label’s directions. Follow up with a weekly dose of balanced fertilizer, based on the label’s guidance for the pot size. When watering, avoid getting water on the leaves. Water the soil 1 inch per week directly or set the container in a bucket or tub of water and allow it to be absorbed. As the plants grow, train the vines (if that type) onto a trellis or other support. Use string to gently secure&nbsp;them.</p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"plain-text block block-layout-builder block-field-blocknodeplantfield__recommended block--field-blocknodeplantfield__recommended flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field__recommended field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Types</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <ul><li><strong>‘Cashflow’:</strong> cylindrical zucchini&nbsp;type</li><li><strong>‘Cocozella (di Napoli)’:&nbsp;</strong>zucchini heirloom; dark green,&nbsp;slender</li><li><strong>‘Goldbar’:</strong> yellow summer&nbsp;squash</li><li><strong>‘Horn of Plenty’:</strong> yellow crookneck&nbsp;type</li><li><strong>‘Sunburst’:</strong> pattypan/scallop&nbsp;type</li><li><strong>‘Tigress’:</strong> zucchini&nbsp;type</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-harvest block--field-blocknodeplantfield-harvest flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-harvest field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Harvesting</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                      \n        <p>Harvest summer squash when tender and a bit immature (6 to 8 inches long) for more flavor. Believe us, oversize squash has very little taste. Many people wait too long to harvest. If you have ever had a negative experience with zucchini before, it’s probably because they were left to become&nbsp;bruisers.</p><ul><li>Most varieties average 60 days to maturity, and are ready as soon as a week after flowering. (Check the seed packet for more exact&nbsp;information.)</li><li>Cut (do not break) fruit off the vine with a sharp knife, or you risk damaging the soft stem of the plant. Leave at least 1 inch of stem on the&nbsp;fruit.</li><li>To slow production, harvest fruit when small and/or remove male&nbsp;flowers.</li><li>If the harvest is interrupted (say, by your vacation), remove large squash on your return to reduce demands on the plants for moisture and&nbsp;nutrients.</li><li>Complete the harvest before the first fall frost; summer squash is highly susceptible to frost and heat&nbsp;damage.</li></ul><p>In fact, the flowers make good eating too, typically stuffed or simply battered and then fried. But only pick the male flowers—the ones without a bulge behind them—or else you won’t get any&nbsp;fruit!</p><h3>How to Store&nbsp;Zucchini</h3><ul><li>Fresh summer squash has a relatively short shelf life. Store unwashed zucchini in a plastic or paper bag with one end open to encourage air circulation, and pop them in the refrigerator crisper drawer. They’ll keep for 10&nbsp;days.</li><li>Too much zucchini? Freeze it! It will keep for 3 months.&nbsp;<a href=\"https://www.almanac.com/too-much-zucchini-freeze-it\">See how to blanch and store zucchini in the freezer</a>!</li></ul><p><img src=\"/sites/default/files/users/AlmanacStaffArchive/zucchini-1642621_1920_full_width.jpg\" alt=\"zucchini blossoms\" width=\"720\" height=\"480\" loading=\"lazy\"></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n<div class=\"recommender-title block block-block-content block-block-contente8acfdbd-8aa8-4a11-9e44-f56cad64ee7a gardening-recommendations print-no\">\n  \n      <h2 class=\"block__title category-heading\">Gardening Products</h2>\n    \n\n  <div class=\"block__content\">\n    <div class=\"gardening-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"49397b29-784d-45ad-ba5f-2ca9659c9feb\">\n    <script type=\"text/html\">\n       var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\" style=\"width: 32%\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div></p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-pests block--field-blocknodeplantfield-pests flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-pests field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Pests/Diseases</h2>\n              <div class=\"field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n        <p>Zucchini produces well, but you <span class=\"caps\">MUST</span> keep an eye on the plant for pests. If you ignore zucchini, the pests will come, but you must get ahead of them before they&nbsp;arrive.</p><p><strong>Pests</strong><br>Two troublemakers often pay an unwelcome visit, usually early in the&nbsp;season.&nbsp;</p><ol><li><a href=\"https://www.almanac.com/pest/squash-bugs\"><strong>Squash bugs</strong></a> feed on sap, weakening plants and threatening fruit production. Protect plants when the bugs are most active, early on in the summer, by using row covers or fleece. Then continue to check for eggs at least twice a week. Rub or scrape off the eggs.&nbsp;Adult bugs can be knocked or shaken off plants into a bucket of soapy water. (If you keep chickens, offer them a&nbsp;treat!)</li><li><a href=\"https://www.almanac.com/pest/squash-vine-borers\"><strong>Squash vine borers</strong></a>&nbsp;are found in the eastern half of North America. They burrow into stems, causing them to rot and foliage to wilt. They are most active earlier in the summer. Row covers can help keep them off, or wrap stems in foil to prevent eggs from being laid at the base of plants. It&#8217;s possible to cut the grubs out by making vertical cuts into the stem using a sharp knife. Once you&#8217;re done, bury the stem with moist soil to encourage new&nbsp;roots.</li></ol><p>Here&#8217;s a helpful squash borer tip from reader James W: “No prevention is perfect. What I do is to start another zucchini indoors for planting after July 1st in Zone 5. The squash borer has completed her egg laying by then, and the rest of the summer is uneventful, to the zuke at&nbsp;least.”</p><p><strong>Diseases</strong></p><ol><li>As far as diseases go,&nbsp;<a href=\"https://www.almanac.com/news/gardening/gardening-advice/powdery-mildew-remedies-plants\"><strong>powdery mildew</strong></a> can be an issue on the leaves later&nbsp;in the season. It&#8217;s a&nbsp;common fungal disease that forms a white powdery coating on both sides of leaves. Usually, growth stalls. A common reason for powdery mildew is irregular watering, so stay consistent. If plants do become infected, remove affected leaves immediately. A great way to prevent powdery mildew altogether is to mist leaves with a solution that is 1/3 milk and 2/3 water.&nbsp;Spray the milky mixture onto all surfaces—early, on a dry and sunny day. Repeat every 10 to 14 days throughout the growing&nbsp;season.</li><li><a href=\"https://www.almanac.com/pest/blossom-end-rot\"><strong>Blossom-end rot</strong></a><strong>&nbsp;</strong>is an occasional issue as well. If&nbsp;the blossom ends of your squash turn black and rot, then your squash have blossom-end rot. This condition is caused by uneven soil moisture levels, often by wide fluctuations between wet and dry soil. Uneven watering affects the calcium levels of the fruit. To correct the problem, water deeply and apply a thick mulch over the soil surface to keep evaporation at a minimum. Keep the soil evenly moist like a wrung-out sponge, not wet and not completely dried&nbsp;out.</li></ol><p><strong>Watch this excellent video for tips and tricks to sidestep common squash problems so there’s no barrier to your successful&nbsp;harvest!</strong></p><div class=\"youtube-container\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"405\" src=\"https://www.youtube.com/embed/BZt6iEapuE4\" width=\"720\"></iframe></div></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"body-ad-wrapper block block-layout-builder block-field-blocknodeplantfield-wit-and-wisdom block--field-blocknodeplantfield-wit-and-wisdom flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-wit-and-wisdom field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Wit and Wisdom</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <ul><li>The word “squash” derives from <em>askutasquash</em>, the Narragansett Native American word meaning “eaten raw or&nbsp;uncooked.”</li><li>So-called squash bees—<em>Peponapis</em> and <em>Xenoglossa</em>—are excellent pollinators, especially for zucchini. Look for them among the flowers in the first few hours after&nbsp;sunrise.</li><li>Squash is technically a fruit because it contains the plant’s seeds, but for culinary purposes, it is treated as a&nbsp;vegetable.</li><li>August 8 is <a href=\"https://www.almanac.com/zucchini-fertility-spawns-annual-holiday\">National Sneak Some Zucchini on Your Neighbor&#8217;s Porch Day</a>!</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-recipes block--field-blocknodeplantfield-recipes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-recipes field--type-entity-reference field--label-above\">\n    <div class=\"field__label\">Recipes</div>\n          <div class=\"field__items\">\n              <div class=\"field__item\"><a href=\"/recipe/zucchini-bread\" hreflang=\"und\">Zucchini Bread</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/summer-squash-pickles\" hreflang=\"und\">Summer Squash Pickles</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/zucchini-brownies\" hreflang=\"und\">Zucchini Brownies</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/lemon-zucchini-muffins\" hreflang=\"und\">Lemon-Zucchini Muffins</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/zucchini-pancakes\" hreflang=\"und\">Zucchini Pancakes</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/zucchini-relish\" hreflang=\"und\">Zucchini Relish</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/fresh-tomato-and-zucchini-au-gratin\" hreflang=\"und\">Fresh Tomato and Zucchini Au Gratin</a></div>\n          <div class=\"field__item\"><a href=\"/recipe/breaded-fried-zucchini-rounds\" hreflang=\"und\">Breaded Fried Zucchini Rounds</a></div>\n              </div>\n      </div>\n\n      </div>\n      </div>\n\n\n<div class=\"block block-layout-builder block-field-blocknodeplantfield-cooking-notes block--field-blocknodeplantfield-cooking-notes flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n  <div class=\"field field--name-field-cooking-notes field--type-text-long field--label-above clearfix text-formatted\">\n    <h2 class=\"field__label\">Cooking Notes</h2>\n              <div class=\"field__item\">\n                \n                                                                                                            \n        <ul><li>Zucchini can be overwhelming once it starts producing. While zucchini bread is great, there are many other ways to enjoy this summer squash! See our&nbsp;<a href=\"https://www.almanac.com/content/best-zucchini-recipes-15-favorites\">Best Zucchini Recipes</a>.</li><li>Squash flowers are edible and make a tasty treat when fried in a light&nbsp;batter.</li></ul></p>\n      </div>\n          </div>\n\n      </div>\n      </div>\n\n\n<div class=\"topic_links block block-layout-builder block-field-blocknodeplantfield-topics block--field-blocknodeplantfield-topics flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n      <div class=\"field field--name-field-topics field--type-entity-reference field--label-hidden field__items\">\n              <div class=\"field__item\"><a href=\"/topics/gardening/edible-gardening/vegetables\" hreflang=\"en\">Vegetables</a></div>\n          </div>\n  \n      </div>\n      </div>\n\n\n<div class=\"views-element-container block block--author-bio block-views block-views-blockauthor-bio-block-1 block--views-blockauthor-bio-block-1 flex flex-col\">\n  \n      <div class=\"block__title block-title block-title--views-blockauthor-bio-block-1 w-full\">\n      About The Author\n    </div>\n    \n\n            <div class=\"block__content author-bio-content\">\n                <div class=\"author-bio-main\">\n                                                              \n                                            <div class=\"author-picture-wrapper\">\n                  <img src=\"/sites/default/files/pictures/2024-10/IMG_0365.jpeg\" alt=\"Catherine Boeckmann\" class=\"author-picture\">\n                </div>\n              \n                            <div class=\"author-info-section\">\n                                \n                    <h2 class=\"author-name\">Catherine Boeckmann</h2>\n\n                \n                                                  <h3 class=\"author-job-title\">Executive Digital Editor and Master Gardener</h3>\n                \n                                                                                                            <div class=\"author-bio\">Catherine Boeckmann is the Executive Digital Editor of Almanac.com, the website companion of The Old Farmer&#039;s Almanac. She covers gardening, plants, pest control, soil composition, seasonal and moon c...</div>\n                                  \n                                                  <div class=\"author-link-wrapper\">\n                    <a href=\"/author/catherine-boeckmann\" class=\"author-link\">\n                      Read More from Catherine Boeckmann\n                    </a>\n                  </div>\n                \n                                \n                                              </div>\n                              </div>\n      </div>\n      </div>\n\n      </div>\n    \n          <div  class=\"layout__region layout__region--second\">\n        \n\n<div class=\"block block-guides block-guides-toc-block block--guides-toc-block flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n\n      </div>\n      </div>\n\n      </div>\n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockmore-like-this-block-1 block--views-blockmore-like-this-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockmore-like-this-block-1 font-normal mt-0\">\n      More Like This\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-33b555c810e41a237e033f07b5e930669b504600cbd4a9da43d295b79752b7fa\">\n  \n  \n  \n\n  \n  \n  \n\n  \n\n\n<!-- Check if there are multiple rows -->\n  <!-- Multiple rows - wrap each in grid tile -->\n  <div class=\"grid gap-6 auto-rows-auto grid-cols-1 md:grid-cols-3 mb-2\">\n                                        <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/plant/cucumbers\">\n\n\n\n<article data-history-node-id=\"121301\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 121301\n    Current path: /plant/zucchini\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/growing%20cucumbers.jpg?itok=fdpqqlFB\" width=\"650\" height=\"366\" alt=\"cucumbers growing on the vine\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/plant/cucumbers\" hreflang=\"und\">How to Grow Cucumber Plants: Easy Guide to Planting &amp; Harvesting</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/vertical-garden\">\n\n\n\n<article data-history-node-id=\"130610\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 130610\n    Current path: /plant/zucchini\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/vertical.jpg?itok=iCcERVlh\" width=\"650\" height=\"366\" alt=\"vertical gardening ideas\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/vertical-garden\" hreflang=\"und\">How to Plan a Vertical Garden: Space-Saving Tips &amp; Design Ideas</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/favorite-winter-squash-varieties\">\n\n\n\n<article data-history-node-id=\"125855\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 125855\n    Current path: /plant/zucchini\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/shutterstock_719871823.jpg?itok=j10Zr_vu\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/favorite-winter-squash-varieties\" hreflang=\"und\">5 Favorite Winter Squash Varieties for Cooking</a></h3></div>\n            </div>\n                                                                <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"><a href=\"/video/how-make-tomato-cages-and-tomato-stakes\"><img src=\"/sites/default/files/styles/or/public/youtube/-9580IdYBiw.jpg?itok=0zfoLrzn\" width=\"1186\" height=\"667\" alt=\"Embedded thumbnail for How to Use Tomato Cages and Tomato Plant Stakes\" loading=\"lazy\" class=\"image-style-or\" />\n\n\n</a></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/video/how-make-tomato-cages-and-tomato-stakes\" hreflang=\"und\">How to Use Tomato Cages and Tomato Plant Stakes</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/mini-vegetable-ideas-small-garden-spaces\">\n\n\n\n<article data-history-node-id=\"126607\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 126607\n    Current path: /plant/zucchini\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/baby-boomer.jpg?itok=2yFlCc9y\" width=\"650\" height=\"366\" alt=\"\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/mini-vegetable-ideas-small-garden-spaces\" hreflang=\"und\">Mini-Vegetable Ideas for Small Garden Spaces</a></h3></div>\n            </div>\n                      <div class=\"views-view-grid-tile bg-white transition-all duration-300 overflow-hidden card-bordered-brick\">\n              <div class=\"views-field views-field-field-imageprimary\"><span class=\"field-content\"><a href=\"/types-gourds\">\n\n\n\n<article data-history-node-id=\"531806\" class=\"node node--type-image node--view-mode-content-grid-image\">\n  <header class=\"node__header\">\n    \n    \n    <!--s\n    DEBUG INFO:\n    Page: false\n    Is front: false\n    View mode: content_grid_image\n    Node type: image\n    Node ID: 531806\n    Current path: /plant/zucchini\n    -->\n\n                  \n\n      </header>\n\n\n\n            \n  <div class=\"node__content image-display--contained\">\n    \n      <div class=\"field field--name-field-photo field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">  <img loading=\"eager\" src=\"/sites/default/files/styles/landscape/public/image_nodes/Untitled%20design%20%284%29_16.jpg?itok=Hn7LNSQC\" width=\"650\" height=\"366\" alt=\"gourds on table in the fall.\" class=\"image-style-landscape\" />\n\n\n</div>\n          </div>\n  \n  </div>\n\n  </article>\n</a></span></div><div class=\"views-field views-field-field-youtube-url\"><span class=\"field-content\"></span></div><div class=\"views-field views-field-title\"><h3 class=\"field-content\"><a href=\"/types-gourds\" hreflang=\"und\">What Are Gourds? Types, Growing Tips, and Creative Uses</a></h3></div>\n            </div>\n                              </div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"views-element-container block block-views block-views-blockpost-roll-promotion-block-1 block--views-blockpost-roll-promotion-block-1 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div></div>\n\n      </div>\n      </div>\n\n    </div>\n  </div>\n  <div class=\"layout layout--twocol-section layout--twocol-section--67-33 more-like-this print-no\">\n\n          <div  class=\"layout__region layout__region--first\">\n        \n\n<div class=\"views-element-container block block-views block-views-blockcomment-form-block-1 block--views-blockcomment-form-block-1 flex flex-col\">\n  \n      <h3 class=\"block__title block-title block-title--views-blockcomment-form-block-1 font-normal mt-0\">\n      Comments\n    </h3>\n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        <div><div class=\"js-view-dom-id-5c21a888141cded8e36df44c5645e43c8c372d1aeceeb9977070172b8bbd63b8\">\n  \n  \n  \n\n  \n  \n  \n\n      <div class=\"views-row\"><div class=\"views-field views-field-nid\"><span class=\"field-content\"><a href=\"/comment/reply/node/90299/comment_node_plant\">Add a Comment</a></span></div></div>\n\n    \n\n  \n  \n\n  \n  \n</div>\n</div>\n\n      </div>\n      </div>\n\n\n\n<div class=\"views-element-container comment-ajax-wrapper\">\n  \n    \n      <div><div class=\"js-view-dom-id-463a7c22ec91b6f8228b1f5928f03a6584e4f1f7d71dcec814afa828caf9e89d\">\n  \n  \n  \n\n  \n  \n  \n\n  <div data-drupal-views-infinite-scroll-content-wrapper class=\"views-infinite-scroll-content-wrapper clearfix\">    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"133290\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Darlene L Martin&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sun, 03/03/2024 - 08:32</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"133290\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Very good information but I didn't see any companion planting in the article. Thank you.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-133290\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"130806\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Donna K Larocca&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sat, 08/05/2023 - 17:42</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"130806\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I asking to help my friend and learn myself, too.  My friend's yellow squash is producing nothing but male flowers, and has been doing so for weeks, ever since it got big enough to flower.  Does this mean the plant is getting the wrong food (or no feeding)?  Too high in nitrogen, so getting lots of big leaves?  What can give the plant a boost to start making female flowers and therefore fruit?  Earliest possible answer is appreciated, so we still have some summer left.  This is Bonney Lake, Washington.  Thank you!\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-130806\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"130831\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Mon, 08/07/2023 - 16:51</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"130831\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p class=\"MsoNormal\">Dear Donna,&nbsp;</p><p class=\"MsoNormal\">From what you describe, two things come to mind. If you had a hot spell in Bonney Lake earlier in the summer, that can discourage female flower growth. Poor pollination by bees is also a common &nbsp;issue. Squash flowers will not bear fruit or bear only small fruit if not pollinated. To fruit, pollen from the male flowers must be transferred to the female flowers by bees—or by the gardener. Pollinate the female flowers manually with a cotton swab or add plants that attract bees near the squash. See our article on how to&nbsp;<a href=\"https://www.almanac.com/content/why-my-squash-not-fruiting\">hand pollinate your squash blossoms</a>&nbsp;for better&nbsp;yields.&nbsp;</p><p class=\"MsoNormal\">—The Editors</p><p class=\"MsoNormal\"><o:p></o:p></p>\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-130831\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"130732\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Mark&lt;/span&gt;</span>\n        <span class=\"comment-time\">Mon, 07/31/2023 - 00:12</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"130732\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I don't know why people say plant zucchini and other squash with large leaves in \"full sun,\" unless they live on some chilly wasteland.   Where I live full sun means a generally low humidity 90-110 F high temps and any broad leaved plant like zuccini or other squashes (or even spinach or beets or bok choi) will wilt and die in that condition no matter how much you water it.  In general DO NOT plant broad leafed veggies in full sun.  They are forest floor plants, they have broad big green leaves to make use of limited sun light.  If you've ever toured where professional produce growers grow broad leaved veggies, they tend to have partial shade covers over their grow plots.   Best place to grow Zuccini is where it gets morning sun then shade by noon.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-130732\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"129321\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Alejandra&lt;/span&gt;</span>\n        <span class=\"comment-time\">Thu, 05/04/2023 - 14:09</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"129321\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Zuchinno rampicante is a very long light green squash with a sweet flavor. A great climber. Zapallito de tronco is a south american green summer squash with pale yellow flesh. very easy to grow. 4 to 6 inch wide flattened globes.\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-129321\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"125227\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Lois Miller&lt;/span&gt;</span>\n        <span class=\"comment-time\">Fri, 07/29/2022 - 14:17</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"125227\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I have planted several bush-type zucchinis in balcony containers. They are producing lots of fruit, but the fruit are small and shrivelled at the blossom ends. I plan to add more soil including manure and peat moss, and move them to a brighter part of the balcony, hoping that more nutrition and sun will help. Perhaps uneven watering has been a problem. Any suggestions?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-125227\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"125292\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Thu, 08/04/2022 - 10:53</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"125292\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Hi Lois. Thanks for writing in!</p>\r\n\r\n<p>There are a number of factors that can be affecting your plants' growth. Growing zucchinis in containers can be tricky because they are more dependent on you for nutrients, especially calcium, which is needed for fruit production.</p>\r\n\r\n<p>Small fruit can also be a sign of poor pollination, drought stress, or lack of sunlight. It is important to have pollinator attracting plants near your zucchinis for best pollination. Zucchinis need at least an inch of water each week and it is even more important to be mindful of watering practices when growing in containers. Zucchinis also need 6 to 8 hours of direct sunlight each day. You can also certainly add some organic matter to the existing soil.</p>\r\n\r\n<p>Blossom end rot is also a possibility, but in those cases the fruit typically shrivels and rots in a short amount of time. Hope this helps!</p>\r\n\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-125292\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"124903\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Najiba Berry&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sat, 07/09/2022 - 10:32</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"124903\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      I needed to plant my zucchini in a planter. Any suggestions for a good outcome?\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-124903\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"124969\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  \n            <div class=\"field field--name-user-picture field--type-image field--label-hidden field__item\">  <a href=\"/author/editors\" hreflang=\"en\"><img loading=\"lazy\" src=\"/sites/default/files/styles/thumbnail/public/pictures/picture-343787-1548684969.jpg?itok=sYwPCglb\" width=\"82\" height=\"100\" alt=\"Profile picture for user The Editors\" class=\"image-style-thumbnail\" />\n\n</a>\n</div>\n      </article>\n</span>\n                <span class=\"comment-author\">&lt;a title=&quot;View user profile.&quot; href=&quot;/author/editors&quot;&gt;The Editors&lt;/a&gt;</span>\n        <span class=\"comment-time\">Wed, 07/13/2022 - 15:39</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"124969\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      <p>Zucchini isn't normally planted in a container but you can do it if you buy the right seeds. Look for 'compact' or 'container' types. Plant 2 seeds in 14-inch pots or planters. Once they germinate, you'll remove the weaker one. You'll certainly need to look into watering and fertilizer if growing in a container since the plant will rely on you versus mother nature for food.&nbsp;</p>\r\n\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-124969\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n    <div class=\"views-row\"><div class=\"comment-wrapper comments-tailwind\">\n  <article class=\"js-comment comment-form-styled\" data-comment-id=\"123841\">\n    <div class=\"comment-header\">\n      <div class=\"attribution\">\n                  <span class=\"user-picture-circle\"><article>\n  </article>\n</span>\n                <span class=\"comment-author\">&lt;span&gt;Anne&lt;/span&gt;</span>\n        <span class=\"comment-time\">Sat, 05/14/2022 - 09:36</span>\n      </div>\n      <div class=\"comment-actions\">\n        <button class=\"comment-reply-link\"\n                data-comment-id=\"123841\"\n                data-entity-type=\"node\"\n                data-entity-id=\"90299\"\n                data-field-name=\"comment_node_plant\"\n                aria-label=\"Reply to this comment\">Reply</button>\n      </div>\n    </div>\n    <div class=\"comment-body\">\n      Yellow Summer Squash lightly steamed is par excellence with butter/lemon juice~\n    </div>\n    <div class=\"comment-reply-form-wrapper\" id=\"comment-reply-form-123841\" style=\"display: none;\">\n      <div class=\"reply-form-header\">\n        <h4>Reply to comment</h4>\n        <button class=\"reply-form-close\" aria-label=\"Close reply form\">×</button>\n      </div>\n      <div class=\"reply-form-container\"></div>\n    </div>\n  </article>\n</div>\n</div>\n</div>\n\n    \n<div class=\"comment-pager-wrapper\">\n  <ul class=\"comment-pagination js-pager__items\" data-drupal-views-infinite-scroll-pager>\n        \n              <li class=\"pager__item\">\n        <span class=\"pager-previous disabled button\">« Previous</span>\n      </li>\n    \n        \n              <li class=\"pager__item\">\n                  <span class=\"current-page button\">1</span>\n              </li>\n          <li class=\"pager__item\">\n                  <a href=\"?page=1\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to page 2\">2</a>\n              </li>\n    \n              <li class=\"pager__item\">\n        <span class=\"pager-ellipsis button\">…</span>\n      </li>\n      <li class=\"pager__item\">\n        <a href=\"?page=9\" class=\"use-ajax button js-pager__item\" data-drupal-views-infinite-scroll-pager-link title=\"Go to last page\">10</a>\n      </li>\n    \n        <li class=\"pager__item\">\n      <a href=\"?page=1\" class=\"use-ajax button js-pager__item pager-next\" data-drupal-views-infinite-scroll-pager-link title=\"Go to next page\" rel=\"next\">Next »</a>\n    </li>\n  </ul>\n</div>\n\n\n  \n  \n\n  \n  \n</div>\n</div>\n\n  </div>\n\n      </div>\n    \n    \n  </div>\n  <div class=\"layout layout--onecol\">\n    <div  class=\"layout__region layout__region--content\">\n      \n\n<div class=\"store-logo block block-block-content block-block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 block--block-content6ff07ef8-d339-4e92-97b7-dc8a29294275 flex flex-col\">\n  \n    \n\n            <div class=\"block__content block-content flex flex-col flex-grow\">\n        \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                            \n        <div style=\"align-items:center;background-color:#005336;display:flex;flex-wrap:wrap;gap:20px;justify-content:space-evenly;margin-bottom:20px;margin-top:40px;padding:10px;width:100%;\"><div style=\"color:#fff;\">📣<strong>The Gardening Club Just Got Better!</strong> 3 Deliveries, 10% Store Discount, and more!</div><div><a class=\"text-button\" href=\"https://store.almanac.com/pages/most-popular-club\" target=\"blank\">Learn More</a></div></div><a href=\"https://store.almanac.com/\" target=\"_blank\"><img src=\"https://www.almanac.com/sites/default/files/promotion/old-farmers-almanac-store-logo-1200px.jpg\" data-entity-uuid=\"c84260b7-88a4-4419-a3ff-3e408f8c6c79\" data-entity-type=\"file\" alt=\"The Old Farmer's Almanac Store\" width=\"600\" height=\"77\" align=\"center\" class=\"align-center\" loading=\"lazy\"></a></p>\n      </div>\n      \n      </div>\n      </div>\n<div class=\"content-recommender print-no block block-block-content block-block-contentfdd6ba48-ec8e-4e76-8008-f0a9ba0e596b listrak-recommendations\">\n  \n    \n\n  <div class=\"block__content\">\n    <div class=\"listrak-products-wrapper\">\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden clearfix text-formatted field__item\">\n                \n                                                                                                                                                                                                                                                                                                                                                                                                \n        <div class=\"recommender-wrapper\" data-ltk-merchandiseblock=\"f5f04466-f923-491d-9354-679d54e32def\">\n    <script type=\"text/html\">\n        var linkRoot = \"https://store.almanac.com.com\";\n        <div class=\"prod-rec\">\n            <a onclick=\"ga('send', {hitType: 'event', eventCategory: 'Products', eventAction: 'Click', eventLabel: '@Recommendation.Title', transport: 'beacon'});\" href=\"@(linkRoot + Recommendation.LinkUrl)\" target=\"_blank\">\n                <div class=\"rec-image\"><img class=\"prod-image\" src=\"@Recommendation.ImageUrl\" alt=\"View @Recommendation.Title recommended for you\" height=\"250\" /></div>\n                <p class=\"prod-title\">@Recommendation.Title</p>\n                <p>$@Recommendation.Price</p>\n                <p class=\"rec-button\">BUY NOW</p>\n            </a>\n        </div>\n    </script>\n</div>           \n</p>\n      </div>\n      \n    </div>\n  </div>\n</div>\n\n    </div>\n  </div>\n\n  </div>\n\n  </article>\n\n      </div>\n      </div>\n\n  </div>\n\n    \n  </section>\n\n  </main>\n\n<footer id=\"page-footer\">\n    <div class=\"w-full bg-sand newsletter-signup-footer\">\n    <div class=\"max-w-[85rem] mx-auto md:px-20\">\n\n      <div class=\"flex-nowrap w-full md:w-auto pt-8 text-center md:text-left\">\n        <h4 class=\"text-xl md:text-2xl font-normal font-sans leading-tight text-black mb-2\">Get Almanac's Daily Updates</h4>\n      </div>\n\n      <div class=\"flex flex-col md:flex-row items-center justify-between gap-6 pb-8\">\n                <div class=\"text-center md:text-left flex-1\">\n          <p class=\"text-base md:text-lg text-black\">\n            <span class=\"uppercase font-bold\">BONUS</span>: You'll also receive our free <em>Beginner Gardening Guide!</em>\n          </p>\n        </div>\n\n                <div class=\"flex-grow w-full md:w-auto\">\n          <form class=\"flex flex-col sm:flex-row gap-3 md:gap-4 w-full md:w-auto sm:px-4 p-0\" action=\"/\" method=\"post\">\n            <input\n              type=\"email\"\n              name=\"email\"\n              placeholder=\"Enter your email address\"\n              class=\"flex-1 px-3 py-2 md:px-4 md:py-3 text-gray-900 bg-white focus:outline-none focus:ring-2 focus:ring-brick-red placeholder-gray-500\"\n              required\n            >\n            <button\n              type=\"submit\"\n              class=\"px-4 py-2 md:px-6 md:py-3 bg-brick-red text-white font-bold hover:bg-dark-red focus:outline-none focus:ring-2 focus:ring-brick-red transition-colors whitespace-nowrap\"\n            >\n              Go\n            </button>\n          </form>\n        </div>\n      </div>\n    </div>\n  </div>\n\n    <div class=\"layout layout--page max-w-[85rem] mx-auto\">\n    <div class=\"container mx-auto pb-12\">\n      \n<div class=\"region region--footer-top footer-top-region\">\n  <div class=\"section--container\">\n    <div class=\"grid grid-cols-1 md:grid-cols-3 gap-8\">\n      <nav  id=\"block-almanac-general\" class=\"block block-menu navigation menu--general\" aria-labelledby=\"block-almanac-general-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-general-menu\">Our Brands</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"https://store.almanac.com/\">The Old Farmer’s Almanac Store</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://newengland.com/\">Yankee Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.familytreemagazine.com/\">Family Tree Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhbr.com/\">NH Business Review</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://www.nhmagazine.com/\">New Hampshire Magazine</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://yankeecustommarketing.com/\">Yankee Custom Marketing</a>\n              </li>\n      </ul>\n\n  </nav>\n<nav  id=\"block-almanac-resources\" class=\"block block-menu navigation menu--resources\" aria-labelledby=\"block-almanac-resources-menu\" role=\"navigation\">\n      \n  <div class=\"block__title footer-category-heading\" id=\"block-almanac-resources-menu\">Resources</div>\n  \n\n        \n  <ul class=\"menu\">\n          <li class=\"menu-item \">\n        <a href=\"/about-us\">About Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/contact\">Contact Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/signup\">Free Daily Newsletter</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/webcam\">Webcam</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediakit\">Advertise with Us</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/mediaroom\">Media Relations</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/retail\">Sell the Almanac</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"/wheretobuy\">Where to Buy</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/terms-of-use/\">Terms of Use</a>\n              </li>\n          <li class=\"menu-item \">\n        <a href=\"https://ypi.com/privacy-policy\">Privacy Policy</a>\n              </li>\n      </ul>\n\n  </nav>\n<div class=\"social-menu flex\">\n  \n<a href=\"https://www.facebook.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M46.4233 38.6403L47.7279 30.3588H39.6917V24.9759C39.6917 22.7114 40.8137 20.4987 44.4013 20.4987H48.1063V13.4465C45.9486 13.1028 43.7685 12.9168 41.5834 12.8901C34.9692 12.8901 30.651 16.8626 30.651 24.0442V30.3588H23.3193V38.6403H30.651V58.671H39.6917V38.6403H46.4233Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.instagram.com/theoldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M27.3762 35.7808C27.3762 31.1786 31.1083 27.4468 35.7132 27.4468C40.3182 27.4468 44.0522 31.1786 44.0522 35.7808C44.0522 40.383 40.3182 44.1148 35.7132 44.1148C31.1083 44.1148 27.3762 40.383 27.3762 35.7808ZM22.8683 35.7808C22.8683 42.8708 28.619 48.618 35.7132 48.618C42.8075 48.618 48.5581 42.8708 48.5581 35.7808C48.5581 28.6908 42.8075 22.9436 35.7132 22.9436C28.619 22.9436 22.8683 28.6908 22.8683 35.7808ZM46.0648 22.4346C46.0646 23.0279 46.2404 23.608 46.5701 24.1015C46.8997 24.595 47.3684 24.9797 47.9168 25.2069C48.4652 25.4342 49.0688 25.4939 49.6511 25.3784C50.2334 25.2628 50.7684 24.9773 51.1884 24.5579C51.6084 24.1385 51.8945 23.6041 52.0105 23.0222C52.1266 22.4403 52.0674 21.8371 51.8404 21.2888C51.6134 20.7406 51.2289 20.2719 50.7354 19.942C50.2418 19.6122 49.6615 19.436 49.0679 19.4358H49.0667C48.2708 19.4361 47.5077 19.7522 46.9449 20.3144C46.3821 20.8767 46.0655 21.6392 46.0648 22.4346ZM25.6072 56.1302C23.1683 56.0192 21.8427 55.6132 20.9618 55.2702C19.7939 54.8158 18.9606 54.2746 18.0845 53.4002C17.2083 52.5258 16.666 51.6938 16.2133 50.5266C15.8699 49.6466 15.4637 48.3214 15.3528 45.884C15.2316 43.2488 15.2073 42.4572 15.2073 35.781C15.2073 29.1048 15.2336 28.3154 15.3528 25.678C15.4639 23.2406 15.8731 21.918 16.2133 21.0354C16.668 19.8682 17.2095 19.0354 18.0845 18.1598C18.9594 17.2842 19.7919 16.7422 20.9618 16.2898C21.8423 15.9466 23.1683 15.5406 25.6072 15.4298C28.244 15.3086 29.036 15.2844 35.7132 15.2844C42.3904 15.2844 43.1833 15.3106 45.8223 15.4298C48.2612 15.5408 49.5846 15.9498 50.4677 16.2898C51.6356 16.7422 52.4689 17.2854 53.345 18.1598C54.2211 19.0342 54.7615 19.8682 55.2161 21.0354C55.5595 21.9154 55.9658 23.2406 56.0767 25.678C56.1979 28.3154 56.2221 29.1048 56.2221 35.781C56.2221 42.4572 56.1979 43.2466 56.0767 45.884C55.9656 48.3214 55.5573 49.6462 55.2161 50.5266C54.7615 51.6938 54.2199 52.5266 53.345 53.4002C52.4701 54.2738 51.6356 54.8158 50.4677 55.2702C49.5872 55.6134 48.2612 56.0194 45.8223 56.1302C43.1855 56.2514 42.3934 56.2756 35.7132 56.2756C29.033 56.2756 28.2432 56.2514 25.6072 56.1302ZM25.4001 10.9322C22.7371 11.0534 20.9174 11.4754 19.3282 12.0934C17.6824 12.7316 16.2892 13.5878 14.897 14.977C13.5047 16.3662 12.6502 17.7608 12.0116 19.4056C11.3933 20.9948 10.971 22.8124 10.8497 25.4738C10.7265 28.1394 10.6982 28.9916 10.6982 35.7808C10.6982 42.57 10.7265 43.4222 10.8497 46.0878C10.971 48.7494 11.3933 50.5668 12.0116 52.156C12.6502 53.7998 13.5049 55.196 14.897 56.5846C16.289 57.9732 17.6824 58.8282 19.3282 59.4682C20.9204 60.0862 22.7371 60.5082 25.4001 60.6294C28.0687 60.7506 28.92 60.7808 35.7132 60.7808C42.5065 60.7808 43.3592 60.7526 46.0264 60.6294C48.6896 60.5082 50.5081 60.0862 52.0983 59.4682C53.7431 58.8282 55.1373 57.9738 56.5295 56.5846C57.9218 55.1954 58.7745 53.7998 59.4149 52.156C60.0332 50.5668 60.4575 48.7492 60.5768 46.0878C60.698 43.4202 60.7262 42.57 60.7262 35.7808C60.7262 28.9916 60.698 28.1394 60.5768 25.4738C60.4555 22.8122 60.0332 20.9938 59.4149 19.4056C58.7745 17.7618 57.9196 16.3684 56.5295 14.977C55.1395 13.5856 53.7431 12.7316 52.1003 12.0934C50.5081 11.4754 48.6894 11.0514 46.0284 10.9322C43.3612 10.811 42.5085 10.7808 35.7152 10.7808C28.922 10.7808 28.0687 10.809 25.4001 10.9322Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.linkedin.com/company/old-farmers-almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 72 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M24.7612 55.999V28.3354H15.5433V55.999H24.7621H24.7612ZM20.1542 24.5591C23.3679 24.5591 25.3687 22.4348 25.3687 19.7801C25.3086 17.065 23.3679 15 20.2153 15C17.0605 15 15 17.065 15 19.7799C15 22.4346 17.0001 24.5588 20.0938 24.5588H20.1534L20.1542 24.5591ZM29.8633 55.999H39.0805V40.5521C39.0805 39.7264 39.1406 38.8985 39.3841 38.3088C40.0502 36.6562 41.5668 34.9455 44.1138 34.9455C47.4484 34.9455 48.7831 37.4821 48.7831 41.2014V55.999H58V40.1376C58 31.6408 53.4532 27.6869 47.3887 27.6869C42.4167 27.6869 40.233 30.4589 39.0198 32.347H39.0812V28.3364H29.8638C29.9841 30.9316 29.8631 56 29.8631 56L29.8633 55.999Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.pinterest.com/almanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 72\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      d=\"M33.2808 13.0437C25.8492 13.893 18.4439 20.0479 18.1382 28.84C17.9461 34.2083 19.435 38.2356 24.4258 39.3664C26.5915 35.4553 23.7272 34.5927 23.2818 31.7633C21.4523 20.1686 36.346 12.2615 44.14 20.3563C49.5324 25.9615 45.9826 43.206 37.2848 41.4136C28.9537 39.7017 41.3629 25.9749 34.713 23.2796C29.3074 21.0894 26.4343 29.9798 28.9974 34.396C27.4953 41.9902 24.2599 49.1464 25.5698 58.6715C29.8183 55.5158 31.2504 49.4727 32.425 43.1702C34.5601 44.4978 35.6998 45.8789 38.4244 46.0935C48.4714 46.8891 54.0822 35.8263 52.7112 25.6218C51.4929 16.5749 42.6729 11.971 33.2808 13.0437Z\"\n      fill=\"currentColor\"\n    />\n  </svg>\n</a>\n\n\n<a href=\"https://www.youtube.com/user/oldfarmersalmanac\" target=\"_blank\"\n  class=\"p-2 flex items-center justify-center transition-all duration-500 group hover:text-brick-red\">\n  <svg xmlns=\"http://www.w3.org/2000/svg\" width=\"28\" height=\"28\" viewBox=\"0 0 71 71\"\n  fill=\"none\" class=\"fill-white opacity-30 group-hover:opacity-100\">\n    <path\n      fill-rule=\"evenodd\" clip-rule=\"evenodd\"\n      d=\"M56.5615 18.2428C58.8115 18.8504 60.58 20.6234 61.1778 22.8708C62.2654 26.9495 62.2654 35.4647 62.2654 35.4647C62.2654 35.4647 62.2654 43.98 61.1778 48.0586C60.5717 50.3144 58.8032 52.0873 56.5615 52.6866C52.4932 53.7771 36.1703 53.7771 36.1703 53.7771C36.1703 53.7771 19.8557 53.7771 15.7791 52.6866C13.5291 52.079 11.7606 50.306 11.1628 48.0586C10.0752 43.98 10.0752 35.4647 10.0752 35.4647C10.0752 35.4647 10.0752 26.9495 11.1628 22.8708C11.7689 20.615 13.5374 18.8421 15.7791 18.2428C19.8557 17.1523 36.1703 17.1523 36.1703 17.1523C36.1703 17.1523 52.4932 17.1523 56.5615 18.2428ZM44.5142 35.4647L30.9561 43.314V27.6154L44.5142 35.4647Z\"\n      fill=\"currentColor\"\n      />\n  </svg>\n</a>\n\n\n</div>\n\n    </div>\n  </div>\n</div>\n\n\n      <div class=\"social-menu grid grid-cols-5 gap-8\">\n        \n      </div>\n\n      <div class=\"text-sm text-gray-600 flex justify-between mt-24 mb-12\">\n        <div>\n            © 2025 <a href=\"https://ypi.com/\" target=\"_blank\" class=\"inline\">Yankee Publishing Inc.</a>, An Employee-Owned Company.\n        </div>\n        <div>\n          1121 Main Street | P.O. Box 520 | Dublin, NH 03444\n        </div>\n      </div>\n    </div>\n  </div>\n</footer>\n\n  </div>\n\n\n  <div class=\"region region--page-bottom\">\n    \n  </div>\n\n  \n  <script type=\"application/json\" data-drupal-selector=\"drupal-settings-json\">{\"path\":{\"baseUrl\":\"\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/90299\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"eJxNj1uOwzAIRTdklyVZxCERKjYWxq28-0mbpJof4D4-DigFK2bYRReU2H0K1z3gZQtOHR6XwbKSxT5aU_Nf3IwL2ozH3ClmrW4qIQthdZQnYFuyxzYW4RyylkLVYbXRUB6XjMuML6Y32V1Im1qBWzTcuaKz1rDi7GlUZ4EPJ_WwsTgZZGzfwkmbLlrwt2aV1Cn_T1fuWV9kE7TSkQfh7oZPuHbw2XQ33ib8rvAh7PCdj6LrEDqtxHXjyk6p5-N1OSvxduPp_gHbNY0b\",\"theme\":\"almanac\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:463a7c22ec91b6f8228b1f5928f03a6584e4f1f7d71dcec814afa828caf9e89d\":{\"view_name\":\"comments_with_ajax_\",\"view_display_id\":\"block_1\",\"view_args\":\"90299\",\"view_path\":\"\\/node\\/90299\",\"view_base_path\":null,\"view_dom_id\":\"463a7c22ec91b6f8228b1f5928f03a6584e4f1f7d71dcec814afa828caf9e89d\",\"pager_element\":0}}},\"almanac\":{\"adExclusions\":{\"fullExclude\":[\"\\/retail\",\"\\/mediakit\",\"\\/club\",\"\\/winter\",\"\\/mediaroom\",\"\\/kids\",\"\\/old-farmers-almanac-promotional-images\"],\"videoOnly\":[\"\\/how-to-kill-poison-ivy\",\"\\/wheretobuy\",\"\\/feminized-seeds\",\"\\/autoflower-seeds\",\"\\/how-to-germinate-cannabis-seeds\"]}},\"user\":{\"uid\":0,\"permissionsHash\":\"a870a3cd03311fe2742a98671d86d33235d0ba55333d275d5575e9fd83f56f7e\"}}</script>\n<script src=\"/core/misc/drupalSettingsLoader.js?v=11.2.4\"></script>\n<script src=\"/themes/almanac/dist/js/scripts.js?t4yh8p\"></script>\n<script src=\"/modules/contrib/views_infinite_scroll/js/infinite-scroll.js?v=11.2.4\"></script>\n\n</body>\n</html>\n",
  "scrapedAt" : "2025-11-02T20:43:33.905453Z",
  "successful" : true,
  "errorMessage" : null
}